-- MySQL dump 10.13  Distrib 9.7.1, for Linux (x86_64)
--
-- Host: localhost    Database: MYSQL_DATABASE
-- ------------------------------------------------------
-- Server version	9.7.1

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
SET @MYSQLDUMP_TEMP_LOG_BIN = @@SESSION.SQL_LOG_BIN;
SET @@SESSION.SQL_LOG_BIN= 0;

--
-- GTID state at the beginning of the backup 
--

SET @@GLOBAL.GTID_PURGED=/*!80000 '+'*/ 'cf009881-6f96-11f1-bdb3-fa9585fa8570:1-379';

--
-- Table structure for table `advice_log`
--

DROP TABLE IF EXISTS `advice_log`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `advice_log` (
  `advice_id` bigint NOT NULL AUTO_INCREMENT,
  `student_id` bigint NOT NULL,
  `advisor_id` bigint NOT NULL,
  `topic` varchar(255) DEFAULT NULL,
  `log_type` varchar(20) NOT NULL DEFAULT 'academic',
  `advice_note` text COMMENT 'รายละเอียดการพูดคุย/คำแนะนำ',
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`advice_id`),
  KEY `student_id` (`student_id`),
  KEY `advisor_id` (`advisor_id`),
  CONSTRAINT `advice_log_ibfk_1` FOREIGN KEY (`student_id`) REFERENCES `student` (`student_id`) ON DELETE RESTRICT ON UPDATE RESTRICT
) ENGINE=InnoDB AUTO_INCREMENT=6 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `advice_log`
--

LOCK TABLES `advice_log` WRITE;
/*!40000 ALTER TABLE `advice_log` DISABLE KEYS */;
INSERT INTO `advice_log` VALUES (1,6603400001,5,'แนะนำการลงทะเบียนเรียน','academic','นักศึกษาสอบถามการลงทะเบียนวิชาเลือก แนะนำให้เลือกตามความสนใจและตารางเวลา','2026-07-08 03:45:02'),(2,6603400002,5,'ติดตามผลการเรียน','warning','ผลการเรียนภาคที่ผ่านมาลดลง นัดติดตามอีกครั้งปลายเดือน','2026-07-08 03:45:02'),(3,6603400004,5,'ปรับตัวเข้ากับการเรียน','personal','ให้คำปรึกษาเรื่องการปรับตัว แนะนำเข้าร่วมกิจกรรมของคณะ','2026-07-08 03:45:02');
/*!40000 ALTER TABLE `advice_log` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `approval_requests`
--

DROP TABLE IF EXISTS `approval_requests`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `approval_requests` (
  `approval_request_id` bigint NOT NULL AUTO_INCREMENT,
  `request_type` varchar(50) NOT NULL,
  `requester_user_id` bigint DEFAULT NULL,
  `target_ref_type` varchar(50) DEFAULT NULL,
  `target_ref_id` varchar(100) DEFAULT NULL,
  `title` varchar(255) NOT NULL,
  `description` text,
  `status` enum('pending','approved','rejected') NOT NULL DEFAULT 'pending',
  `review_note` text,
  `reviewed_by` bigint DEFAULT NULL,
  `reviewed_at` timestamp NULL DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`approval_request_id`),
  KEY `idx_approval_requests_status` (`status`),
  KEY `idx_approval_requests_type` (`request_type`),
  KEY `idx_approval_requests_requester` (`requester_user_id`),
  KEY `idx_approval_requests_reviewer` (`reviewed_by`)
) ENGINE=InnoDB AUTO_INCREMENT=6 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `approval_requests`
--

LOCK TABLES `approval_requests` WRITE;
/*!40000 ALTER TABLE `approval_requests` DISABLE KEYS */;
INSERT INTO `approval_requests` VALUES (1,'grade_change',2,'assessment','64010001-NUR101','ขอแก้ไขเกรด','ขอแก้ไขเกรดนักศึกษา 64010001 วิชา NUR101','pending',NULL,NULL,NULL,'2024-01-15 09:00:00','2026-06-19 23:00:33'),(2,'student_transfer',3,'student','65010002','ขอรับมอบนักศึกษา','ขอรับมอบนักศึกษา 65010002 จากอาจารย์ที่ปรึกษาเดิม','pending',NULL,NULL,NULL,'2024-01-14 10:30:00','2026-06-19 23:00:33'),(3,'project_request',4,'project','research-skill-development','ขอเปิดโครงการวิจัย','ขอเปิดโครงการวิจัย: การพัฒนาทักษะการพยาบาล','pending',NULL,NULL,NULL,'2024-01-12 13:15:00','2026-06-19 23:00:33'),(4,'document_approve',6,'document','TQF3-NUR301','ขออนุมัติเอกสาร','ขออนุมัติเอกสาร TQF 3 รายวิชา NUR301','approved',NULL,5,'2024-01-11 11:00:00','2024-01-10 08:45:00','2026-06-19 23:00:33'),(5,'grade_change',7,'assessment','63010005-NUR401','ขอแก้ไขเกรด','ขอแก้ไขเกรดนักศึกษา 63010005 วิชา NUR401','rejected',NULL,5,'2024-01-09 15:20:00','2024-01-08 14:00:00','2026-06-19 23:00:33');
/*!40000 ALTER TABLE `approval_requests` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `assessments`
--

DROP TABLE IF EXISTS `assessments`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `assessments` (
  `assessments_id` bigint NOT NULL AUTO_INCREMENT,
  `student_id` bigint NOT NULL,
  `ylo_id` bigint NOT NULL COMMENT 'ประเมินตามเกณฑ์ YLO ตัวไหน',
  `assessor_id` bigint DEFAULT NULL COMMENT 'ผู้ประเมิน (อาจารย์)',
  `pass_status` tinyint(1) DEFAULT NULL COMMENT 'ผลการประเมิน (ผ่าน/ไม่ผ่าน)',
  PRIMARY KEY (`assessments_id`),
  KEY `student_id` (`student_id`),
  KEY `ylo_id` (`ylo_id`),
  KEY `assessor_id` (`assessor_id`),
  CONSTRAINT `assessments_ibfk_1` FOREIGN KEY (`student_id`) REFERENCES `student` (`student_id`) ON DELETE RESTRICT ON UPDATE RESTRICT,
  CONSTRAINT `assessments_ibfk_2` FOREIGN KEY (`ylo_id`) REFERENCES `ylo` (`ylo_id`) ON DELETE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `assessments`
--

LOCK TABLES `assessments` WRITE;
/*!40000 ALTER TABLE `assessments` DISABLE KEYS */;
/*!40000 ALTER TABLE `assessments` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `audit_log`
--

DROP TABLE IF EXISTS `audit_log`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `audit_log` (
  `audit_log_id` bigint NOT NULL AUTO_INCREMENT,
  `user_id` bigint NOT NULL COMMENT 'ใครทำรายการ',
  `action_type` enum('create','update','delete','login','logout','role_change') DEFAULT 'update',
  `resource` varchar(100) DEFAULT 'ระบบ',
  `details` text COMMENT 'รายละเอียดการกระทำ',
  `ip_address` varchar(45) DEFAULT '127.0.0.1',
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP COMMENT 'ทำเมื่อไหร่',
  PRIMARY KEY (`audit_log_id`),
  KEY `user_id` (`user_id`),
  CONSTRAINT `audit_log_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`user_id`) ON DELETE CASCADE ON UPDATE RESTRICT
) ENGINE=InnoDB AUTO_INCREMENT=255 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `audit_log`
--

LOCK TABLES `audit_log` WRITE;
/*!40000 ALTER TABLE `audit_log` DISABLE KEYS */;
INSERT INTO `audit_log` VALUES (1,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-23 16:56:10'),(2,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-24 11:52:16'),(3,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-24 19:26:04'),(4,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-24 19:31:43'),(5,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-24 19:43:19'),(6,8,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-24 19:52:26'),(7,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-24 19:53:02'),(8,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-25 15:09:03'),(9,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-25 15:31:22'),(10,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-25 15:59:35'),(11,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-25 16:46:02'),(12,8,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-25 17:36:24'),(13,2,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-25 17:40:01'),(14,8,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-25 17:40:10'),(15,8,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-25 17:41:09'),(16,8,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-25 17:43:14'),(17,8,'create','ผู้ใช้','สร้างบัญชีผู้ใช้ใหม่ (Username: 42172025)','172.18.0.1','2026-05-25 17:50:02'),(18,9,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-25 17:50:08'),(19,9,'create','ผู้ใช้','สร้างบัญชีผู้ใช้ใหม่ (Username: 44172033)','172.18.0.1','2026-05-25 17:51:02'),(20,10,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-25 17:52:31'),(21,9,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-25 17:52:54'),(22,10,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-25 18:19:23'),(23,9,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-25 18:20:58'),(24,4,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-25 18:37:41'),(25,2,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-25 18:37:48'),(26,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-25 18:39:47'),(27,6,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-25 18:48:21'),(28,4,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-25 18:48:40'),(29,3,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-25 18:49:06'),(30,7,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-25 18:49:34'),(31,9,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-25 18:50:20'),(32,10,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-25 18:50:35'),(33,7,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-25 18:50:52'),(34,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-25 18:57:33'),(35,9,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-25 18:58:44'),(36,10,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-25 18:59:10'),(37,7,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-25 18:59:39'),(38,8,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-25 18:59:49'),(39,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-25 19:04:57'),(40,7,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-25 19:26:58'),(41,6,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-25 19:27:09'),(42,7,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-25 19:42:17'),(43,6,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-25 19:42:32'),(44,6,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-25 19:44:03'),(45,4,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-25 19:44:21'),(46,8,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-25 19:45:08'),(47,6,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-25 19:46:11'),(48,4,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-25 19:46:31'),(49,8,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-25 19:46:45'),(50,10,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-25 19:47:10'),(51,9,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-25 19:47:28'),(52,7,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-25 19:47:43'),(53,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-25 19:47:59'),(54,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-26 16:43:33'),(55,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-26 17:39:24'),(56,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-26 17:39:42'),(57,7,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-26 17:41:30'),(58,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-26 17:41:51'),(59,6,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-26 17:41:59'),(60,4,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-26 17:42:06'),(61,10,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-26 17:47:05'),(62,4,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-26 17:50:16'),(63,3,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-26 17:50:26'),(64,7,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-26 17:50:33'),(65,9,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-26 17:50:43'),(66,8,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-26 17:51:00'),(67,6,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-26 17:51:25'),(68,4,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-26 17:51:34'),(69,3,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-26 17:56:40'),(70,4,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-26 17:56:47'),(71,4,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-26 17:59:00'),(72,4,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-26 17:59:48'),(73,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-26 18:08:09'),(74,1,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-26 18:09:44'),(75,1,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-26 18:15:53'),(76,1,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-26 18:18:40'),(77,1,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-26 18:24:46'),(78,1,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-26 18:27:01'),(79,1,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-26 18:34:55'),(80,1,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-26 18:39:18'),(81,1,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-26 18:41:09'),(82,1,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-26 19:05:40'),(83,1,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-26 19:06:09'),(84,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-26 19:32:39'),(85,1,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-26 19:35:21'),(86,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-26 19:37:05'),(87,1,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-26 19:41:31'),(88,1,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-26 19:48:22'),(89,4,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-26 19:55:50'),(90,1,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-26 19:56:02'),(91,1,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-26 19:57:54'),(92,1,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-26 20:15:18'),(93,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-26 20:15:26'),(94,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-26 20:15:53'),(95,1,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-26 20:16:02'),(96,4,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-26 20:16:18'),(97,1,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-26 20:16:34'),(98,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-26 20:18:07'),(99,1,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-26 20:18:21'),(100,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-28 15:04:31'),(101,1,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-28 15:17:25'),(102,1,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-28 15:29:45'),(103,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-29 15:29:09'),(104,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-29 15:34:25'),(105,1,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-29 15:34:36'),(106,1,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-29 15:35:00'),(107,1,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-29 15:59:12'),(108,4,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-29 16:33:14'),(109,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-29 16:33:27'),(110,3,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-29 16:44:25'),(111,8,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-29 16:44:46'),(112,9,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-29 16:46:43'),(113,8,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-29 16:47:24'),(114,1,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-29 18:51:55'),(115,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-30 03:31:33'),(116,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-30 06:29:58'),(117,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-30 06:38:58'),(118,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-30 06:39:12'),(119,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-30 06:54:14'),(120,1,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-30 07:03:52'),(121,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-30 07:04:31'),(122,8,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-30 15:50:39'),(123,1,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-30 16:21:29'),(124,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-30 16:23:54'),(125,1,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-30 17:15:37'),(126,6,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-30 17:16:11'),(127,8,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-05-30 17:18:44'),(128,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-01 19:17:59'),(129,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-06 01:09:42'),(130,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-06 01:10:36'),(131,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-06 01:10:44'),(132,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-16 17:06:57'),(133,4,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-16 17:07:48'),(134,3,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-16 17:07:57'),(135,8,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-16 17:08:12'),(136,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-16 17:11:42'),(137,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-17 14:45:21'),(138,5,'create','ผู้ใช้','สร้างบัญชีผู้ใช้ใหม่ (Username: 45172037)','172.18.0.1','2026-06-17 14:49:28'),(139,11,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-17 14:49:34'),(140,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-17 14:49:54'),(141,4,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-17 15:05:09'),(142,4,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-17 15:06:43'),(143,6,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-17 15:12:59'),(144,7,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-17 15:14:35'),(145,8,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-17 15:17:14'),(146,4,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-17 15:17:49'),(147,8,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-17 15:18:17'),(148,9,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-17 15:24:40'),(149,10,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-17 15:26:13'),(150,1,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-17 15:28:06'),(151,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-17 15:30:42'),(152,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-17 15:58:12'),(153,9,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-17 16:11:03'),(154,7,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-17 16:11:21'),(155,7,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-19 20:58:58'),(156,10,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-19 21:00:06'),(157,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-19 21:02:43'),(158,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-20 15:33:18'),(159,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-21 15:00:33'),(160,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-21 15:37:57'),(161,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-21 15:51:32'),(162,4,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-21 16:17:27'),(163,6,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-21 16:17:54'),(164,1,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-21 16:18:10'),(165,3,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-21 16:18:23'),(166,3,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-21 16:18:39'),(167,8,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-21 16:19:45'),(168,7,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-21 16:20:09'),(169,9,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-21 16:20:28'),(170,9,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-21 16:20:52'),(171,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-21 16:21:33'),(172,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-22 14:39:31'),(173,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-22 14:39:58'),(174,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-22 15:03:50'),(175,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-22 15:05:19'),(176,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-22 15:06:39'),(177,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-22 15:08:07'),(178,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-22 15:15:35'),(179,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-22 15:27:17'),(180,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-22 15:28:12'),(181,8,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-22 15:35:33'),(182,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-22 15:35:50'),(183,8,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-22 15:36:12'),(184,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-22 15:36:27'),(185,1,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-22 17:17:16'),(186,1,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-22 17:27:30'),(187,1,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-22 17:40:34'),(188,1,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-22 17:40:51'),(189,1,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-22 17:42:15'),(190,8,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-22 17:55:26'),(191,4,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-22 17:55:59'),(192,9,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-22 17:56:43'),(193,9,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-22 18:58:14'),(194,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-22 19:30:47'),(195,1,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-22 19:37:46'),(196,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-22 19:48:10'),(197,9,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-23 12:26:49'),(198,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-23 13:26:27'),(199,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-23 16:18:47'),(200,1,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-23 16:19:02'),(201,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-23 16:22:25'),(202,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-23 18:46:07'),(203,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-24 11:36:50'),(204,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-26 07:04:37'),(205,2,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-26 07:04:37'),(206,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-26 07:05:23'),(207,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-26 07:08:41'),(208,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-26 07:16:27'),(209,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-26 07:18:48'),(210,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-26 07:24:40'),(211,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-27 11:51:26'),(212,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-27 12:01:00'),(213,4,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-27 12:10:14'),(214,4,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-27 12:19:45'),(215,2,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-27 13:08:04'),(216,4,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-27 13:10:19'),(217,4,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-27 13:11:07'),(218,4,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-27 13:16:54'),(219,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-27 13:54:18'),(220,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-27 14:00:05'),(221,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-29 05:43:30'),(222,4,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-29 05:43:49'),(223,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-29 06:08:22'),(224,9,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-29 06:16:05'),(225,4,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-29 06:16:41'),(226,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-29 06:17:00'),(227,4,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-29 06:30:17'),(228,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-29 06:31:03'),(229,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-06-29 06:32:47'),(230,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-07-02 03:28:06'),(231,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-07-02 03:31:04'),(232,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-07-02 03:39:42'),(233,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-07-03 06:11:56'),(234,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-07-03 06:16:59'),(235,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-07-03 06:19:25'),(236,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-07-03 06:21:47'),(237,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-07-03 06:22:27'),(238,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-07-03 06:31:37'),(239,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-07-03 06:32:36'),(240,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-07-04 12:38:10'),(241,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-07-04 12:38:54'),(242,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-07-04 13:07:08'),(243,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-07-08 03:50:00'),(244,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-07-08 03:50:39'),(245,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-07-08 03:51:53'),(246,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-07-08 03:54:34'),(247,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-07-08 03:58:29'),(248,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-07-08 08:09:15'),(249,6,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-07-11 10:11:11'),(250,6,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-07-11 10:25:23'),(251,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-07-11 11:19:20'),(252,5,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-07-11 11:19:51'),(253,7,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-07-11 11:19:51'),(254,6,'login','ระบบ','เข้าสู่ระบบสำเร็จ','172.18.0.1','2026-07-11 11:32:49');
/*!40000 ALTER TABLE `audit_log` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `avisor_notifications`
--

DROP TABLE IF EXISTS `avisor_notifications`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `avisor_notifications` (
  `notification_id` bigint NOT NULL AUTO_INCREMENT,
  `user_id` bigint NOT NULL COMMENT 'ไอดีอาจารย์ผู้รับข้อความ',
  `type` enum('info','warning','request','success') DEFAULT 'info',
  `title` varchar(255) NOT NULL,
  `message` text NOT NULL,
  `student_id` varchar(50) DEFAULT NULL COMMENT 'รหัสนักศึกษาต้นเหตุ (ถ้ามี)',
  `is_read` tinyint(1) DEFAULT '0' COMMENT '0=ยังไม่อ่าน, 1=อ่านแล้ว',
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`notification_id`),
  KEY `fk_noti_user` (`user_id`),
  CONSTRAINT `fk_noti_user` FOREIGN KEY (`user_id`) REFERENCES `users` (`user_id`) ON DELETE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `avisor_notifications`
--

LOCK TABLES `avisor_notifications` WRITE;
/*!40000 ALTER TABLE `avisor_notifications` DISABLE KEYS */;
INSERT INTO `avisor_notifications` VALUES (1,5,'warning','นักศึกษาเสี่ยงผลการเรียนต่ำ','นักศึกษาในความดูแลมีผลการเรียนรายวิชาต่ำกว่าเกณฑ์ กรุณานัดหมายให้คำปรึกษา','6603400001',0,'2026-07-08 03:45:02'),(2,5,'request','คำขอนัดพบจากนักศึกษา','นักศึกษาส่งคำขอนัดพบเพื่อปรึกษาเรื่องการลงทะเบียนภาคเรียนหน้า','6603400002',0,'2026-07-08 03:45:02'),(3,5,'info','กำหนดส่งรายงานการให้คำปรึกษา','ครบกำหนดส่งสรุปรายงานการให้คำปรึกษาประจำภาคเรียนภายในสิ้นเดือนนี้',NULL,1,'2026-07-08 03:45:02');
/*!40000 ALTER TABLE `avisor_notifications` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `clo`
--

DROP TABLE IF EXISTS `clo`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `clo` (
  `clo_id` int NOT NULL AUTO_INCREMENT,
  `subject_id` int NOT NULL,
  `description` text,
  `ylo_id` varchar(30) DEFAULT NULL,
  `clo_code` varchar(30) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`clo_id`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `clo`
--

LOCK TABLES `clo` WRITE;
/*!40000 ALTER TABLE `clo` DISABLE KEYS */;
INSERT INTO `clo` VALUES (1,1,'อธิบายหลักไวยากรณ์และคำศัพท์ภาษาอังกฤษพื้นฐานได้','YLO1','CLO1','2026-07-03 06:33:34'),(2,1,'สื่อสารภาษาอังกฤษในสถานการณ์ทั่วไปได้','YLO1','CLO2','2026-07-03 06:33:34');
/*!40000 ALTER TABLE `clo` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `curriculum_framework`
--

DROP TABLE IF EXISTS `curriculum_framework`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `curriculum_framework` (
  `id` int NOT NULL,
  `curriculum_year` int DEFAULT NULL,
  `program_name` varchar(255) DEFAULT NULL,
  `mapping_json` text,
  `is_active` tinyint DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `curriculum_framework`
--

LOCK TABLES `curriculum_framework` WRITE;
/*!40000 ALTER TABLE `curriculum_framework` DISABLE KEYS */;
INSERT INTO `curriculum_framework` VALUES (1,2567,'หลักสูตรพยาบาลศาสตรบัณฑิต','{\"clos\": [{\"plo_mappings\": [{\"weight\": 1, \"sub_plo_id\": 5.2}], \"subject_code\": \"103-111\", \"subject_name\": \"ภาษาอังกฤษพื้นฐาน\"}, {\"plo_mappings\": [{\"weight\": 1, \"sub_plo_id\": 5.2}], \"subject_code\": \"103-112\", \"subject_name\": \"การสื่อสารภาษาอังกฤษในชีวิตประจำวัน\"}, {\"plo_mappings\": [{\"weight\": 1, \"sub_plo_id\": \"7.1\"}, {\"weight\": 1, \"sub_plo_id\": 7.2}], \"subject_code\": \"103-201\", \"subject_name\": \"ทักษะดิจิทัลสำหรับศตวรรษที่ 21\"}, {\"plo_mappings\": [{\"weight\": 1, \"sub_plo_id\": \"4.1\"}, {\"weight\": 1, \"sub_plo_id\": \"5.1\"}], \"subject_code\": \"103-202\", \"subject_name\": \"การวิเคราะห์ข้อมูลและการเรียนรู้ของเครื่องจักรเบื้องต้น\"}, {\"plo_mappings\": [{\"weight\": 1, \"sub_plo_id\": \"1.3\"}], \"subject_code\": \"103-301\", \"subject_name\": \"หลักปรัชญาของเศรษฐกิจพอเพียงเพื่อการพัฒนาที่ยั่งยืน\"}, {\"plo_mappings\": [{\"weight\": 1, \"sub_plo_id\": \"1.3\"}, {\"weight\": 1, \"sub_plo_id\": 7.2}, {\"weight\": 1, \"sub_plo_id\": \"8.1\"}, {\"weight\": 1, \"sub_plo_id\": 8.2}, {\"weight\": 1, \"sub_plo_id\": 8.3}], \"subject_code\": \"103-302\", \"subject_name\": \"การออกแบบการคิดเพื่อสร้างนวัตกรรมฯ\"}, {\"plo_mappings\": [], \"subject_code\": \"103-302\", \"subject_name\": \"การออกแบบการคิดเพื่อสร้างนวัตกรรมและธุรกิจใหม่\"}, {\"plo_mappings\": [{\"weight\": 1, \"sub_plo_id\": \"1.1\"}, {\"weight\": 1, \"sub_plo_id\": \"1.2\"}, {\"weight\": 1, \"sub_plo_id\": \"1.3\"}], \"subject_code\": \"170-108\", \"subject_name\": \"ชีวเคมี\"}, {\"plo_mappings\": [{\"weight\": 1, \"sub_plo_id\": \"1.1\"}, {\"weight\": 1, \"sub_plo_id\": \"1.3\"}, {\"weight\": 1, \"sub_plo_id\": \"5.1\"}, {\"weight\": 1, \"sub_plo_id\": 5.2}, {\"weight\": 1, \"sub_plo_id\": \"6.1\"}], \"subject_code\": \"170-112\", \"subject_name\": \"กายวิภาคศาสตร์และสรีรวิทยาฯ 1\"}, {\"plo_mappings\": [{\"weight\": 1, \"sub_plo_id\": \"1.1\"}, {\"weight\": 1, \"sub_plo_id\": \"1.3\"}, {\"weight\": 1, \"sub_plo_id\": \"5.1\"}, {\"weight\": 1, \"sub_plo_id\": 5.2}, {\"weight\": 1, \"sub_plo_id\": \"6.1\"}], \"subject_code\": \"170-113\", \"subject_name\": \"กายวิภาคศาสตร์และสรีรวิทยาฯ 2\"}, {\"plo_mappings\": [{\"weight\": 1, \"sub_plo_id\": \"1.1\"}, {\"weight\": 1, \"sub_plo_id\": \"1.2\"}, {\"weight\": 1, \"sub_plo_id\": \"1.3\"}, {\"weight\": 1, \"sub_plo_id\": 6.3}], \"subject_code\": \"170-201\", \"subject_name\": \"พยาธิสรีรวิทยาของมนุษย์\"}, {\"plo_mappings\": [{\"weight\": 1, \"sub_plo_id\": \"1.1\"}, {\"weight\": 1, \"sub_plo_id\": \"1.3\"}, {\"weight\": 1, \"sub_plo_id\": 6.3}], \"subject_code\": \"170-208\", \"subject_name\": \"จุลชีววิทยาและปรสิตวิทยาของมนุษย์\"}, {\"plo_mappings\": [{\"weight\": 1, \"sub_plo_id\": \"1.1\"}, {\"weight\": 1, \"sub_plo_id\": \"2.1\"}, {\"weight\": 1, \"sub_plo_id\": 6.3}, {\"weight\": 1, \"sub_plo_id\": 7.2}, {\"weight\": 1, \"sub_plo_id\": 8.2}], \"subject_code\": \"170-216\", \"subject_name\": \"เภสัชวิทยาทางการพยาบาล\"}, {\"plo_mappings\": [{\"weight\": 1, \"sub_plo_id\": \"1.3\"}], \"subject_code\": \"170-224\", \"subject_name\": \"ชีวสถิติทางสุขภาพ\"}, {\"plo_mappings\": [{\"weight\": 1, \"sub_plo_id\": \"2.1\"}, {\"weight\": 1, \"sub_plo_id\": \"6.1\"}, {\"weight\": 1, \"sub_plo_id\": \"7.1\"}, {\"weight\": 1, \"sub_plo_id\": \"8.1\"}, {\"weight\": 1, \"sub_plo_id\": 8.2}], \"subject_code\": \"170-228\", \"subject_name\": \"พัฒนาการมนุษย์และการสร้างเสริมสุขภาพ\"}, {\"plo_mappings\": [{\"weight\": 1, \"sub_plo_id\": \"1.1\"}, {\"weight\": 1, \"sub_plo_id\": \"1.2\"}, {\"weight\": 1, \"sub_plo_id\": 6.3}, {\"weight\": 1, \"sub_plo_id\": 7.2}, {\"weight\": 1, \"sub_plo_id\": 8.2}, {\"weight\": 1, \"sub_plo_id\": 8.3}], \"subject_code\": \"170-229\", \"subject_name\": \"โภชนบำบัด\"}, {\"plo_mappings\": [{\"weight\": 1, \"sub_plo_id\": \"1.1\"}, {\"weight\": 1, \"sub_plo_id\": \"4.1\"}, {\"weight\": 1, \"sub_plo_id\": \"7.1\"}, {\"weight\": 1, \"sub_plo_id\": 7.2}], \"subject_code\": \"170-211\", \"subject_name\": \"การพยาบาลพื้นฐาน 1\"}, {\"plo_mappings\": [{\"weight\": 1, \"sub_plo_id\": \"1.1\"}, {\"weight\": 1, \"sub_plo_id\": \"4.1\"}, {\"weight\": 1, \"sub_plo_id\": \"7.1\"}, {\"weight\": 1, \"sub_plo_id\": 7.2}], \"subject_code\": \"170-212\", \"subject_name\": \"การพยาบาลพื้นฐาน 2\"}, {\"plo_mappings\": [{\"weight\": 1, \"sub_plo_id\": \"1.3\"}, {\"weight\": 1, \"sub_plo_id\": 2.2}, {\"weight\": 1, \"sub_plo_id\": 5.2}], \"subject_code\": \"170-222\", \"subject_name\": \"จรรยาบรรณวิชาชีพการพยาบาลและกฎหมายที่เกี่ยวข้อง\"}, {\"plo_mappings\": [{\"weight\": 1, \"sub_plo_id\": \"1.1\"}, {\"weight\": 1, \"sub_plo_id\": \"1.3\"}, {\"weight\": 1, \"sub_plo_id\": 6.3}, {\"weight\": 1, \"sub_plo_id\": \"7.1\"}, {\"weight\": 1, \"sub_plo_id\": 7.2}], \"subject_code\": \"170-226\", \"subject_name\": \"การพยาบาลผู้ใหญ่\"}, {\"plo_mappings\": [{\"weight\": 1, \"sub_plo_id\": \"1.1\"}, {\"weight\": 1, \"sub_plo_id\": 5.2}, {\"weight\": 1, \"sub_plo_id\": 6.2}, {\"weight\": 1, \"sub_plo_id\": 8.2}, {\"weight\": 1, \"sub_plo_id\": 8.3}], \"subject_code\": \"170-227\", \"subject_name\": \"มโนมติ ทฤษฎีฯ และบริการด้วยหัวใจ\"}, {\"plo_mappings\": [{\"weight\": 1, \"sub_plo_id\": \"1.1\"}, {\"weight\": 1, \"sub_plo_id\": \"1.3\"}, {\"weight\": 1, \"sub_plo_id\": \"7.1\"}], \"subject_code\": \"170-230\", \"subject_name\": \"กระบวนการพยาบาลและการประเมินภาวะสุขภาพ\"}, {\"plo_mappings\": [{\"weight\": 1, \"sub_plo_id\": \"1.3\"}, {\"weight\": 1, \"sub_plo_id\": 3.2}, {\"weight\": 1, \"sub_plo_id\": \"4.1\"}, {\"weight\": 1, \"sub_plo_id\": \"7.1\"}], \"subject_code\": \"170-231\", \"subject_name\": \"การประยุกต์ใช้ AI และเทคโนโลยีดิจิทัล\"}, {\"plo_mappings\": [{\"weight\": 1, \"sub_plo_id\": \"1.1\"}, {\"weight\": 1, \"sub_plo_id\": \"1.3\"}, {\"weight\": 1, \"sub_plo_id\": 6.3}, {\"weight\": 1, \"sub_plo_id\": \"7.1\"}, {\"weight\": 1, \"sub_plo_id\": 7.2}, {\"weight\": 1, \"sub_plo_id\": \"8.1\"}, {\"weight\": 1, \"sub_plo_id\": 8.2}], \"subject_code\": \"170-324\", \"subject_name\": \"การพยาบาลผู้สูงอายุ\"}, {\"plo_mappings\": [{\"weight\": 1, \"sub_plo_id\": \"1.1\"}, {\"weight\": 1, \"sub_plo_id\": \"1.3\"}, {\"weight\": 1, \"sub_plo_id\": \"3.1\"}, {\"weight\": 1, \"sub_plo_id\": 6.3}, {\"weight\": 1, \"sub_plo_id\": 7.2}, {\"weight\": 1, \"sub_plo_id\": 8.2}], \"subject_code\": \"170-348\", \"subject_name\": \"การพยาบาลเด็กและวัยรุ่น\"}, {\"plo_mappings\": [{\"weight\": 1, \"sub_plo_id\": \"1.1\"}, {\"weight\": 1, \"sub_plo_id\": \"1.2\"}, {\"weight\": 1, \"sub_plo_id\": \"1.3\"}, {\"weight\": 1, \"sub_plo_id\": 2.2}, {\"weight\": 1, \"sub_plo_id\": \"3.1\"}, {\"weight\": 1, \"sub_plo_id\": \"7.1\"}, {\"weight\": 1, \"sub_plo_id\": 8.2}], \"subject_code\": \"170-349\", \"subject_name\": \"การพยาบาลวิกฤตและฉุกเฉิน\"}, {\"plo_mappings\": [{\"weight\": 1, \"sub_plo_id\": \"1.1\"}, {\"weight\": 1, \"sub_plo_id\": \"1.3\"}, {\"weight\": 1, \"sub_plo_id\": 2.2}, {\"weight\": 1, \"sub_plo_id\": \"4.1\"}, {\"weight\": 1, \"sub_plo_id\": 6.3}, {\"weight\": 1, \"sub_plo_id\": \"7.1\"}, {\"weight\": 1, \"sub_plo_id\": 7.2}, {\"weight\": 1, \"sub_plo_id\": \"8.1\"}, {\"weight\": 1, \"sub_plo_id\": 8.2}], \"subject_code\": \"170-350\", \"subject_name\": \"การพยาบาลสุขภาพจิตและจิตเวชศาสตร์\"}, {\"plo_mappings\": [{\"weight\": 1, \"sub_plo_id\": \"1.1\"}, {\"weight\": 1, \"sub_plo_id\": \"1.3\"}, {\"weight\": 1, \"sub_plo_id\": 2.2}, {\"weight\": 1, \"sub_plo_id\": \"4.1\"}, {\"weight\": 1, \"sub_plo_id\": 6.3}, {\"weight\": 1, \"sub_plo_id\": \"7.1\"}, {\"weight\": 1, \"sub_plo_id\": 7.2}, {\"weight\": 1, \"sub_plo_id\": \"8.1\"}, {\"weight\": 1, \"sub_plo_id\": 8.2}], \"subject_code\": \"170-351\", \"subject_name\": \"การพยาบาลมารดาและทารก\"}, {\"plo_mappings\": [{\"weight\": 1, \"sub_plo_id\": \"1.1\"}, {\"weight\": 1, \"sub_plo_id\": \"1.3\"}, {\"weight\": 1, \"sub_plo_id\": 2.2}, {\"weight\": 1, \"sub_plo_id\": \"4.1\"}, {\"weight\": 1, \"sub_plo_id\": 6.3}, {\"weight\": 1, \"sub_plo_id\": \"7.1\"}, {\"weight\": 1, \"sub_plo_id\": 7.2}, {\"weight\": 1, \"sub_plo_id\": \"8.1\"}, {\"weight\": 1, \"sub_plo_id\": 8.2}], \"subject_code\": \"170-352\", \"subject_name\": \"การผดุงครรภ์\"}, {\"plo_mappings\": [{\"weight\": 1, \"sub_plo_id\": \"1.1\"}, {\"weight\": 1, \"sub_plo_id\": \"1.3\"}, {\"weight\": 1, \"sub_plo_id\": 2.2}, {\"weight\": 1, \"sub_plo_id\": \"4.1\"}, {\"weight\": 1, \"sub_plo_id\": 6.3}, {\"weight\": 1, \"sub_plo_id\": \"7.1\"}, {\"weight\": 1, \"sub_plo_id\": 7.2}, {\"weight\": 1, \"sub_plo_id\": \"8.1\"}, {\"weight\": 1, \"sub_plo_id\": 8.2}], \"subject_code\": \"170-353\", \"subject_name\": \"การพยาบาลอนามัยชุมชน\"}, {\"plo_mappings\": [{\"weight\": 1, \"sub_plo_id\": \"1.3\"}, {\"weight\": 1, \"sub_plo_id\": \"3.1\"}, {\"weight\": 1, \"sub_plo_id\": 3.2}, {\"weight\": 1, \"sub_plo_id\": 6.2}], \"subject_code\": \"170-354\", \"subject_name\": \"กระบวนการวิจัยทางวิชาชีพ\"}, {\"plo_mappings\": [{\"weight\": 1, \"sub_plo_id\": \"1.1\"}, {\"weight\": 1, \"sub_plo_id\": \"1.3\"}, {\"weight\": 1, \"sub_plo_id\": \"5.1\"}, {\"weight\": 1, \"sub_plo_id\": \"7.1\"}, {\"weight\": 1, \"sub_plo_id\": 7.2}, {\"weight\": 1, \"sub_plo_id\": \"8.1\"}], \"subject_code\": \"170-448\", \"subject_name\": \"การรักษาพยาบาลเบื้องต้น\"}, {\"plo_mappings\": [{\"weight\": 1, \"sub_plo_id\": \"1.1\"}, {\"weight\": 1, \"sub_plo_id\": \"1.3\"}, {\"weight\": 1, \"sub_plo_id\": \"3.1\"}, {\"weight\": 1, \"sub_plo_id\": 3.2}, {\"weight\": 1, \"sub_plo_id\": \"4.1\"}, {\"weight\": 1, \"sub_plo_id\": \"5.1\"}, {\"weight\": 1, \"sub_plo_id\": 5.2}, {\"weight\": 1, \"sub_plo_id\": \"7.1\"}, {\"weight\": 1, \"sub_plo_id\": \"8.1\"}, {\"weight\": 1, \"sub_plo_id\": 8.3}], \"subject_code\": \"170-457\", \"subject_name\": \"ภาวะผู้นำและการบริหารทางการพยาบาล\"}, {\"plo_mappings\": [{\"weight\": 1, \"sub_plo_id\": \"2.1\"}, {\"weight\": 1, \"sub_plo_id\": 2.3}, {\"weight\": 1, \"sub_plo_id\": 3.2}, {\"weight\": 1, \"sub_plo_id\": 6.2}, {\"weight\": 1, \"sub_plo_id\": \"7.1\"}], \"subject_code\": \"170-232\", \"subject_name\": \"ปฏิบัติการพยาบาลพื้นฐาน\"}, {\"plo_mappings\": [{\"weight\": 1, \"sub_plo_id\": \"1.1\"}, {\"weight\": 1, \"sub_plo_id\": \"1.3\"}, {\"weight\": 1, \"sub_plo_id\": \"2.1\"}, {\"weight\": 1, \"sub_plo_id\": 2.2}, {\"weight\": 1, \"sub_plo_id\": 2.3}, {\"weight\": 1, \"sub_plo_id\": \"5.1\"}, {\"weight\": 1, \"sub_plo_id\": 5.2}], \"subject_code\": \"170-327\", \"subject_name\": \"ปฏิบัติการสุขภาพจิตและจิตเวชศาสตร์\"}, {\"plo_mappings\": [{\"weight\": 1, \"sub_plo_id\": \"1.1\"}, {\"weight\": 1, \"sub_plo_id\": \"1.3\"}, {\"weight\": 1, \"sub_plo_id\": \"2.1\"}, {\"weight\": 1, \"sub_plo_id\": 2.2}, {\"weight\": 1, \"sub_plo_id\": 2.3}, {\"weight\": 1, \"sub_plo_id\": 3.2}, {\"weight\": 1, \"sub_plo_id\": 7.2}, {\"weight\": 1, \"sub_plo_id\": 8.3}], \"subject_code\": \"170-331\", \"subject_name\": \"ปฏิบัติการพยาบาลเด็กและวัยรุ่น\"}, {\"plo_mappings\": [{\"weight\": 1, \"sub_plo_id\": \"1.1\"}, {\"weight\": 1, \"sub_plo_id\": \"1.3\"}, {\"weight\": 1, \"sub_plo_id\": \"2.1\"}, {\"weight\": 1, \"sub_plo_id\": 2.3}, {\"weight\": 1, \"sub_plo_id\": \"6.1\"}, {\"weight\": 1, \"sub_plo_id\": 6.2}, {\"weight\": 1, \"sub_plo_id\": 6.3}, {\"weight\": 1, \"sub_plo_id\": 8.2}], \"subject_code\": \"170-337\", \"subject_name\": \"ปฏิบัติการพยาบาลมารดาและทารก\"}, {\"plo_mappings\": [{\"weight\": 1, \"sub_plo_id\": \"1.1\"}, {\"weight\": 1, \"sub_plo_id\": \"1.3\"}, {\"weight\": 1, \"sub_plo_id\": \"2.1\"}, {\"weight\": 1, \"sub_plo_id\": 2.3}, {\"weight\": 1, \"sub_plo_id\": \"6.1\"}, {\"weight\": 1, \"sub_plo_id\": 6.2}, {\"weight\": 1, \"sub_plo_id\": 6.3}, {\"weight\": 1, \"sub_plo_id\": 8.2}], \"subject_code\": \"170-338\", \"subject_name\": \"ปฏิบัติการผดุงครรภ์ 1\"}, {\"plo_mappings\": [{\"weight\": 1, \"sub_plo_id\": \"1.1\"}, {\"weight\": 1, \"sub_plo_id\": \"1.3\"}, {\"weight\": 1, \"sub_plo_id\": \"2.1\"}, {\"weight\": 1, \"sub_plo_id\": 2.2}, {\"weight\": 1, \"sub_plo_id\": 2.3}, {\"weight\": 1, \"sub_plo_id\": 3.2}, {\"weight\": 1, \"sub_plo_id\": 7.2}, {\"weight\": 1, \"sub_plo_id\": 8.3}], \"subject_code\": \"170-339\", \"subject_name\": \"ปฏิบัติการพยาบาลผู้ใหญ่และผู้สูงอายุ\"}, {\"plo_mappings\": [{\"weight\": 1, \"sub_plo_id\": \"1.1\"}, {\"weight\": 1, \"sub_plo_id\": \"1.2\"}, {\"weight\": 1, \"sub_plo_id\": \"1.3\"}, {\"weight\": 1, \"sub_plo_id\": \"2.1\"}, {\"weight\": 1, \"sub_plo_id\": 2.2}, {\"weight\": 1, \"sub_plo_id\": 2.3}, {\"weight\": 1, \"sub_plo_id\": \"6.1\"}, {\"weight\": 1, \"sub_plo_id\": 6.2}, {\"weight\": 1, \"sub_plo_id\": 6.3}, {\"weight\": 1, \"sub_plo_id\": 8.2}], \"subject_code\": \"170-340\", \"subject_name\": \"ปฏิบัติการพยาบาลผู้ป่วยวิกฤตและฉุกเฉิน\"}, {\"plo_mappings\": [{\"weight\": 1, \"sub_plo_id\": \"1.1\"}, {\"weight\": 1, \"sub_plo_id\": \"1.3\"}, {\"weight\": 1, \"sub_plo_id\": \"2.1\"}, {\"weight\": 1, \"sub_plo_id\": 2.3}, {\"weight\": 1, \"sub_plo_id\": \"6.1\"}, {\"weight\": 1, \"sub_plo_id\": 6.2}, {\"weight\": 1, \"sub_plo_id\": 6.3}, {\"weight\": 1, \"sub_plo_id\": 8.2}], \"subject_code\": \"170-355\", \"subject_name\": \"ปฏิบัติการพยาบาลอนามัยชุมชน\"}, {\"plo_mappings\": [{\"weight\": 1, \"sub_plo_id\": \"1.1\"}, {\"weight\": 1, \"sub_plo_id\": \"1.3\"}, {\"weight\": 1, \"sub_plo_id\": \"2.1\"}, {\"weight\": 1, \"sub_plo_id\": 2.3}, {\"weight\": 1, \"sub_plo_id\": \"5.1\"}, {\"weight\": 1, \"sub_plo_id\": 5.2}], \"subject_code\": \"170-431\", \"subject_name\": \"ปฏิบัติการผดุงครรภ์ 2\"}, {\"plo_mappings\": [{\"weight\": 1, \"sub_plo_id\": \"1.1\"}, {\"weight\": 1, \"sub_plo_id\": \"1.3\"}, {\"weight\": 1, \"sub_plo_id\": \"6.1\"}, {\"weight\": 1, \"sub_plo_id\": 6.2}, {\"weight\": 1, \"sub_plo_id\": 6.3}, {\"weight\": 1, \"sub_plo_id\": 8.2}], \"subject_code\": \"170-449\", \"subject_name\": \"ปฏิบัติการรักษาพยาบาลเบื้องต้น\"}, {\"plo_mappings\": [{\"weight\": 1, \"sub_plo_id\": \"1.1\"}, {\"weight\": 1, \"sub_plo_id\": \"1.2\"}, {\"weight\": 1, \"sub_plo_id\": \"1.3\"}, {\"weight\": 1, \"sub_plo_id\": \"4.1\"}, {\"weight\": 1, \"sub_plo_id\": \"5.1\"}, {\"weight\": 1, \"sub_plo_id\": 5.2}, {\"weight\": 1, \"sub_plo_id\": \"6.1\"}, {\"weight\": 1, \"sub_plo_id\": 6.2}, {\"weight\": 1, \"sub_plo_id\": 6.3}, {\"weight\": 1, \"sub_plo_id\": \"8.1\"}, {\"weight\": 1, \"sub_plo_id\": 8.2}, {\"weight\": 1, \"sub_plo_id\": 8.3}], \"subject_code\": \"170-458\", \"subject_name\": \"ปฏิบัติการจัดการพยาบาล\"}, {\"plo_mappings\": [{\"weight\": 1, \"sub_plo_id\": \"1.1\"}, {\"weight\": 1, \"sub_plo_id\": \"1.2\"}, {\"weight\": 1, \"sub_plo_id\": \"1.3\"}, {\"weight\": 1, \"sub_plo_id\": \"4.1\"}, {\"weight\": 1, \"sub_plo_id\": \"5.1\"}, {\"weight\": 1, \"sub_plo_id\": 5.2}, {\"weight\": 1, \"sub_plo_id\": \"6.1\"}, {\"weight\": 1, \"sub_plo_id\": 6.2}, {\"weight\": 1, \"sub_plo_id\": 6.3}, {\"weight\": 1, \"sub_plo_id\": \"8.1\"}, {\"weight\": 1, \"sub_plo_id\": 8.2}, {\"weight\": 1, \"sub_plo_id\": 8.3}], \"subject_code\": \"170-459\", \"subject_name\": \"ปฏิบัติการพยาบาลรวบยอดวิกฤตและฉุกเฉิน\"}, {\"plo_mappings\": [{\"weight\": 1, \"sub_plo_id\": \"1.3\"}, {\"weight\": 1, \"sub_plo_id\": \"7.1\"}, {\"weight\": 1, \"sub_plo_id\": 7.2}], \"subject_code\": \"170-116\", \"subject_name\": \"การดูแลสุขภาพแบบผสมผสาน\"}, {\"plo_mappings\": [{\"weight\": 1, \"sub_plo_id\": \"1.3\"}, {\"weight\": 1, \"sub_plo_id\": \"6.1\"}, {\"weight\": 1, \"sub_plo_id\": \"7.1\"}, {\"weight\": 1, \"sub_plo_id\": 7.2}, {\"weight\": 1, \"sub_plo_id\": \"8.1\"}], \"subject_code\": \"170-117\", \"subject_name\": \"การดูแลสุขภาพความงามแบบองค์รวม\"}, {\"plo_mappings\": [{\"weight\": 1, \"sub_plo_id\": \"1.1\"}, {\"weight\": 1, \"sub_plo_id\": \"1.3\"}, {\"weight\": 1, \"sub_plo_id\": 6.3}, {\"weight\": 1, \"sub_plo_id\": \"7.1\"}, {\"weight\": 1, \"sub_plo_id\": 7.2}, {\"weight\": 1, \"sub_plo_id\": \"8.1\"}, {\"weight\": 1, \"sub_plo_id\": 8.2}], \"subject_code\": \"170-233\", \"subject_name\": \"การดูแลสุขภาวะผู้สูงอายุกลุ่มเปราะบาง\"}, {\"plo_mappings\": [{\"weight\": 1, \"sub_plo_id\": \"1.3\"}, {\"weight\": 1, \"sub_plo_id\": 6.3}, {\"weight\": 1, \"sub_plo_id\": 7.2}, {\"weight\": 1, \"sub_plo_id\": \"8.1\"}, {\"weight\": 1, \"sub_plo_id\": 8.2}], \"subject_code\": \"170-234\", \"subject_name\": \"นันทนาการเพื่อส่งเสริมพัฒนาการเด็กฯ\"}, {\"plo_mappings\": [{\"weight\": 1, \"sub_plo_id\": \"1.1\"}, {\"weight\": 1, \"sub_plo_id\": \"1.3\"}, {\"weight\": 1, \"sub_plo_id\": \"3.1\"}, {\"weight\": 1, \"sub_plo_id\": 3.2}, {\"weight\": 1, \"sub_plo_id\": \"4.1\"}], \"subject_code\": \"170-346\", \"subject_name\": \"นวัตกรรมทางสุขภาพ\"}, {\"plo_mappings\": [{\"weight\": 1, \"sub_plo_id\": \"1.1\"}, {\"weight\": 1, \"sub_plo_id\": 2.2}, {\"weight\": 1, \"sub_plo_id\": \"3.1\"}], \"subject_code\": \"170-347\", \"subject_name\": \"การปฐมพยาบาลและการช่วยฟื้นคืนชีพ\"}], \"plos\": [{\"plo_id\": \"PLO1\", \"plo_name\": \"PLO 1: ประยุกต์ความรู้และสาระสำคัญของศาสตร์ทางวิชาชีพการพยาบาลและการผดุงครรภ์ และศาสตร์ที่เกี่ยวข้องในการดูแลบุคคลที่สุขภาพดี เจ็บป่วย และวิกฤต แบบองค์รวมทุกช่วงวัย\", \"sub_plos\": [{\"id\": \"1.1\", \"desc\": \"มีความรู้ความเข้าใจศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแลบุคคลที่สุขภาพดี การดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย\"}, {\"id\": \"1.2\", \"desc\": \"มีความรู้ความเข้าใจในสาระสำคัญของศาสตร์ทางการพยาบาลและการผดุงครรภ์ในการดูแลผู้สูงอายุและผู้ป่วยวิกฤต\"}, {\"id\": \"1.3\", \"desc\": \"ประยุกต์ศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ผู้สูงอายุและผู้ป่วยวิกฤต\"}], \"ylo_descriptions\": {\"year_1\": \"ใช้ความรู้ศาสตร์ที่เกี่ยวข้องพัฒนาการมนุษย์ทุกช่วงวัย\", \"year_2\": \"พื้นฐานทางวิชาชีพ ทางเลือกในการดูแลสุขภาพ, ใช้ศาสตร์พื้นฐานทางวิชาชีพในการดูแลสุขภาพ \", \"year_3\": \"ใช้ศาสตร์ทางการพยาบาลและการผดุงครรภ์ในการดูแลผู้ป่วยทั่วไป\", \"year_4\": \"ใช้ศาสตร์ทางการพยาบาลและการผดุงครรภ์ในการดูแลผู้ป่วยวิกฤตและบูรณาการศาสตร์ทางการพยาบาลทุกระดับ\"}}, {\"plo_id\": \"PLO2\", \"plo_name\": \"PLO 2: ปฏิบัติการพยาบาลและการผดุงครรภ์อย่างเป็นองค์รวมในการดูแลบุคคลที่สุขภาพดี เจ็บป่วย และวิกฤต แบบองค์รวมทุกช่วงวัยเพื่อความปลอดภัยของผู้รับบริการ\", \"sub_plos\": [{\"id\": \"2.1\", \"desc\": \"ปฏิบัติการพยาบาลและการผดุงครรภ์อย่างเป็นองค์รวมในการดูแลบุคคลที่สุขภาพดี เจ็บป่วย และวิกฤต แบบองค์รวมทุกช่วงวัย\"}, {\"id\": \"2.2\", \"desc\": \"จัดการปัญหาและข้อขัดแย้งทางการพยาบาลได้อย่างเหมาะสม\"}, {\"id\": \"2.3\", \"desc\": \"ประสานงานกับทีมสหสาขาวิชาชีพในการดูแลบุคคลที่สุขภาพดี เจ็บป่วย และวิกฤต แบบองค์รวมทุกช่วงวัยได้\"}], \"ylo_descriptions\": {\"year_1\": \"ไม่มี\", \"year_2\": \"ปฏิบัติการพยาบาลพื้นฐานในการดูแลผู้ป่วยทั่วไปโดยใช้กระบวนการพยาบาลภายใต้กฎหมายและจรรยาบรรณวิชาชีพ\", \"year_3\": \"ปฏิบัติการพยาบาลและการผดุงครรภ์แบบองค์รวมในการดูแลผู้ป่วยทั่วไปและผู้ป่วยซับซ้อนโดยใช้กระบวนการพยาบาล\", \"year_4\": \"ปฏิบัติการพยาบาลและการผดุงครรภ์แบบองค์รวมในการดูแลผู้ป่วยทั่วไปและผู้ป่วยวิกฤตโดยใช้กระบวนการพยาบาล\"}}, {\"plo_id\": \"PLO3\", \"plo_name\": \"PLO 3: พัฒนานวัตกรรมทางสุขภาพโดยประยุกต์กระบวนการวิจัยและเทคโนโลยีสารสนเทศทางการพยาบาลได้อย่างเหมาะสม\", \"sub_plos\": [{\"id\": \"3.1\", \"desc\": \"นำกระบวนการวิจัยมาใช้ในการพัฒนานวัตกรรมทางสุขภาพได้\"}, {\"id\": \"3.2\", \"desc\": \"ใช้เทคโนโลยีสารสนเทศทางการพยาบาลได้อย่างเหมาะสม\"}], \"ylo_descriptions\": {\"year_1\": \"มีความรู้พื้นฐานทางเทคโนโลยีและสารสนเทศ\", \"year_2\": \"มีความรู้ในการสร้างนวัตกรรมเบื้องต้น\", \"year_3\": \"สามารถสืบค้นข้อมูล วิเคราะห์แหล่งข้อมูลที่น่าเชื่อถือ และออกแบบการสร้างนวัตกรรมทางสุขภาพในแต่ละสาขาวิชา\", \"year_4\": \"บูรณาการการวิจัยและนวัตกรรมและส่งผลงานเข้าร่วมนำเสนอ\"}}, {\"plo_id\": \"PLO4\", \"plo_name\": \"PLO 4: ประยุกต์ใช้ดิจิทัลในการจัดการพยาบาลได้อย่างเหมาะสม\", \"sub_plos\": [{\"id\": \"4.1\", \"desc\": \"สามารถใช้ระบบดิจิทัลทางการพยาบาลเพื่อการติดต่อประสานงานและการให้บริการผู้ป่วยได้อย่างถูกต้อง\"}], \"ylo_descriptions\": {\"year_1\": \"ไม่มี\", \"year_2\": \"มีความรู้พื้นฐานดิจิทัล\", \"year_3\": \"มีความรู้ด้านดิจิทัลทางการพยาบาล\", \"year_4\": \"ประยุกต์ดิจิทัลทางการพยาบาลมาใช้ในการดูแลผู้ป่วย\"}}, {\"plo_id\": \"PLO5\", \"plo_name\": \"PLO 5: สื่อสารด้วยภาษาไทยและภาษาอังกฤษได้อย่างมีประสิทธิภาพ\", \"sub_plos\": [{\"id\": \"5.1\", \"desc\": \"ใช้ภาษาไทยในการสื่อสาร การบันทึกรายงานทางการพยาบาล การประสานงานกับทีมสุขภาพและผู้รับบริการได้อย่างมีประสิทธิภาพ\"}, {\"id\": \"5.2\", \"desc\": \"ใช้ภาษาอังกฤษในการสื่อสารกับทีมสุขภาพและผู้รับบริการได้\"}], \"ylo_descriptions\": {\"year_1\": \"สามารถสื่อสารภาษาไทยภาษาอังกฤษได้\", \"year_2\": \"-ใช้ภาษาไทยในการสื่อสารทางวิชาการ บันทึกทางการพยาบาล -เข้าใจศัพท์พื้นฐานทางการแพทย์\", \"year_3\": \"-ใช้ภาษาไทยในการสื่อสารทางวิชาการ บันทึกทางการพยาบาล การรับส่งข้อมูลกับทีมสุขภาพ  และหน่วยงานที่เกี่ยวข้อง -สามารถใช้ศัพท์ทางการแพทย์ในการสื่อสาร รับส่งข้อมูลและบันทึกทางการพยาบาล\", \"year_4\": \"ใช้ภาษาไทยในการสื่อสารทางวิชาการ บันทึกทางการพยาบาล การรับส่งข้อมูลกับทีมสุขภาพ และหน่วยงานที่เกี่ยวข้อง สามารถใช้ศัพท์ทางการแพทย์ในการสื่อสาร รับส่งข้อมูลและบันทึกทางการพยาบาล\"}}, {\"plo_id\": \"PLO6\", \"plo_name\": \"PLO 6: แสดงออกถึงการมีจริยธรรมและทัศนคติที่ดีต่อวิชาชีพ มีจิตสาธารณะ และมีพฤติกรรมบริการที่เป็นที่ยอมรับ\", \"sub_plos\": [{\"id\": \"6.1\", \"desc\": \"แสดงออกถึงการมีบุคลิกภาพและการวางตัวได้อย่างเหมาะสมในความเป็นวิชาชีพ\"}, {\"id\": \"6.2\", \"desc\": \"ปฏิบัติงานด้วยความซื่อสัตย์ เสียสละ ตรงต่อเวลา มีความรับผิดชอบ มีความรัก และศรัทธาในวิชาชีพ\"}, {\"id\": \"6.3\", \"desc\": \"สามารถปรับตัวเข้ากับสถานการณ์ที่หลากหลาย\"}], \"ylo_descriptions\": {\"year_1\": \"-มีจิตสาธารณะบำเพ็ญประโยชน์เพื่อสังคม -สามารถปรับตัวเข้ากับสังคมและสิ่งแวดล้อมใหม่\", \"year_2\": \"-มีบุคลิกภาพและการวางตัวได้อย่างเหมาะสม -ปฏิบัติงานด้วยตรงต่อเวลา มีความรับผิดชอบ -สามารถปรับตัวเข้าสู่วิชาชีพได้\", \"year_3\": \"-มีบุคลิกภาพและการวางตัวได้อย่างเหมาะสมในความเป็นวิชาชีพ -ปฏิบัติงานด้วยความซื่อสัตย์ เสียสละ ตรงต่อเวลา มีความรับผิดชอบ มีความรักและศรัทธาในวิชาชีพ -สามารถปรับตัวเข้ากับสถานการณ์ที่หลากหลาย\", \"year_4\": \"-มีบุคลิกภาพและการวางตัวได้อย่างเหมาะสมในความเป็นวิชาชีพ -ปฏิบัติงานด้วยความซื่อสัตย์ เสียสละ ตรงต่อเวลา มีความรับผิดชอบ และมีความรักและศรัทธาในวิชาชีพ -สามารถปรับตัวเข้ากับสถานการณ์ที่ซับซ้อน -มีพฤติกรรมบริการเป็น-ที่ยอมรับของผู้รับ\"}}, {\"plo_id\": \"PLO7\", \"plo_name\": \"PLO 7: แสดงออกถึงการเรียนรู้ด้วยตนเองอย่างต่อเนื่อง\", \"sub_plos\": [{\"id\": \"7.1\", \"desc\": \"แสดงออกถึงการแสวงหาความรู้เพิ่มเติมอย่างต่อเนื่อง\"}, {\"id\": \"7.2\", \"desc\": \"สามารถสืบค้นและวิเคราะห์ความน่าเชื่อถือของข้อมูลได้อย่างเหมาะสม\"}], \"ylo_descriptions\": {\"year_1\": \"สามารถศึกษาค้นคว้าข้อมูลจากแหล่งข้อมูลต่าง ๆ\", \"year_2\": \"สามารถศึกษาค้นคว้าข้อมูลทางการพยาบาลจากแหล่งข้อมูลต่าง ๆ และวิเคราะห์ข้อมูลเบื้องต้น\", \"year_3\": \"สามารถนำข้อมูลทางการพยาบาลมาวางแผนการพยาบาล\", \"year_4\": \"สามารถเลือกและประยุกต์องค์ความรู้ทางการพยาบาลมาใช้วางแผนการพยาบาลตามสถานการณ์ที่หลากหลาย\"}}, {\"plo_id\": \"PLO8\", \"plo_name\": \"PLO 8: เข้าใจหลักการ การดำเนินการ การเป็นผู้ประกอบการที่เกี่ยวกับการพยาบาลและการผดุงครรภ์ได้\", \"sub_plos\": [{\"id\": \"8.1\", \"desc\": \"ประเมินความต้องการบริการสุขภาพสอดคล้องกับสถานการณ์ปัจจุบัน\"}, {\"id\": \"8.2\", \"desc\": \"ออกแบบบริการการพยาบาลและการผดุงครรภ์ได้\"}, {\"id\": \"8.3\", \"desc\": \"สามารถจัดการในการเป็นผู้ประกอบการด้านการดูแลสุขภาพได้\"}], \"ylo_descriptions\": {\"year_1\": \"-\", \"year_2\": \"-\", \"year_3\": \"ประเมินความต้องการบริการสุขภาพของบุคคลและครอบครัวได้\", \"year_4\": \"-ประเมินความต้องการบริการสุขภาพของบุคคล ครอบครัว และชุมชนได้ -ออกแบบบริการการพยาบาลและการผดุงครรภ์ในการเป็นผู้ประกอบการได้\"}}], \"course_clos\": {\"103-111\": [{\"id\": \"1\", \"plo\": \"PLO1\", \"code\": \"CLO1\", \"status\": \"active\", \"weight\": 40, \"description\": \"อธิบายหลักไวยากรณ์และคำศัพท์พื้นฐานได้\"}, {\"id\": \"2\", \"plo\": \"PLO2\", \"code\": \"CLO2\", \"status\": \"active\", \"weight\": 60, \"description\": \"สื่อสารภาษาอังกฤษในชีวิตประจำวันได้\"}]}, \"program_name\": \"หลักสูตรพยาบาลศาสตรบัณฑิต (ฉบับปรับปรุง)\", \"curriculum_year\": 2567, \"subject_mappings\": {\"qwe\": {\"documents\": []}, \"DICK1\": {\"documents\": []}, \"BUR111\": {\"documents\": []}, \"103-111\": {\"clos\": [{\"id\": \"CLO1\", \"code\": \"CLO1\", \"weight\": 40, \"description\": \"อธิบายหลักไวยากรณ์และคำศัพท์พื้นฐานได้\", \"mapped_plos\": [\"PLO1\", \"PLO2\"]}, {\"id\": \"CLO2\", \"code\": \"CLO2\", \"weight\": 60, \"description\": \"สื่อสารภาษาอังกฤษในชีวิตประจำวันได้\", \"mapped_plos\": [\"PLO3\"]}], \"documents\": [{\"id\": \"doc_seed_1\", \"name\": \"TQF 3 - 103-111 ภาษาอังกฤษพื้นฐาน\", \"size\": \"1.2 MB\", \"type\": \"TQF 3\", \"status\": \"approved\", \"uploadedAt\": \"2026-06-01\"}], \"course_plos\": [\"PLO1\", \"PLO2\", \"PLO3\"], \"instructor_id\": \"46172040\"}, \"103-112\": {\"clos\": [{\"id\": \"CLO1\", \"code\": \"CLO1\", \"weight\": 100, \"description\": \"ใช้ภาษาอังกฤษเพื่อการสื่อสารเชิงวิชาชีพได้\", \"mapped_plos\": [\"PLO2\"]}], \"course_plos\": [\"PLO2\"], \"instructor_id\": \"46172040\"}, \"103-113\": {\"clos\": [], \"course_plos\": [\"PLO7\"]}, \"103-114\": {\"clos\": [{\"id\": \"CLO1\", \"code\": \"CLO1\", \"weight\": 100, \"description\": \"นำเสนอผลงานเป็นภาษาอังกฤษได้อย่างมืออาชีพ\", \"mapped_plos\": [\"PLO4\"]}], \"course_plos\": [\"PLO4\"], \"instructor_id\": \"46172040\"}, \"103-121\": {\"clos\": [], \"course_plos\": []}, \"103-122\": {\"clos\": [], \"course_plos\": []}, \"103-123\": {\"clos\": [], \"course_plos\": []}, \"103-131\": {\"clos\": [], \"course_plos\": []}, \"103-141\": {\"clos\": [], \"course_plos\": []}, \"103-151\": {\"clos\": [], \"course_plos\": []}, \"103-201\": {\"clos\": [], \"course_plos\": []}, \"103-202\": {\"clos\": [], \"course_plos\": []}, \"103-203\": {\"clos\": [], \"course_plos\": []}, \"103-204\": {\"clos\": [], \"course_plos\": []}, \"103-205\": {\"clos\": [], \"course_plos\": []}, \"103-206\": {\"clos\": [], \"course_plos\": []}, \"103-207\": {\"clos\": [], \"course_plos\": []}, \"103-208\": {\"clos\": [], \"course_plos\": []}, \"103-209\": {\"clos\": [], \"course_plos\": []}, \"103-210\": {\"clos\": [], \"course_plos\": []}, \"103-211\": {\"clos\": [], \"course_plos\": []}, \"103-212\": {\"clos\": [], \"course_plos\": []}, \"103-301\": {\"clos\": [], \"course_plos\": []}, \"103-302\": {\"clos\": [], \"course_plos\": []}, \"170-108\": {\"clos\": [], \"course_plos\": []}, \"170-112\": {\"clos\": [], \"course_plos\": []}, \"170-113\": {\"clos\": [], \"course_plos\": []}, \"170-114\": {\"clos\": [], \"course_plos\": []}, \"170-115\": {\"clos\": [], \"course_plos\": []}, \"170-116\": {\"clos\": [], \"course_plos\": []}, \"170-117\": {\"clos\": [], \"course_plos\": []}, \"170-201\": {\"clos\": [], \"course_plos\": []}, \"170-208\": {\"clos\": [], \"course_plos\": []}, \"170-211\": {\"clos\": [], \"course_plos\": []}, \"170-212\": {\"clos\": [], \"course_plos\": []}, \"170-216\": {\"clos\": [], \"course_plos\": []}, \"170-222\": {\"clos\": [], \"course_plos\": []}, \"170-224\": {\"clos\": [], \"course_plos\": []}, \"170-226\": {\"clos\": [], \"course_plos\": []}, \"170-227\": {\"clos\": [], \"course_plos\": []}, \"170-228\": {\"clos\": [], \"course_plos\": []}, \"170-229\": {\"clos\": [], \"course_plos\": []}, \"170-230\": {\"clos\": [], \"course_plos\": []}, \"170-231\": {\"clos\": [], \"course_plos\": []}, \"170-232\": {\"clos\": [], \"course_plos\": []}, \"170-235\": {\"clos\": [], \"course_plos\": []}, \"170-236\": {\"clos\": [], \"course_plos\": []}, \"170-324\": {\"clos\": [], \"course_plos\": []}, \"170-327\": {\"clos\": [], \"course_plos\": []}, \"170-331\": {\"clos\": [], \"course_plos\": []}, \"170-337\": {\"clos\": [], \"course_plos\": []}, \"170-338\": {\"clos\": [], \"course_plos\": []}, \"170-339\": {\"clos\": [], \"course_plos\": []}, \"170-340\": {\"clos\": [], \"course_plos\": []}, \"170-348\": {\"clos\": [], \"course_plos\": []}, \"170-349\": {\"clos\": [], \"course_plos\": []}, \"170-350\": {\"clos\": [], \"course_plos\": []}, \"170-351\": {\"clos\": [], \"course_plos\": []}, \"170-352\": {\"clos\": [], \"course_plos\": []}, \"170-353\": {\"clos\": [], \"course_plos\": []}, \"170-354\": {\"clos\": [], \"course_plos\": []}, \"170-355\": {\"clos\": [], \"course_plos\": []}, \"170-356\": {\"clos\": [], \"course_plos\": []}, \"170-357\": {\"clos\": [], \"course_plos\": []}, \"170-431\": {\"clos\": [], \"course_plos\": []}, \"170-448\": {\"clos\": [], \"course_plos\": []}, \"170-449\": {\"clos\": [], \"course_plos\": []}, \"170-457\": {\"clos\": [], \"course_plos\": []}, \"170-458\": {\"clos\": [], \"course_plos\": []}, \"170-459\": {\"clos\": [], \"course_plos\": []}, \"170-460\": {\"clos\": [], \"course_plos\": []}, \"170-461\": {\"clos\": [], \"course_plos\": []}, \"170-462\": {\"clos\": [], \"course_plos\": []}, \"143536475\": {\"documents\": []}}}',1,'2026-02-09 13:44:39');
/*!40000 ALTER TABLE `curriculum_framework` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `curriculum_report_stats`
--

DROP TABLE IF EXISTS `curriculum_report_stats`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `curriculum_report_stats` (
  `stat_id` bigint NOT NULL AUTO_INCREMENT,
  `type` enum('PLO','YLO') NOT NULL COMMENT 'ประเภท (PLO หรือ YLO)',
  `code_name` varchar(50) NOT NULL COMMENT 'รหัส เช่น PLO1, YLO1',
  `description` text COMMENT 'คำอธิบาย',
  `target_score` decimal(5,2) NOT NULL DEFAULT '0.00' COMMENT 'เป้าหมาย (%)',
  `achieved_score` decimal(5,2) NOT NULL DEFAULT '0.00' COMMENT 'ผลลัพธ์ที่ทำได้ (%)',
  `updated_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`stat_id`),
  UNIQUE KEY `uq_type_code` (`type`,`code_name`)
) ENGINE=InnoDB AUTO_INCREMENT=10 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `curriculum_report_stats`
--

LOCK TABLES `curriculum_report_stats` WRITE;
/*!40000 ALTER TABLE `curriculum_report_stats` DISABLE KEYS */;
INSERT INTO `curriculum_report_stats` VALUES (1,'PLO','PLO1','ความรู้ทางวิชาชีพ',80.00,85.00,'2026-06-23 20:50:32'),(2,'PLO','PLO2','ทักษะการปฏิบัติ',75.00,72.00,'2026-06-23 20:50:32'),(3,'PLO','PLO3','คุณธรรมจริยธรรม',80.00,88.00,'2026-06-23 20:50:32'),(4,'PLO','PLO4','การสื่อสาร',70.00,75.00,'2026-06-23 20:50:32'),(5,'PLO','PLO5','การใช้เทคโนโลยี',75.00,70.00,'2026-06-23 20:50:32'),(6,'YLO','YLO1','เข้าใจแนวคิดพื้นฐาน',75.00,78.00,'2026-06-23 20:50:32'),(7,'YLO','YLO2','ประยุกต์ใช้ในการฝึกงาน',80.00,75.00,'2026-06-23 20:50:32'),(8,'YLO','YLO3','บูรณาการความรู้',85.00,82.00,'2026-06-23 20:50:32'),(9,'YLO','YLO4','ปฏิบัติงานจริงได้',90.00,88.00,'2026-06-23 20:50:32');
/*!40000 ALTER TABLE `curriculum_report_stats` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `degree`
--

DROP TABLE IF EXISTS `degree`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `degree` (
  `degree_id` bigint NOT NULL AUTO_INCREMENT,
  `faculty_id` bigint NOT NULL COMMENT 'รหัสอาจารย์ (เชื่อมตาราง faculty)',
  `degree_level` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT 'ระดับการศึกษา เช่น Bachelor, Master, Doctoral',
  `degree_name_th` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT 'ชื่อปริญญา (ไทย)',
  `degree_name_en` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT 'ชื่อปริญญา (อังกฤษ)',
  `degree_abbr_th` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT 'ชื่อย่อปริญญา (ไทย)',
  `degree_abbr_en` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT 'ชื่อย่อปริญญา (อังกฤษ)',
  `major` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT 'สาขาวิชา',
  `institution_name` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT 'ชื่อสถาบันที่จบ',
  `graduation_year` int DEFAULT NULL COMMENT 'ปีที่จบการศึกษา (พ.ศ. หรือ ค.ศ.)',
  `start_year` int DEFAULT NULL COMMENT 'ปีที่เริ่มศึกษา',
  `expected_grad_year` int DEFAULT NULL COMMENT 'ปีที่คาดว่าจะจบ',
  `file_path` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci COMMENT 'ที่อยู่ไฟล์แนบหลักฐานการศึกษา',
  PRIMARY KEY (`degree_id`),
  KEY `fk_degree_faculty` (`faculty_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `degree`
--

LOCK TABLES `degree` WRITE;
/*!40000 ALTER TABLE `degree` DISABLE KEYS */;
/*!40000 ALTER TABLE `degree` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `document_approval_requests`
--

DROP TABLE IF EXISTS `document_approval_requests`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `document_approval_requests` (
  `document_approval_request_id` bigint NOT NULL AUTO_INCREMENT,
  `approval_request_id` bigint NOT NULL,
  `document_ref` varchar(100) DEFAULT NULL,
  `document_title` varchar(255) NOT NULL,
  `document_type` varchar(100) DEFAULT NULL,
  `file_path` varchar(500) DEFAULT NULL,
  `reason` text,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`document_approval_request_id`),
  UNIQUE KEY `uq_document_approval` (`approval_request_id`),
  KEY `idx_document_approval_ref` (`document_ref`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `document_approval_requests`
--

LOCK TABLES `document_approval_requests` WRITE;
/*!40000 ALTER TABLE `document_approval_requests` DISABLE KEYS */;
INSERT INTO `document_approval_requests` VALUES (1,4,'TQF3-NUR301','TQF 3 รายวิชา NUR301','TQF 3',NULL,'ขออนุมัติเอกสาร TQF 3 รายวิชา NUR301','2026-06-19 23:00:33');
/*!40000 ALTER TABLE `document_approval_requests` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `enrollment`
--

DROP TABLE IF EXISTS `enrollment`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `enrollment` (
  `enrollment_id` bigint NOT NULL AUTO_INCREMENT,
  `student_id` bigint NOT NULL,
  `subject_id` bigint NOT NULL,
  `academic_year` int DEFAULT NULL COMMENT 'ปีการศึกษา เช่น 2567',
  `semester` int DEFAULT NULL COMMENT 'ภาคการศึกษา (1, 2, 3)',
  `section` int DEFAULT NULL COMMENT 'ตอนเรียน (Sec)',
  `grade` varchar(5) DEFAULT NULL COMMENT 'เกรดที่ได้ (A, B+, ...)',
  `midterm` decimal(5,2) DEFAULT NULL,
  `final` decimal(5,2) DEFAULT NULL,
  `assignment` decimal(5,2) DEFAULT NULL,
  `status` enum('Active','Withdrawn','Dropped','Failed') DEFAULT 'Active',
  PRIMARY KEY (`enrollment_id`),
  KEY `student_id` (`student_id`),
  KEY `subject_id` (`subject_id`)
) ENGINE=InnoDB AUTO_INCREMENT=40 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `enrollment`
--

LOCK TABLES `enrollment` WRITE;
/*!40000 ALTER TABLE `enrollment` DISABLE KEYS */;
INSERT INTO `enrollment` VALUES (26,6603400001,1,2567,1,1,'A',NULL,NULL,NULL,'Active'),(27,6603400002,1,2567,1,1,'B+',NULL,NULL,NULL,'Active'),(28,6603400004,1,2567,1,1,'C+',NULL,NULL,NULL,'Active'),(29,6603400005,1,2567,1,1,'B',NULL,NULL,NULL,'Active'),(30,6603400006,1,2567,1,1,NULL,NULL,NULL,NULL,'Active'),(31,6603400007,1,2567,1,1,NULL,NULL,NULL,NULL,'Active'),(32,6603400001,2,2567,1,1,'B',NULL,NULL,NULL,'Active'),(33,6603400002,2,2567,1,1,'A',NULL,NULL,NULL,'Active'),(34,6603400004,2,2567,1,1,NULL,NULL,NULL,NULL,'Active'),(35,6603400001,4,2567,1,1,NULL,NULL,NULL,NULL,'Active'),(36,6603400005,4,2567,1,1,'C',NULL,NULL,NULL,'Active'),(37,6603400001,3,2567,1,1,NULL,NULL,NULL,NULL,'Active'),(38,6603400002,3,2567,1,1,NULL,NULL,NULL,NULL,'Active'),(39,6603400004,3,2567,1,1,NULL,NULL,NULL,NULL,'Active');
/*!40000 ALTER TABLE `enrollment` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `faculty`
--

DROP TABLE IF EXISTS `faculty`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `faculty` (
  `id` bigint NOT NULL AUTO_INCREMENT,
  `faculty_id` bigint NOT NULL,
  `title` varchar(50) DEFAULT NULL COMMENT 'คำนำหน้าชื่อ (นาย/นาง/ดร./ผศ.)',
  `first_name_th` varchar(100) DEFAULT NULL,
  `last_name_th` varchar(100) DEFAULT NULL,
  `first_name_en` varchar(100) DEFAULT NULL,
  `last_name_en` varchar(100) DEFAULT NULL,
  `gender` varchar(20) DEFAULT NULL,
  `birth_date` date DEFAULT NULL,
  `email` varchar(100) DEFAULT NULL,
  `phone` varchar(50) DEFAULT NULL,
  `current_address` text COMMENT 'ที่อยู่ปัจจุบัน',
  `nursing_council_no` varchar(50) DEFAULT NULL COMMENT 'เลขที่บัตรสภาการพยาบาล / ใบประกอบวิชาชีพ',
  `license_expiry` date DEFAULT NULL COMMENT 'วันหมดอายุใบอนุญาตประกอบวิชาชีพ',
  `start_work_date` date DEFAULT NULL COMMENT 'วันที่เริ่มปฏิบัติงาน',
  `academic_position_date` date DEFAULT NULL COMMENT 'วันที่รับตำแหน่งทางวิชาการ',
  `profile_picture` text COMMENT 'URL รูปโปรไฟล์',
  `nursing_council_file` text COMMENT 'URL ไฟล์บัตรสภาการพยาบาล',
  `license_file` text COMMENT 'URL ไฟล์ใบอนุญาตประกอบวิชาชีพ',
  `teaching_cert_file` text COMMENT 'URL ไฟล์ใบประกอบวิชาชีพครู',
  `status` enum('Active','Retired') CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT 'Active' COMMENT 'สถานะการทำงาน (Active/Retired)',
  `description` text,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`faculty_id`),
  UNIQUE KEY `idx_faculty_id_auto` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=55 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `faculty`
--

LOCK TABLES `faculty` WRITE;
/*!40000 ALTER TABLE `faculty` DISABLE KEYS */;
INSERT INTO `faculty` VALUES (54,123456,'นางสาว','อุษา','จันทวงศ์','Ousa','Chanthwngs','หญิง','1976-12-25',NULL,'0876802992','3333',NULL,'2028-03-23','2009-02-09',NULL,'https://drive.google.com/uc?id=1caZxI_46bX91yrfYOQxDy2STIAj-v37c','ข้อมูลบุคลากร test_Images/54.สำเนาบัตรสมาชิกสภาการพยาบาล.115206.jpg','ข้อมูลบุคลากร test_Images/54.สำเนาใบอนุญาตประกอบวิชาชีพ.115209.jpg','ข้อมูลบุคลากร test_Images/54.เอกสารรับรองผ่านการอบรมหลักสูตรการสอนทางพยาบาล.115209.jpg','Active',NULL,'2026-07-05 03:44:55'),(26,234561,'อาจารย์','สุภาพร','แตงจุ้ย','Suphaphr','Aetngchuy','หญิง','1994-08-30',NULL,'0922626443','145 หมู่11 ซ.สวนผัก29 ถ.สวนผัก เขตตลิ่งชัน กทม','6111283091','2027-12-23','2023-03-01',NULL,'https://drive.google.com/uc?id=1AJ2mLVzvMR3AveL3vbFB-IWLYsreCX-O','ข้อมูลบุคลากร test_Images/26.สำเนาบัตรสมาชิกสภาการพยาบาล.114220.jpg','ข้อมูลบุคลากร test_Images/26.สำเนาใบอนุญาตประกอบวิชาชีพ.114224.jpg','ข้อมูลบุคลากร test_Images/26.เอกสารรับรองผ่านการอบรมหลักสูตรการสอนทางพยาบาล.114224.jpg','Active',NULL,'2026-07-05 03:44:53'),(33,380018,'อาจารย์','พรรณี','ตรังคสันต์','Phrrni','Trangkhsant','หญิง','1968-02-27',NULL,NULL,'63/213 บรมราชชนนี 64  แขวงศาลาธรรม เขตทวีวัฒนา กรุงเทพมหานคร','4511050332','2023-11-04','2015-10-10',NULL,'https://drive.google.com/uc?id=19xYaKu29ABLwiaMIv-3kkggQRSe9yvTn','ข้อมูลบุคลากร test_Images/33.สำเนาบัตรสมาชิกสภาการพยาบาล.034119.jpg','ข้อมูลบุคลากร test_Images/33.สำเนาใบอนุญาตประกอบวิชาชีพ.034122.jpg','ข้อมูลบุคลากร test_Images/33.เอกสารรับรองผ่านการอบรมหลักสูตรการสอนทางพยาบาล.034123.jpg','Active',NULL,'2026-07-05 03:44:54'),(31,382018,'อาจารย์','บัวทิพย์','เพ็งศรี','Bawthiphy','Ephngsri','หญิง','1970-10-17',NULL,'0815659852','47/5 ม.4 ตำบลพิมลราช อำเภอบางบัวทอง จังหวัดนนทบุรี','4511048575','2023-08-05','2015-10-01',NULL,'https://drive.google.com/uc?id=1pwVOigXqjqsLaNw6raKaTtsn0RVoamIA','ข้อมูลบุคลากร test_Images/31.สำเนาบัตรสมาชิกสภาการพยาบาล.033704.jpg','ข้อมูลบุคลากร test_Images/31.สำเนาใบอนุญาตประกอบวิชาชีพ.033707.jpg','ข้อมูลบุคลากร test_Images/31.เอกสารรับรองผ่านการอบรมหลักสูตรการสอนทางพยาบาล.033708.jpg','Active',NULL,'2026-07-05 03:44:54'),(32,540215,'อาจารย์','ศิริพร','สามสี','Siriphr','Samsi','หญิง','1969-04-13',NULL,'0812534343','28 หอพักพยาบาล โรงพยาบาลธนบุรี1 ซอยแสงศึกษา ถนนอิสรภาพ พรานนก เขตบางกอกน้อย กรุงเทพมหานคร','4511075055','2024-04-07','2015-10-01',NULL,'https://drive.google.com/uc?id=18cohpXHCv2rRnAtuttjp34N9RkwyYKLh','ข้อมูลบุคลากร test_Images/32.สำเนาบัตรสมาชิกสภาการพยาบาล.033900.jpg','ข้อมูลบุคลากร test_Images/32.สำเนาใบอนุญาตประกอบวิชาชีพ.033903.jpg','ข้อมูลบุคลากร test_Images/32.เอกสารรับรองผ่านการอบรมหลักสูตรการสอนทางพยาบาล.033904.jpg','Active',NULL,'2026-07-05 03:44:54'),(52,570205,'นางสาว','นลินี','แสนชนะ','Nlini','Aesnchna','หญิง','1980-04-01',NULL,'0829159056','58 ถนนพระรามที่ 2 วอย 28 แยก 11 แขวงจอมทอง เขตจอมทอง กรุงเทพมหานคร 10150',NULL,'2027-12-23','2013-09-02',NULL,'https://drive.google.com/uc?id=1Z_hqbzznU1Gk3s1dyyeo_YMdza25VUVG','ข้อมูลบุคลากร test_Images/52.สำเนาบัตรสมาชิกสภาการพยาบาล.115650.jpg','ข้อมูลบุคลากร test_Images/52.สำเนาใบอนุญาตประกอบวิชาชีพ.115653.jpg','ข้อมูลบุคลากร test_Images/52.เอกสารรับรองผ่านการอบรมหลักสูตรการสอนทางพยาบาล.115653.jpg','Active',NULL,'2026-07-05 03:44:55'),(20,650291,'อาจารย์','อัจรา','ฐิตวัฒนกุล','Oachra','Thitwathnkul','หญิง','1987-09-13',NULL,'0646482795','99/63 ม.แกรนดิโอ เพชรเกษม81 ถ.มาเจริญ แขวงหนองค้างพลู เขตหนองแขม กทม.','5311218207','2025-03-21','2022-08-16',NULL,'https://drive.google.com/uc?id=1yn-yQIIdndxy43Q8LWU-rBHMnhO7UnnH','ข้อมูลบุคลากร test_Images/20.สำเนาบัตรสมาชิกสภาการพยาบาล.112044.jpg','ข้อมูลบุคลากร test_Images/20.สำเนาใบอนุญาตประกอบวิชาชีพ.112048.jpg','ข้อมูลบุคลากร test_Images/20.เอกสารรับรองผ่านการอบรมหลักสูตรการสอนทางพยาบาล.112048.jpg','Active',NULL,'2026-07-05 03:43:30'),(4,980279,'อาจารย์','ศิรินา','สันทัดงาน','Sirina','Santhadngan','หญิง','1966-03-07',NULL,'0987146559','18/1 ซ. สวนผัก ถนนราชพฤกษ์ เบตตลิ่งชัน','5611057840','2025-11-28','2020-05-01','2024-07-31','https://drive.google.com/uc?id=1qbG0Q-5PqHaohfDK_p8EjI3jAa24b96k','ข้อมูลบุคลากร test_Images/4.สำเนาบัตรสมาชิกสภาการพยาบาล.080923.jpg','ข้อมูลบุคลากร test_Images/4.สำเนาใบอนุญาตประกอบวิชาชีพ.080926.jpg','ข้อมูลบุคลากร test_Images/4.เอกสารรับรองผ่านการอบรมหลักสูตรการสอนทางพยาบาล.080927.jpg','Active',NULL,'2026-07-05 03:43:29'),(35,999001,'อาจารย์','พิไลพรรณ','แก้วแก่นตา','Phiailphrrn','Aekwaeknta','หญิง','1976-01-13',NULL,'0800769229','675 ม.10 ต.ท่าตูม อ.ศรีมหาโพธิ์ จ.ปราจีนบุรี','4511032299',NULL,'2016-05-01',NULL,'https://drive.google.com/uc?id=1p1P6Uc1bF638ZmvZO06l997SfnqPPG8W','https://drive.google.com/open?id=1NgcS__x5fEpgKkiBs9UcZRqZTAlTniGx','https://drive.google.com/open?id=1xDStdB8fPg-tRIG32mD-_mJ9BN25vZL3',NULL,'Active',NULL,'2026-07-05 03:44:54'),(34,999002,'อาจารย์','พาจนา','ดวงจันทร์','Phachna','Dwngchanthr','หญิง','1967-04-29',NULL,NULL,'99/85 ม.2 แขวงทวีวัฒนา เขตทวีวัฒนา กรุงเทพมหานคร','4511050318',NULL,'2005-02-01',NULL,'https://drive.google.com/uc?id=1fYoqhgygboofzVEFHkKUVamW0RJxSWtP','ข้อมูลบุคลากร test_Images/34.สำเนาบัตรสมาชิกสภาการพยาบาล.035550.jpg','ข้อมูลบุคลากร test_Images/34.สำเนาใบอนุญาตประกอบวิชาชีพ.035553.jpg','ข้อมูลบุคลากร test_Images/34.เอกสารรับรองผ่านการอบรมหลักสูตรการสอนทางพยาบาล.035553.jpg','Active',NULL,'2026-07-05 03:44:54'),(30,999003,'อาจารย์','นิตยา','วิโรจนะ','Nitya','Wiorchna','หญิง','1950-02-14',NULL,'0817361147','187/96 ซอย 17 ถนนท่าข้าม แขวงแสมดำ เขตบางขุนเทียน จังหวัดกรุงเทพมหานคร','6111001037',NULL,'2013-05-16',NULL,'https://drive.google.com/uc?id=1-5OT7QO4me9xO4-FRznMWNxqgF3DIXIN','ข้อมูลบุคลากร test_Images/30.สำเนาบัตรสมาชิกสภาการพยาบาล.033517.jpg','ข้อมูลบุคลากร test_Images/30.สำเนาใบอนุญาตประกอบวิชาชีพ.033520.jpg','ข้อมูลบุคลากร test_Images/30.เอกสารรับรองผ่านการอบรมหลักสูตรการสอนทางพยาบาล.033520.jpg','Active',NULL,'2026-07-05 03:44:54'),(29,999004,'อาจารย์','สิรินัฐ','สินวรรณกุล','Sirinath','Sinwrrnkul','หญิง','1969-09-11',NULL,NULL,'34 ร.พ.ธนบุรี1 (10A) ถนนอิสรภาพ44 บ้านช่างทองหล่อ เขตบางกอกน้อย จังหวัดกรุงเทพมหานคร','4511070793',NULL,'2010-09-01',NULL,'https://drive.google.com/uc?id=1hwm_h30h-344iu8i5WSvMhDAMoczCN61','ข้อมูลบุคลากร test_Images/29.สำเนาบัตรสมาชิกสภาการพยาบาล.033020.jpg','ข้อมูลบุคลากร test_Images/29.สำเนาใบอนุญาตประกอบวิชาชีพ.033023.jpg','ข้อมูลบุคลากร test_Images/29.เอกสารรับรองผ่านการอบรมหลักสูตรการสอนทางพยาบาล.033023.jpg','Active',NULL,'2026-07-05 03:44:54'),(37,5200009,'นางสาว','ธารทิพย์','จิรกัญจนะ','Tharthiphy','Chirkaychna','หญิง','1975-02-15',NULL,'0928959059','8/96 ถ.ศาลาธรรมสพน์30  แขวงศาลาธรรมสพน์  เขตทวีวัฒนา กทม. 10170','4511034476','2027-03-25','2009-11-01',NULL,'https://drive.google.com/uc?id=1lXzV92RgQQVr14z6tiaHyt5-NKQ4V2dE','ข้อมูลบุคลากร test_Images/37.สำเนาบัตรสมาชิกสภาการพยาบาล.015813.jpg','ข้อมูลบุคลากร test_Images/37.สำเนาใบอนุญาตประกอบวิชาชีพ.015816.jpg','ข้อมูลบุคลากร test_Images/37.เอกสารรับรองผ่านการอบรมหลักสูตรการสอนทางพยาบาล.015816.jpg','Active',NULL,'2026-07-05 03:44:54'),(27,40172006,'อาจารย์','เฟื่องสุข','ไพศาลกอบฤทธิ์','Efueongsukh','Aiphsalkobฤththi','หญิง','1955-07-21',NULL,'0897865253','102/432 ม.5 ต.บางรักพัฒนา อ.บางบัวทอง จ.นนทบุรี','4511055434','2027-12-23','1998-11-01',NULL,'https://drive.google.com/uc?id=1tksZgZsAPP1ze0N8tEUfUaz82WjDWknV','ข้อมูลบุคลากร test_Images/27.สำเนาบัตรสมาชิกสภาการพยาบาล.114459.jpg','ข้อมูลบุคลากร test_Images/27.สำเนาใบอนุญาตประกอบวิชาชีพ.114502.jpg','ข้อมูลบุคลากร test_Images/27.เอกสารรับรองผ่านการอบรมหลักสูตรการสอนทางพยาบาล.114503.jpg','Active',NULL,'2026-07-05 03:44:53'),(48,41172008,'ผู้ช่วยศาสตราจารย์ ดร.','จรัสดาว','เรโนลด์','Chrasdaw','Eronld','หญิง','1968-04-15',NULL,'00000000',NULL,'4511059 407','2025-07-26','1989-01-11','2015-06-01','https://drive.google.com/uc?id=1n2huOJMYaC-E4WOh0Q58d9JMrYum7wDo','ข้อมูลบุคลากร test_Images/48.สำเนาบัตรสมาชิกสภาการพยาบาล.120509.jpg','ข้อมูลบุคลากร test_Images/48.สำเนาใบอนุญาตประกอบวิชาชีพ.120512.jpg','ข้อมูลบุคลากร test_Images/48.เอกสารรับรองผ่านการอบรมหลักสูตรการสอนทางพยาบาล.120513.jpg','Active',NULL,'2026-07-05 03:44:54'),(19,41172011,'ผู้ช่วยศาสตราจารย์ ดร.','พิชาภรณ์','จันทนกุล','Phichaphrn','Chanthnkul','หญิง','1972-07-27',NULL,'0815852959','99/168 ชั้น 9 ซิตี้โฮมสี่แยกท่าพระ ถ.รัชดาภิเษก แขวงวัดท่าพระ บางกอกใหญ่ กรุงเทพ','4511036515','2024-03-29','1998-05-01','2015-03-06','https://drive.google.com/uc?id=1JJd7suviuotMBPT7FSs8agD2whvr2MBw','ข้อมูลบุคลากร test_Images/19.สำเนาบัตรสมาชิกสภาการพยาบาล.111647.jpg','ข้อมูลบุคลากร test_Images/19.สำเนาใบอนุญาตประกอบวิชาชีพ.111650.jpg','ข้อมูลบุคลากร test_Images/19.เอกสารรับรองผ่านการอบรมหลักสูตรการสอนทางพยาบาล.111651.jpg','Active',NULL,'2026-07-05 03:43:30'),(36,41172017,'ผู้ช่วยศาสตราจารย์ ดร.','อรทิพา','ส่องศิริ','Orthipha','Songsiri','หญิง','1951-07-22',NULL,'0818036865','105/19 ซอยเพชรเกษม 19 แขวงปากคลอง เขตภาษีเจริญ','4511016150','2028-07-27','1994-10-01','2005-11-26','https://drive.google.com/uc?id=102NBXg19xtPG_cNLibiU6HiU2LtH-GY-','ข้อมูลบุคลากร test_Images/36.สำเนาบัตรสมาชิกสภาการพยาบาล.014704.jpg','ข้อมูลบุคลากร test_Images/36.สำเนาใบอนุญาตประกอบวิชาชีพ.014708.jpg','ข้อมูลบุคลากร test_Images/36.เอกสารรับรองผ่านการอบรมหลักสูตรการสอนทางพยาบาล.014709.jpg','Active',NULL,'2026-07-05 03:44:54'),(49,42172021,'ผู้ช่วยศาสตราจารย์ ดร.','วัฒนีย์','ปานจินดา','Wathniy','Panchinda','หญิง','1955-08-17',NULL,'0000000000',NULL,'4511077 074','2027-12-23','2001-10-16','2022-10-31','https://drive.google.com/uc?id=17RdUG9FbFhC4-7hMvOFHWf5sb6kObmSX','ข้อมูลบุคลากร test_Images/49.สำเนาบัตรสมาชิกสภาการพยาบาล.120242.jpg','ข้อมูลบุคลากร test_Images/49.สำเนาใบอนุญาตประกอบวิชาชีพ.120245.jpg','ข้อมูลบุคลากร test_Images/49.เอกสารรับรองผ่านการอบรมหลักสูตรการสอนทางพยาบาล.120245.jpg','Active',NULL,'2026-07-05 03:44:54'),(42,42172025,'อาจารย์ ดร.','ปรียธิดา','ชลศึกเสนีย์','Priythida','Chlsuekesniy','หญิง','1966-07-31',NULL,'0801461617','52 ถ.โชคชัย4ซอย50 แยก6 แขวงลาดพร้าว เขตลาดพร้าว กรุงเทพฯ','4511055442','2026-05-17','1999-07-01',NULL,'https://drive.google.com/uc?id=1Lz7xtHQwsvpe3MKmo610S2SlThUsZwWT','ข้อมูลบุคลากร test_Images/42.สำเนาบัตรสมาชิกสภาการพยาบาล.015346.jpg','ข้อมูลบุคลากร test_Images/42.สำเนาใบอนุญาตประกอบวิชาชีพ.015349.jpg','ข้อมูลบุคลากร test_Images/42.เอกสารรับรองผ่านการอบรมหลักสูตรการสอนทางพยาบาล.015350.jpg','Active',NULL,'2026-07-05 03:44:54'),(3,44172033,'ผู้ช่วยศาสตราจารย์','ภัทรพร','อรัณยภาค','Phathrphr','Oranyphakh','หญิง','1953-02-16',NULL,'0814784647','77 เพชรเกษม ซอย 40','4511016607','2025-08-06','2001-10-16','2008-07-14','https://drive.google.com/uc?id=11kytl6TBnEyLNZOzOz45LBKG4726L4d5','ข้อมูลบุคลากร test_Images/3.สำเนาบัตรสมาชิกสภาการพยาบาล.080113.jpg','ข้อมูลบุคลากร test_Images/3.สำเนาใบอนุญาตประกอบวิชาชีพ.080116.jpg','ข้อมูลบุคลากร test_Images/3.เอกสารรับรองผ่านการอบรมหลักสูตรการสอนทางพยาบาล.080116.jpg','Active',NULL,'2026-07-05 03:43:29'),(22,45172037,'ผู้ช่วยศาสตราจารย์ ดร.','สุสารี','ประคินกิจ','Susari','Prakhinkich','หญิง','1975-01-25',NULL,'0858219229','29 ถ.ราชพฤกษ์ แขวงบุคคโล','4511005639','2027-12-23','2002-11-01','2010-08-30','https://drive.google.com/uc?id=1DvmZeNAYDIEqxb2F2pPlIUIuSiAI1jLT','ข้อมูลบุคลากร test_Images/22.สำเนาบัตรสมาชิกสภาการพยาบาล.112954.jpg','ข้อมูลบุคลากร test_Images/22.สำเนาใบอนุญาตประกอบวิชาชีพ.112958.jpg','ข้อมูลบุคลากร test_Images/22.เอกสารรับรองผ่านการอบรมหลักสูตรการสอนทางพยาบาล.112958.jpg','Active',NULL,'2026-07-05 03:43:30'),(21,45172038,'ผู้ช่วยศาสตราจารย์ ดร.','สมฤดี','ชื่นกิติญานนท์','Smฤdi','Chuenkitiyannth','หญิง','1975-05-09',NULL,'081-6148304','525/444 หมู่บ้านทาวน์พลัสประชาอุทิศ ถนนประชาอุทิศ ทุ่งครุ ทุ่งครุ กทม 10140','4611093778','2027-12-23','2002-12-02','2015-03-06','https://drive.google.com/uc?id=1_p_8H6vofSiiaEK_x1XK9uqexqIGlCEy','ข้อมูลบุคลากร test_Images/21.สำเนาบัตรสมาชิกสภาการพยาบาล.112310.jpg','ข้อมูลบุคลากร test_Images/21.สำเนาใบอนุญาตประกอบวิชาชีพ.112313.jpg','ข้อมูลบุคลากร test_Images/21.เอกสารรับรองผ่านการอบรมหลักสูตรการสอนทางพยาบาล.112314.jpg','Active',NULL,'2026-07-05 03:43:30'),(47,46172040,'อาจารย์ ดร. พันจ่าเอก','ภูมเดชา','ชาญเบญจพิภู','Phumedcha','Chayebychphiphu','ชาย','1964-04-07',NULL,'0626954155','5/102 หมู่บ้านวรารมย์ ถนนบางบอน 5 แขวงบางบอน เขตบางบอน กรุงเทพ 10150','4521050682','2025-03-21','2003-03-03',NULL,'https://drive.google.com/uc?id=1nqUnmZPMKxvtp58XxbOJA30mFnsrM68F','ข้อมูลบุคลากร test_Images/47.สำเนาบัตรสมาชิกสภาการพยาบาล.120829.jpg','ข้อมูลบุคลากร test_Images/47.สำเนาใบอนุญาตประกอบวิชาชีพ.120832.jpg','ข้อมูลบุคลากร test_Images/47.เอกสารรับรองผ่านการอบรมหลักสูตรการสอนทางพยาบาล.120832.jpg','Active',NULL,'2026-07-05 03:44:54'),(15,47172044,'อาจารย์ ดร.','สุวรรณา','เชียงขุนทด','Suwrrna','Echiyngkhunthd','หญิง','1973-02-01',NULL,'0645165928','27 หมู่ 1 ต.พะเนียด อ.นครชัยศรี จ.นครปฐม','4511007784','2024-03-29','2003-05-01',NULL,'https://drive.google.com/uc?id=1873hqWR7woVu9DDMW62peMBHB3g1nq8s','ข้อมูลบุคลากร test_Images/15.สำเนาบัตรสมาชิกสภาการพยาบาล.084249.jpg','ข้อมูลบุคลากร test_Images/15.สำเนาใบอนุญาตประกอบวิชาชีพ.084252.jpg','ข้อมูลบุคลากร test_Images/15.เอกสารรับรองผ่านการอบรมหลักสูตรการสอนทางพยาบาล.084253.jpg','Active',NULL,'2026-07-05 03:43:30'),(43,47172046,'ผู้ช่วยศาสตราจารย์','วารุณี','เพไร','Waruni','Ephair','หญิง','1972-08-06',NULL,'0832347470','318 เพชรเกษม 54 แยก 3 แขวงบางด้วน เขตภาษีเจริญ กรุงเทพ 10160','4711186486','2027-12-23','2004-06-01','2012-03-06','https://drive.google.com/uc?id=1WnAMTUhLQr6o922AuVoghx2Bxy7ieBlW','ข้อมูลบุคลากร test_Images/43.สำเนาบัตรสมาชิกสภาการพยาบาล.020201.jpg','ข้อมูลบุคลากร test_Images/43.สำเนาใบอนุญาตประกอบวิชาชีพ.020205.jpg','ข้อมูลบุคลากร test_Images/43.เอกสารรับรองผ่านการอบรมหลักสูตรการสอนทางพยาบาล.020205.jpg','Active',NULL,'2026-07-05 03:44:54'),(23,47172047,'ผู้ช่วยศาสตราจารย์ ดร.','ชนิดา','มัททวางกูร','Chnida','Maththwangkur','หญิง','1971-09-21',NULL,'0870434000','47/2','4511069513','2027-12-23','2004-07-01','2019-06-13','https://drive.google.com/uc?id=1joP5gdCjeF_vwjd4pwgfWP1vtMHOQy-z','ข้อมูลบุคลากร test_Images/23.สำเนาบัตรสมาชิกสภาการพยาบาล.113246.jpg','ข้อมูลบุคลากร test_Images/23.สำเนาใบอนุญาตประกอบวิชาชีพ.113249.jpg','ข้อมูลบุคลากร test_Images/23.เอกสารรับรองผ่านการอบรมหลักสูตรการสอนทางพยาบาล.113250.jpg','Active',NULL,'2026-07-05 03:43:30'),(11,47172049,'ผู้ช่วยศาสตราจารย์ ดร.','ศนิกานต์','ศรีมณี','Snikant','Srimni','หญิง','1975-03-01',NULL,'0815809893','39/72 ไอคอนโดเพชรเกษม 39','4511078893',NULL,'2004-10-10',NULL,'https://drive.google.com/uc?id=1d75kQbWnbEfPcuIIbPeVEsARyjVyTmHX','ข้อมูลบุคลากร test_Images/11.สำเนาบัตรสมาชิกสภาการพยาบาล.083315.jpg','ข้อมูลบุคลากร test_Images/11.สำเนาใบอนุญาตประกอบวิชาชีพ.083319.jpg','ข้อมูลบุคลากร test_Images/11.เอกสารรับรองผ่านการอบรมหลักสูตรการสอนทางพยาบาล.083319.jpg','Active',NULL,'2026-07-05 03:43:30'),(38,49172053,'อาจารย์','พรพิมล','ภูมิฤทธิกุล','Phrphiml','Phumiฤththikul','หญิง','1959-04-20',NULL,'0849122468','18/23 หมู่บ้านตะวันฉาย หนองแขม กรุงเทพฯ','5511168672','2027-12-23','2006-03-16',NULL,'https://drive.google.com/uc?id=1aqvr313xS63kdlSuNR-I6uYZ4jXjpdPc','ข้อมูลบุคลากร test_Images/38.สำเนาบัตรสมาชิกสภาการพยาบาล.014436.jpg','ข้อมูลบุคลากร test_Images/38.สำเนาใบอนุญาตประกอบวิชาชีพ.014439.jpg','ข้อมูลบุคลากร test_Images/38.เอกสารรับรองผ่านการอบรมหลักสูตรการสอนทางพยาบาล.014439.jpg','Active',NULL,'2026-07-05 03:44:54'),(53,49172054,'อาจารย์','สุนันทา','บุญรักษา','Sunantha','Buyraksa','หญิง','1975-05-10',NULL,'00000000','19/1 ม 1 ต.สระลงเรือ อ.ห้วยกระเจา  จ.กาญจนบุรี','6511108 587','2027-12-23','2006-08-01',NULL,'https://drive.google.com/uc?id=1O0HewXyY8pLusOpbJhrU9rUCpOdbqTad','ข้อมูลบุคลากร test_Images/53.สำเนาบัตรสมาชิกสภาการพยาบาล.115430.jpg','ข้อมูลบุคลากร test_Images/53.สำเนาใบอนุญาตประกอบวิชาชีพ.115434.jpg','ข้อมูลบุคลากร test_Images/53.เอกสารรับรองผ่านการอบรมหลักสูตรการสอนทางพยาบาล.115435.jpg','Active',NULL,'2026-07-05 03:44:55'),(6,50172059,'อาจารย์์','ลัญชนา','พิมพันธ์ชัยยบูลย์','Laychna','Phimphanthchayybuly','หญิง','1982-06-16',NULL,'0801635444','864/188 the niche id บางแค แขวง/เขตบางแค กรุงเทพ 10160','5211180156','2028-03-18','2007-07-01',NULL,'https://drive.google.com/uc?id=13ory991sStiiW-IidEBl-ahxOFvyeZzO','ข้อมูลบุคลากร test_Images/6.สำเนาบัตรสมาชิกสภาการพยาบาล.082022.jpg','ข้อมูลบุคลากร test_Images/6.สำเนาใบอนุญาตประกอบวิชาชีพ.082025.jpg','ข้อมูลบุคลากร test_Images/6.เอกสารรับรองผ่านการอบรมหลักสูตรการสอนทางพยาบาล.082026.jpg','Active',NULL,'2026-07-05 03:43:29'),(45,51162072,'อาจารย์','เพ็ญรุ่ง','นวลแจ่ม','Ephyrung','Nwlaechm','หญิง','1973-01-20',NULL,'0816251474','219 ซอยเทอดไท 63/2 ถนนเทอดไท บางหว้า ภาษีเจริญ กทม10160','6611103761','2027-12-23','2008-08-04',NULL,'https://drive.google.com/uc?id=1aJ_tfI4dAkn8KeraBcZyspPQ7B4UxQ_H','ข้อมูลบุคลากร test_Images/45.สำเนาบัตรสมาชิกสภาการพยาบาล.014052.jpg','ข้อมูลบุคลากร test_Images/45.สำเนาใบอนุญาตประกอบวิชาชีพ.014056.jpg','ข้อมูลบุคลากร test_Images/45.เอกสารรับรองผ่านการอบรมหลักสูตรการสอนทางพยาบาล.014056.jpg','Active',NULL,'2026-07-05 03:44:54'),(18,52172065,'อาจารย์ ดร.','สุลีมาศ','อังศุเกียรติถาวร','Sulimas','Oangsuekiyrtithawr','หญิง','1974-08-14',NULL,'0869954040','18/241 ลุมพินีวิลล์คอนโดบางแค','4511009866','2024-03-30','2009-11-16',NULL,'https://drive.google.com/uc?id=1NGZ3VT9Y0Tp303CU2HPo_uFWz-2VtQa2','ข้อมูลบุคลากร test_Images/18.สำเนาบัตรสมาชิกสภาการพยาบาล.085023.jpg','ข้อมูลบุคลากร test_Images/18.สำเนาใบอนุญาตประกอบวิชาชีพ.085026.jpg','ข้อมูลบุคลากร test_Images/18.เอกสารรับรองผ่านการอบรมหลักสูตรการสอนทางพยาบาล.085026.jpg','Active',NULL,'2026-07-05 03:43:30'),(5,53172079,'อาจารย์','สุธิดา','พรมรัศมี','Suthida','Phrmrasmi','หญิง','1981-03-02',NULL,'0863297163','160/134 แกรนริเวอร์เทาวน์เวอร์ ซ. พิบูลย์สงคราม 15 ถ. พิบูลย์สงคราม ต. สวนใหญ๋ อ. เมือง จ. นนทบุรี','5611207472','2023-08-05','2010-11-16',NULL,'https://drive.google.com/uc?id=1bP3BrXVQiIeI9LZKI4br5FNgzyvg31qK','ข้อมูลบุคลากร test_Images/5.สำเนาบัตรสมาชิกสภาการพยาบาล.081739.jpg','ข้อมูลบุคลากร test_Images/5.สำเนาใบอนุญาตประกอบวิชาชีพ.081743.jpg','ข้อมูลบุคลากร test_Images/5.เอกสารรับรองผ่านการอบรมหลักสูตรการสอนทางพยาบาล.081744.jpg','Active',NULL,'2026-07-05 03:43:29'),(13,54127262,'อาจารย์','ธัญลักษณ์วดี','ก้อนทองถม','Thaylaksnwdi','Konthongthm','หญิง','1986-09-15',NULL,'0897210113','คอนโดลุมพินีเพลสบรมราชชนนี ปิ่นเกล้า ตลิ่งชัน กทม','5211209369','2023-10-28','2011-10-03',NULL,'https://drive.google.com/uc?id=1Zm5Qq1dTXjAQVLN_dABYY-KFA0Nrl7lu','ข้อมูลบุคลากร test_Images/13.สำเนาบัตรสมาชิกสภาการพยาบาล.083726.jpg','ข้อมูลบุคลากร test_Images/13.สำเนาใบอนุญาตประกอบวิชาชีพ.083729.jpg','ข้อมูลบุคลากร test_Images/13.เอกสารรับรองผ่านการอบรมหลักสูตรการสอนทางพยาบาล.083729.jpg','Active',NULL,'2026-07-05 03:43:30'),(16,54172071,'อาจารย์ ดร.','วราภรณ์','คำรศ','Wraphrn','Khamrs','หญิง','1983-08-09',NULL,'0873711369','107/34 หมู่บ้านเลอร์พาร์ค ซอยเทียนทะเล28 แขวงท่าข้าม เขตบางขุนเทียน กทม 10150','6411198208','2027-12-23','2011-12-16',NULL,'https://drive.google.com/uc?id=1YCUnwuJfnQDJmZachO3w966obH4-ieEd','ข้อมูลบุคลากร test_Images/16.สำเนาบัตรสมาชิกสภาการพยาบาล.084459.jpg','ข้อมูลบุคลากร test_Images/16.สำเนาใบอนุญาตประกอบวิชาชีพ.084502.jpg','ข้อมูลบุคลากร test_Images/16.เอกสารรับรองผ่านการอบรมหลักสูตรการสอนทางพยาบาล.084502.jpg','Active',NULL,'2026-07-05 03:43:30'),(28,54172078,'ผู้ช่วยศาสตราจารย์ ดร. เรือเอกหญิง','วิภานันท์','ม่วงสกุล','Wiphananth','Mwngskul','หญิง','1977-04-27',NULL,'0879549929','42 ถนนบางขุนเทียน แขวงบางบอน เขตบางบอน กทม.','4711178169','2027-12-23','2011-05-01','2021-03-10','https://drive.google.com/uc?id=1E2SjA2FNZyho64fD-xlhnxeyRLWSPA66','ข้อมูลบุคลากร test_Images/28.สำเนาบัตรสมาชิกสภาการพยาบาล.114734.jpg','ข้อมูลบุคลากร test_Images/28.สำเนาใบอนุญาตประกอบวิชาชีพ.114739.jpg','ข้อมูลบุคลากร test_Images/28.เอกสารรับรองผ่านการอบรมหลักสูตรการสอนทางพยาบาล.114739.jpg','Active',NULL,'2026-07-05 03:44:54'),(7,54172085,'อาจารย์','อัมพร','คงจีระ','Oamphr','Khngchira','หญิง','1951-04-16',NULL,'0819160919','151 the trust residence ปิ่นเกล้า แขวงอรุณอมรินทร์ เขตบางกอกน้อย กรุงเทพ','4511002485','2027-12-23','2011-01-11',NULL,'https://drive.google.com/uc?id=1ECqJDA5qXeauQteZxfD15vHsTLZAFyxw','ข้อมูลบุคลากร test_Images/7.สำเนาบัตรสมาชิกสภาการพยาบาล.082259.jpg','ข้อมูลบุคลากร test_Images/7.สำเนาใบอนุญาตประกอบวิชาชีพ.082303.jpg','ข้อมูลบุคลากร test_Images/7.เอกสารรับรองผ่านการอบรมหลักสูตรการสอนทางพยาบาล.082303.jpg','Active',NULL,'2026-07-05 03:43:29'),(51,56172088,'อาจารย์','วิวรรณา','คล้ายคลึง','Wiwrrna','Khlaykhlueng','หญิง','1973-10-07',NULL,'0895212345','29 ซอยเทอดไท55 ถนนเทอดไท แขวงปากคลองภาษีเจริญ เขตภาษีเจริญ กรุงเทพมหานคร 10160','4511013331','2027-12-23','2013-03-01',NULL,'https://drive.google.com/uc?id=1xx4kOk-muqL_M5BzWv4d6i1DgqrnGp_a','ข้อมูลบุคลากร test_Images/51.สำเนาบัตรสมาชิกสภาการพยาบาล.032748.jpg','ข้อมูลบุคลากร test_Images/51.สำเนาใบอนุญาตประกอบวิชาชีพ.032752.jpg','ข้อมูลบุคลากร test_Images/51.เอกสารรับรองผ่านการอบรมหลักสูตรการสอนทางพยาบาล.032752.jpg','Active',NULL,'2026-07-05 03:44:55'),(8,56172089,'นางสาว','สุจิตราภรณ์','ทับครอง','Suchitraphrn','Thabkhrong','หญิง','1995-10-02',NULL,'0863251189','1435/4 ถนนริมทางรถไฟ แขวงตลาดพลู','4511050062','2027-12-23','2013-01-05',NULL,'https://drive.google.com/uc?id=1auCWBF3365DVRxEU7ZR4po7uFY2UYb7i','ข้อมูลบุคลากร test_Images/8.สำเนาบัตรสมาชิกสภาการพยาบาล.082514.jpg','ข้อมูลบุคลากร test_Images/8.สำเนาใบอนุญาตประกอบวิชาชีพ.082517.jpg','ข้อมูลบุคลากร test_Images/8.เอกสารรับรองผ่านการอบรมหลักสูตรการสอนทางพยาบาล.082517.jpg','Active',NULL,'2026-07-05 03:43:29'),(1,56172103,'อาจารย์','รัฐกานต์','ขำเขียว','Rathkant','Khamekhiyw','หญิง','1984-12-10',NULL,'0874261515','225/8 หมู่บ้านรุ่งกานต์ 7 ตำบลบางบัวทอง อำเภอบางบัวทอง จังหวัดนนทบุรี 11110','5111205212','2027-12-23','2013-06-01','2024-08-07','https://drive.google.com/uc?id=1elyf7BVBYfGCduTRsJ2xuffMBHT8AzpX','ข้อมูลบุคลากร test_Images/2.สำเนาบัตรสมาชิกสภาการพยาบาล.073955.jpg','ข้อมูลบุคลากร test_Images/2.สำเนาใบอนุญาตประกอบวิชาชีพ.074000.jpg','ข้อมูลบุคลากร test_Images/2.เอกสารรับรองผ่านการอบรมหลักสูตรการสอนทางพยาบาล.074000.jpg','Active',NULL,'2026-07-05 03:40:15'),(25,56172104,'อาจารย์ ดร.','ณิชมล','ขวัญเมือง','Nichml','Khwayemueong','หญิง','1972-03-19',NULL,'0894595043','145 หมู่11 ซ.สวนผัก29 ถ.สวนผัก เขตตลิ่งชัน กทม','4511017614','2027-12-31','2013-05-01',NULL,'https://drive.google.com/uc?id=1USqFiHXgoLACo41OpaS6Tfe2a5DERSve','ข้อมูลบุคลากร test_Images/25.สำเนาบัตรสมาชิกสภาการพยาบาล.113906.jpg','ข้อมูลบุคลากร test_Images/25.สำเนาใบอนุญาตประกอบวิชาชีพ.113909.jpg','ข้อมูลบุคลากร test_Images/25.เอกสารรับรองผ่านการอบรมหลักสูตรการสอนทางพยาบาล.113910.jpg','Active',NULL,'2026-07-05 03:43:30'),(10,57172108,'อาจารย์','นฤมล','อังศิริศักดิ์','Nฤml','Oangsirisakdi','หญิง','1985-02-04',NULL,'0851248147','79/299 ม.ศุภาลัยวิลล์ ต.ศาลากลาง อ.บางกรวย จ.นนทบุรี','5011200055','2027-12-31','2014-04-01',NULL,'https://drive.google.com/uc?id=1x6gI8B5uHFWFFLyXtJTvwFw39pYEep23','ข้อมูลบุคลากร test_Images/10.สำเนาบัตรสมาชิกสภาการพยาบาล.083100.jpg','ข้อมูลบุคลากร test_Images/10.สำเนาใบอนุญาตประกอบวิชาชีพ.083103.jpg','ข้อมูลบุคลากร test_Images/10.เอกสารรับรองผ่านการอบรมหลักสูตรการสอนทางพยาบาล.083103.jpg','Active',NULL,'2026-07-05 03:43:29'),(39,57172109,'ผู้ช่วยศาสตราจารย์ ดร.','ดวงกมล','วิรุฬห์อุดมผล','Dwngkml','Wirulhoudmphl','หญิง','1966-04-22',NULL,'0899252193','106/101 ถ.เอกชัย แขวลบาวบอน เขตบางบอน','5711254926','2024-07-27','2014-06-01',NULL,'https://drive.google.com/uc?id=1-lOS-Wqk9T535DDJ1Xu70kTSF-nirLMV','ข้อมูลบุคลากร test_Images/39.สำเนาบัตรสมาชิกสภาการพยาบาล.014946.jpg','ข้อมูลบุคลากร test_Images/39.สำเนาใบอนุญาตประกอบวิชาชีพ.014949.jpg','ข้อมูลบุคลากร test_Images/39.เอกสารรับรองผ่านการอบรมหลักสูตรการสอนทางพยาบาล.014950.jpg','Active',NULL,'2026-07-05 03:44:54'),(9,58172110,'อาจารย์','สุกฤตา','ตะการีย์','Sukฤta','Takariy','หญิง','1980-01-26',NULL,'0909696157','28/1 ม.2  ต.ท่าตลาด อ.สามพราน จ.นครปฐม 73110','4811193884','2025-11-28','2015-01-15',NULL,'https://drive.google.com/uc?id=1psBPO920WMSZC76B4F_L8wSan3t8fN0m','ข้อมูลบุคลากร test_Images/9.สำเนาบัตรสมาชิกสภาการพยาบาล.082847.jpg','ข้อมูลบุคลากร test_Images/9.สำเนาใบอนุญาตประกอบวิชาชีพ.082850.jpg','ข้อมูลบุคลากร test_Images/9.เอกสารรับรองผ่านการอบรมหลักสูตรการสอนทางพยาบาล.082850.jpg','Active',NULL,'2026-07-05 03:43:29'),(17,59172119,'อาจารย์','ชัยสิทธิ์','ทันศึก','Chaysiththi','Thansuek','ชาย','1972-04-30',NULL,'0879881114','142/23 ม.1 ต.แพรกยา อ.เมือง จ.สมุทรปราการ 10280','4311158065','2028-07-27','2016-10-01',NULL,'https://drive.google.com/uc?id=1bwBv9IX269alpJcPN2jvhn87b253GC57','ข้อมูลบุคลากร test_Images/17.สำเนาบัตรสมาชิกสภาการพยาบาล.084801.jpg','ข้อมูลบุคลากร test_Images/17.สำเนาใบอนุญาตประกอบวิชาชีพ.084805.jpg','ข้อมูลบุคลากร test_Images/17.เอกสารรับรองผ่านการอบรมหลักสูตรการสอนทางพยาบาล.084806.jpg','Active',NULL,'2026-07-05 03:43:30'),(24,59172121,'อาจารย์','ระชี','ดิษฐจร','Rachi','Disthchr','หญิง','1955-11-16',NULL,'0869755634','146 ซ.สุขุมวิท 62 ต.บางจาก อ.พระโขนง กรุงเทพฯ 10260','4511012136','2027-12-23','2016-11-01',NULL,'https://drive.google.com/uc?id=10OJ3-dzXbX-myVOmccENNAMR910U3fpL','ข้อมูลบุคลากร test_Images/24.สำเนาบัตรสมาชิกสภาการพยาบาล.113627.jpg','ข้อมูลบุคลากร test_Images/24.สำเนาใบอนุญาตประกอบวิชาชีพ.113630.jpg','ข้อมูลบุคลากร test_Images/24.เอกสารรับรองผ่านการอบรมหลักสูตรการสอนทางพยาบาล.113631.jpg','Active',NULL,'2026-07-05 03:43:30'),(41,60172123,'อาจารย์','ขวัญเรือน','ก๋าวิตู','Khwayerueon','Kawitu','หญิง','1985-06-19',NULL,'0847083511','206/4 The village bangna3 ต.บางพลีใหญ่ อ.บางพลี จ.สมุทรปราการ','5111207345','2024-07-25','2017-02-02',NULL,'https://drive.google.com/uc?id=1qf6sC-ZthUNaS6ntboBTHYlcPTChtwip','ข้อมูลบุคลากร test_Images/41.สำเนาบัตรสมาชิกสภาการพยาบาล.013725.jpg','ข้อมูลบุคลากร test_Images/41.สำเนาใบอนุญาตประกอบวิชาชีพ.013728.jpg','ข้อมูลบุคลากร test_Images/41.เอกสารรับรองผ่านการอบรมหลักสูตรการสอนทางพยาบาล.013728.jpg','Active',NULL,'2026-07-05 03:44:54'),(46,63172128,'อาจารย์','เรวัต','แย้มสุดา','Erwat','Aeymsuda','ชาย','1959-04-28',NULL,'0814463037','109/170 หมู่2 ต.มหาสวัสดิ์ อ.บางกรวย จ.นนทบุรี','อ.1/21510',NULL,'2020-01-01',NULL,'https://drive.google.com/uc?id=1HcurGQ_0JKN-s4zn6PX7FPmR7hie1KI3','ข้อมูลบุคลากร test_Images/46.สำเนาบัตรสมาชิกสภาการพยาบาล.035305.jpg','ข้อมูลบุคลากร test_Images/46.สำเนาใบอนุญาตประกอบวิชาชีพ.035309.jpg','ข้อมูลบุคลากร test_Images/46.เอกสารรับรองผ่านการอบรมหลักสูตรการสอนทางพยาบาล.035309.jpg','Active',NULL,'2026-07-05 03:44:54'),(14,64172139,'นางสาว','สุภาภรณ์','ศรีฟ้า','Suphaphrn','Srifa','หญิง','1985-11-12',NULL,'0840583508','131 ซ เพชรเกษม 48 แยก 24 แขวงบางแวก เขตภาษีเจริญ กทม 10160','5111207470','2028-07-02','2021-03-01',NULL,'https://drive.google.com/uc?id=1noxVEzgrQHZ9nXUbfT4hhubvxi-UGrKe','ข้อมูลบุคลากร test_Images/14.สำเนาบัตรสมาชิกสภาการพยาบาล.084047.jpg','ข้อมูลบุคลากร test_Images/14.สำเนาใบอนุญาตประกอบวิชาชีพ.084050.jpg','ข้อมูลบุคลากร test_Images/14.เอกสารรับรองผ่านการอบรมหลักสูตรการสอนทางพยาบาล.084052.jpg','Active',NULL,'2026-07-05 03:43:30'),(44,65172141,'อาจารย์','นฐมน','บุญล้อม','Nthmn','Buylom','หญิง','1972-02-28',NULL,'0949629947','มัลเบอรี่เพลส  118/8-9 ถ.เพชรเกษม แขวงบางหว้า เขตภาษีเจริญ  กรุงเทพฯ','4511014607','2027-12-23','2022-08-01',NULL,'https://drive.google.com/uc?id=1Ec2xvmzkH5sgnPl7U1p_rl6pRRQzs6VR','ข้อมูลบุคลากร test_Images/44.สำเนาบัตรสมาชิกสภาการพยาบาล.034636.jpg','ข้อมูลบุคลากร test_Images/44.สำเนาใบอนุญาตประกอบวิชาชีพ.034639.jpg','ข้อมูลบุคลากร test_Images/44.เอกสารรับรองผ่านการอบรมหลักสูตรการสอนทางพยาบาล.034641.jpg','Active',NULL,'2026-07-05 03:44:54'),(40,65172145,'อาจารย์','ปรมัตถ์','กิจจานุกิจวัฒนา','Prmatth','Kichchanukichwathna','หญิง','1987-04-28',NULL,'0865133653','581/943 เดอะนิชไอดีพระราม 2 เฟส 2','5211209760','2027-12-20','2022-12-01',NULL,'https://drive.google.com/uc?id=1XaNNEA8x7lgMO-YblrQGRtbM8g0Wvjsr','ข้อมูลบุคลากร test_Images/40.สำเนาบัตรสมาชิกสภาการพยาบาล.013343.jpg','ข้อมูลบุคลากร test_Images/40.สำเนาใบอนุญาตประกอบวิชาชีพ.013347.jpg','ข้อมูลบุคลากร test_Images/40.เอกสารรับรองผ่านการอบรมหลักสูตรการสอนทางพยาบาล.013347.jpg','Active',NULL,'2026-07-05 03:44:54'),(50,66172146,'นางสาว','สุธาทิพย์','กัลยา','Suthathiphy','Kalya','หญิง','2000-01-22',NULL,'0893724113','921/8  ซอยเพชรเกษม 4  ถนนเพชรเกษม  แขวงวัดท่าพระ  เขตบางกอกใหญ่  กรุงเทพมหานคร 10600',NULL,NULL,'2023-05-18',NULL,'https://drive.google.com/uc?id=1pHcvF34hbZRXweT-3BgNVUmTADlkGtJP','ข้อมูลบุคลากร test_Images/50.สำเนาบัตรสมาชิกสภาการพยาบาล.115955.jpg','ข้อมูลบุคลากร test_Images/50.สำเนาใบอนุญาตประกอบวิชาชีพ.115959.jpg','ข้อมูลบุคลากร test_Images/50.เอกสารรับรองผ่านการอบรมหลักสูตรการสอนทางพยาบาล.115959.jpg','Active',NULL,'2026-07-05 03:44:55'),(12,6317212129,'อาจารย์','รัตนาภรณ์','นิวาศานนท์','Ratnaphrn','Niwasannth','หญิง','1992-03-24',NULL,'0868046982','หมู่บ้านร้อยพฤกษาเลควิว  223/169 ซอย11 หมู่ 10 ต. นครปฐม อ เมืองนครปฐม จ.นครปฐม','51811261753','2025-07-26','2019-02-01',NULL,'https://drive.google.com/uc?id=1Yb5w7soKR-wXjXupTQJbZbgtwYw73HDB','ข้อมูลบุคลากร test_Images/12.สำเนาบัตรสมาชิกสภาการพยาบาล.083524.jpg','ข้อมูลบุคลากร test_Images/12.สำเนาใบอนุญาตประกอบวิชาชีพ.083527.jpg','ข้อมูลบุคลากร test_Images/12.เอกสารรับรองผ่านการอบรมหลักสูตรการสอนทางพยาบาล.083528.jpg','Active',NULL,'2026-07-05 03:43:30');
/*!40000 ALTER TABLE `faculty` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `faculty_ce_records`
--

DROP TABLE IF EXISTS `faculty_ce_records`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `faculty_ce_records` (
  `record_id` bigint NOT NULL AUTO_INCREMENT,
  `faculty_id` bigint NOT NULL,
  `activity_name` text COMMENT 'ชื่อกิจกรรมที่ไปอบรม',
  `credits` float DEFAULT NULL COMMENT 'หน่วยกิต/ชั่วโมงที่ได้',
  `result` varchar(255) DEFAULT NULL,
  `date_attended` date DEFAULT NULL COMMENT 'วันที่ไป',
  PRIMARY KEY (`record_id`),
  KEY `faculty_id` (`faculty_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `faculty_ce_records`
--

LOCK TABLES `faculty_ce_records` WRITE;
/*!40000 ALTER TABLE `faculty_ce_records` DISABLE KEYS */;
/*!40000 ALTER TABLE `faculty_ce_records` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `faculty_research`
--

DROP TABLE IF EXISTS `faculty_research`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `faculty_research` (
  `research_id` bigint NOT NULL AUTO_INCREMENT,
  `faculty_id` bigint NOT NULL COMMENT 'เจ้าของผลงาน',
  `title` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT 'ชื่องานวิจัย',
  `publication_year` int DEFAULT NULL COMMENT 'ปีที่ตีพิมพ์',
  `category` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT 'ประเภท (วิจัยสถาบัน, วิจัยชุมชน)',
  `file_path` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci COMMENT 'Path ไฟล์ PDF',
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`research_id`),
  KEY `faculty_id` (`faculty_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `faculty_research`
--

LOCK TABLES `faculty_research` WRITE;
/*!40000 ALTER TABLE `faculty_research` DISABLE KEYS */;
/*!40000 ALTER TABLE `faculty_research` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `grade_change_requests`
--

DROP TABLE IF EXISTS `grade_change_requests`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `grade_change_requests` (
  `grade_change_request_id` bigint NOT NULL AUTO_INCREMENT,
  `approval_request_id` bigint NOT NULL,
  `student_id` varchar(50) NOT NULL,
  `subject_code` varchar(50) NOT NULL,
  `current_grade` varchar(10) DEFAULT NULL,
  `requested_grade` varchar(10) DEFAULT NULL,
  `reason` text,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`grade_change_request_id`),
  UNIQUE KEY `uq_grade_change_approval` (`approval_request_id`),
  KEY `idx_grade_change_student` (`student_id`),
  KEY `idx_grade_change_subject` (`subject_code`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `grade_change_requests`
--

LOCK TABLES `grade_change_requests` WRITE;
/*!40000 ALTER TABLE `grade_change_requests` DISABLE KEYS */;
INSERT INTO `grade_change_requests` VALUES (1,1,'64010001','NUR101','B+','A','ขอแก้ไขเกรดนักศึกษา 64010001 วิชา NUR101','2026-06-19 23:00:33'),(2,5,'63010005','NUR401','C','B','ขอแก้ไขเกรดนักศึกษา 63010005 วิชา NUR401','2026-06-19 23:00:33');
/*!40000 ALTER TABLE `grade_change_requests` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `grades`
--

DROP TABLE IF EXISTS `grades`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `grades` (
  `grade_id` bigint NOT NULL AUTO_INCREMENT,
  `student_id` bigint NOT NULL COMMENT 'รหัสนักศึกษา (เชื่อมกับตาราง student)',
  `subject_id` int NOT NULL COMMENT 'รหัสวิชาหลักหลังบ้าน (เชื่อมกับตาราง subjects)',
  `grade_letter` varchar(5) NOT NULL COMMENT 'เกรดตัวอักษร เช่น A, B+, B, C+, C, D+, D, F',
  `grade_point` decimal(3,2) NOT NULL COMMENT 'แต้มคะแนนประจำเกรด เช่น 4.00, 3.50, 3.00, 2.00',
  `semester` varchar(10) NOT NULL COMMENT 'ภาคเรียน เช่น 1, 2, 3',
  `year` varchar(10) NOT NULL COMMENT 'ปีการศึกษา เช่น 2567, 2568',
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`grade_id`),
  KEY `fk_grades_subject` (`subject_id`),
  KEY `fk_grades_student` (`student_id`),
  CONSTRAINT `fk_grades_student` FOREIGN KEY (`student_id`) REFERENCES `student` (`student_id`) ON DELETE CASCADE ON UPDATE RESTRICT,
  CONSTRAINT `fk_grades_subject` FOREIGN KEY (`subject_id`) REFERENCES `subject` (`subject_id`) ON DELETE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `grades`
--

LOCK TABLES `grades` WRITE;
/*!40000 ALTER TABLE `grades` DISABLE KEYS */;
INSERT INTO `grades` VALUES (1,6603400001,1,'A',4.00,'1','2567','2026-05-26 19:27:32','2026-05-26 19:27:32'),(2,6603400001,2,'B+',3.50,'1','2567','2026-05-26 19:27:32','2026-05-26 19:27:32'),(3,6603400001,3,'B',3.00,'2','2567','2026-05-26 19:27:32','2026-05-26 19:27:32'),(4,6603400001,4,'C+',2.50,'2','2567','2026-05-26 19:27:32','2026-05-26 19:27:32');
/*!40000 ALTER TABLE `grades` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `import_history`
--

DROP TABLE IF EXISTS `import_history`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `import_history` (
  `id` bigint NOT NULL AUTO_INCREMENT,
  `user_id` bigint NOT NULL COMMENT 'ผู้ที่ทำรายการ',
  `type` varchar(50) NOT NULL COMMENT 'ประเภท (students, teachers, etc.)',
  `file_name` varchar(255) NOT NULL,
  `record_count` int DEFAULT '0' COMMENT 'จำนวนแถวที่นำเข้าสำเร็จ',
  `status` enum('success','failed','partial','processing') DEFAULT 'processing',
  `error_details` text COMMENT 'เก็บ JSON หรือรายละเอียดแถวที่ผิดพลาด',
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `import_history`
--

LOCK TABLES `import_history` WRITE;
/*!40000 ALTER TABLE `import_history` DISABLE KEYS */;
INSERT INTO `import_history` VALUES (1,5,'teachers','ข้อมูลอาจารย์ 2568_คณะพยาบาล มหาวิทยาลัยสยามเเก้ (csv)(test).csv',43,'success',NULL,'2026-02-27 12:38:02'),(2,5,'students','student_performance.csv',0,'success',NULL,'2026-06-23 21:39:12'),(3,5,'teachers','student_performance.csv',0,'success',NULL,'2026-06-23 21:57:43'),(4,5,'courses','สรุปงบแผนคณะพยาบาลศาสตร์ ปี 2566.xlsx',0,'failed','SQLSTATE[HY000]: General error: 1366 Incorrect integer value: \'\\xE0\\xB8\\x84\\xE0\\xB8\\x93\\xE0\\xB8\\xB0\\xE0\\xB8\\x9E\\xE0\\xB8\\xA2\\xE0\\xB8\\xB2\\xE0\\xB8\\x9A\\xE0\\xB8\\xB2\\xE0\\xB8\\xA5\\xE0\\xB8\\xA8\\xE0\\xB8\' for column \'faculty_id\' at row 1','2026-06-23 21:59:10'),(5,5,'teachers','สรุปงบแผนคณะพยาบาลศาสตร์ ปี 2566.xlsx',0,'failed','SQLSTATE[HY000]: General error: 1366 Incorrect integer value: \'\\xE0\\xB8\\x84\\xE0\\xB8\\x93\\xE0\\xB8\\xB0\\xE0\\xB8\\x9E\\xE0\\xB8\\xA2\\xE0\\xB8\\xB2\\xE0\\xB8\\x9A\\xE0\\xB8\\xB2\\xE0\\xB8\\xA5\\xE0\\xB8\\xA8\\xE0\\xB8\' for column \'faculty_id\' at row 1','2026-06-23 21:59:49'),(6,5,'projects','สรุปงบแผนคณะพยาบาลศาสตร์ ปี 2566.xlsx',0,'failed','SQLSTATE[42S22]: Column not found: 1054 Unknown column \'project_code\' in \'field list\'','2026-06-23 22:07:12');
/*!40000 ALTER TABLE `import_history` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `notifications`
--

DROP TABLE IF EXISTS `notifications`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `notifications` (
  `notification_id` bigint NOT NULL AUTO_INCREMENT,
  `user_id` bigint NOT NULL COMMENT 'แจ้งเตือนถึงใคร (FK users)',
  `sender_user_id` bigint DEFAULT NULL COMMENT 'sender user (FK users)',
  `title` varchar(255) NOT NULL COMMENT 'หัวข้อแจ้งเตือน',
  `message` text COMMENT 'เนื้อหา',
  `type` enum('info','warning','success','request') DEFAULT 'info' COMMENT 'ประเภทสี (ตรงกับ Frontend)',
  `channel` enum('in-app','email','both') DEFAULT 'in-app' COMMENT 'ช่องทางการส่ง',
  `is_read` tinyint(1) DEFAULT '0' COMMENT '0=ยังไม่รุ้, 1=อ่านแล้ว',
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`notification_id`),
  KEY `user_id` (`user_id`),
  KEY `sender_user_id` (`sender_user_id`),
  CONSTRAINT `notification_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`user_id`) ON DELETE CASCADE ON UPDATE RESTRICT,
  CONSTRAINT `notification_ibfk_2` FOREIGN KEY (`sender_user_id`) REFERENCES `users` (`user_id`) ON DELETE SET NULL ON UPDATE RESTRICT
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `notifications`
--

LOCK TABLES `notifications` WRITE;
/*!40000 ALTER TABLE `notifications` DISABLE KEYS */;
/*!40000 ALTER TABLE `notifications` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `permissions`
--

DROP TABLE IF EXISTS `permissions`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `permissions` (
  `permission_id` bigint NOT NULL AUTO_INCREMENT,
  `permission_name` varchar(100) NOT NULL COMMENT 'ชื่อสิทธิ์อ้างอิงใน Code (ห้ามซ้ำ)',
  `module_group` varchar(50) DEFAULT NULL COMMENT 'กลุ่มของฟังก์ชัน',
  `description_th` text COMMENT 'คำอธิบายสิทธิ์ภาษาไทย',
  PRIMARY KEY (`permission_id`),
  UNIQUE KEY `permission_name` (`permission_name`)
) ENGINE=InnoDB AUTO_INCREMENT=37 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `permissions`
--

LOCK TABLES `permissions` WRITE;
/*!40000 ALTER TABLE `permissions` DISABLE KEYS */;
INSERT INTO `permissions` VALUES (1,'PROFILE_VIEW_SELF','General','ดูข้อมูลส่วนตัวของตนเอง (อาจารย์ทุกคน)'),(2,'PROFILE_VIEW_ALL','General','ดูข้อมูลส่วนตัวของบุคลากรคนอื่นทั้งหมด (คณบดี)'),(3,'NOTIFICATION_VIEW','General','รับและดูการแจ้งเตือนระบบ'),(4,'SYSTEM_SETTINGS','General','เข้าถึงและตั้งค่าการใช้งานระบบ'),(5,'VIEW_DEAN_DASHBOARD','Executive','ดู Dashboard ภาพรวม KPI สัดส่วนอาจารย์และนักศึกษาคงอยู่'),(6,'FINANCIAL_VIEW','Executive','ดูรายงานการเงินและผลสรุประดับบริหาร (พันธกิจโครงการ)'),(7,'DEAN_NOTIFICATION','Executive','รับการแจ้งเตือนการส่งรายงานระดับคณะ'),(8,'STUDENT_VIEW_COURSE','Academic','ดูรายชื่อนักศึกษาในรายวิชาที่ตนเองเป็นผู้สอน'),(9,'STUDENT_EXPORT_COURSE','Academic','ส่งออกรายชื่อนักศึกษาในรายวิชาที่ตนเองสอน'),(10,'COURSE_REPORT_VIEW','Academic','ดูรายงานผลลัพธ์การเรียนรู้ PLO/YLO ในรายวิชาที่สอน'),(11,'RESEARCH_UPLOAD','Academic','อัปโหลดเอกสารรายวิชาต่างๆ (มคอ.3 / มคอ.5)'),(12,'ADVISOR_STUDENT_VIEW','Advisor','ดูข้อมูลและประวัตินักศึกษาในความดูแล 1:12'),(13,'ADVISOR_ASSIGN_REQUEST','Advisor','ส่งคำร้องขอรับมอบสิทธิ์การดูแลนักศึกษาเพิ่มเติม'),(14,'PROJECT_VIEW','Project','ดูข้อมูลโครงการที่ตนเองเป็นผู้ดูแลรับผิดชอบ'),(15,'RESEARCH_UPLOAD_PROJECT','Project','อัปโหลดเอกสารที่เกี่ยวข้องกับโครงการ'),(16,'PROJECT_LINK_LO','Project','ระบุการเชื่อมโยงโครงงานกับระดับ PLO, YLO, CLO'),(17,'GRADE_MANAGE','Curriculum','กำหนดและแก้ไขเกรดของนักศึกษาตามระดับ CLO'),(18,'CLO_MANAGE','Curriculum','กำหนดและแก้ไขผลลัพธ์การเรียนรู้ระดับรายวิชา (CLO)'),(19,'COURSE_REPORT_MANAGE','Curriculum','สร้างและประมวลผลรายงานรายวิชา'),(20,'CURRICULUM_REPORT_VIEW','Curriculum','ดูรายงานผลสัมฤทธิ์ PLO/YLO/CLO ทุกชั้นปี'),(21,'CLO_MAP_EDIT','Curriculum','แก้ไขแผนที่ความเชื่อมโยงหลักสูตร (CLO Map)'),(22,'COURSE_REPORT_EXPORT','Curriculum','ส่งออกข้อมูลและรายงานผลสรุปรายวิชาสะสม 5 ปี'),(23,'CLINICAL_STUDENT_VIEW','Clinical','ดูข้อมูลนักศึกษาปฏิบัติการพยาบาลภาคปฏิบัติ 1:8'),(24,'CLINICAL_EVIDENCE_UPLOAD','Clinical','แนบไฟล์และหลักฐานการปฏิบัติงานตรวจเคสของนักศึกษา'),(25,'USER_ROLE_MANAGE','Admin','จัดการผู้ใช้งาน มอบหรือถอดถอนตำแหน่ง/สิทธิ์ในคณะ (CRUD)'),(26,'DATA_IMPORT_EXPORT','Admin','นำเข้าและส่งออกข้อมูลเชิงระบบเข้าสู่ฐานข้อมูลหลัก'),(27,'ADMIN_APPROVALS','Admin','ตรวจสอบและกดอนุมัติคำขอสิทธิ์การดูแลต่างๆ ย้อนหลัง'),(28,'AUDIT_LOG_VIEW','Admin','ดูบันทึกและประวัติกิจกรรมการใช้งานระบบ (Audit Log)'),(29,'ADMIN_REPORTS','Admin','สร้างรายงานเชิงสรุปข้อมูลเสนอผู้บริหาร'),(30,'ASSIGN_INSTRUCTORS','Curriculum','มอบหมายรายชื่ออาจารย์ผู้สอนหลักในแต่ละรายวิชา'),(31,'PROJECT_MY_VIEW','Project','ดูรายการโครงการย่อยที่ตนเองรับผิดชอบ'),(32,'PROJECT_DOCS_MANAGE','Project','จัดการอัปโหลดเอกสารภายในโครงการ'),(33,'PROJECT_LINKS_MANAGE','Project','จัดการข้อมูลลิงก์และความเชื่อมโยงระดับ LO'),(34,'PROJECT_REPORTS_VIEW','Project','เข้าถึงและเรียกดูรายงานสรุปผลโครงการ'),(35,'VIEW_RETENTION','Executive','ดูอัตราการคงอยู่และสาเหตุการออกของนักศึกษา'),(36,'STUDENT_VIEW_TRANSCRIPT',NULL,'นักศึกษาดูข้อมูลของตัวเอง');
/*!40000 ALTER TABLE `permissions` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `plo`
--

DROP TABLE IF EXISTS `plo`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `plo` (
  `plo_id` bigint NOT NULL AUTO_INCREMENT,
  `program_id` bigint NOT NULL COMMENT 'เป็น PLO ของหลักสูตรไหน',
  `plo_no` varchar(50) DEFAULT NULL COMMENT 'เลขข้อ PLO เช่น 1.1, 2.1',
  `description` text COMMENT 'รายละเอียด PLO',
  `sub_ploid` int DEFAULT NULL,
  PRIMARY KEY (`plo_id`),
  KEY `program_id` (`program_id`),
  CONSTRAINT `plo_ibfk_1` FOREIGN KEY (`program_id`) REFERENCES `program` (`program_id`) ON DELETE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=9 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `plo`
--

LOCK TABLES `plo` WRITE;
/*!40000 ALTER TABLE `plo` DISABLE KEYS */;
INSERT INTO `plo` VALUES (1,1,NULL,'ประยุกต์ความรู้และสาระสําคัญของศาสตร์ทางวิชาชีพการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแลบุคคลที่สุขภาพดี เจ็บป่วย และวิกฤต แบบองค์รวมทุกช่วงวัย',103),(2,1,NULL,'ปฏิบัติการพยาบาลและการผดุงครรภ์อย่างเป็นองค์รวมในการดูแลบุคคลที่สุขภาพดี เจ็บป่วย และวิกฤต แบบองค์รวมทุกช่วงวัยเพื่อความปลอดภัยของผู้รับบริการ',203),(3,1,NULL,'พัฒนานวัตกรรมทางสุขภาพโดยประยุกต์กระบวนการวิจัยและเทคโนโลยีสารสนเทศทางการพยาบาลได้อย่างเหมาะสม',302),(4,1,NULL,'ประยุกต์ใช้ดิจิทัลในการจัดการพยาบาลได้อย่างเหมาะสม',401),(5,1,NULL,'สื่อสารด้วยภาษาไทยและภาษาอังกฤษได้อย่างมีประสิทธิภาพ',502),(6,1,NULL,'แสดงออกถึงการมีจริยธรรมและทัศนคติที่ดีต่อวิชาชีพ มีจิตสาธารณะ และมีพฤติกรรมบริการ ที่เป็นที่ยอมรับ',603),(7,1,NULL,'แสดงออกถึงการเรียนรู้ด้วยตนเองอย่างต่อเนื่อง',702),(8,1,NULL,'เข้าใจหลักการ การดำเนินการ การเป็นผู้ประกอบการที่เกี่ยวกับการพยาบาลและการผดุงครรภ์ได้',803);
/*!40000 ALTER TABLE `plo` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `portfolio`
--

DROP TABLE IF EXISTS `portfolio`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `portfolio` (
  `portfolio_id` bigint NOT NULL AUTO_INCREMENT,
  `student_id` bigint NOT NULL,
  `file_path` varchar(255) DEFAULT NULL COMMENT 'ที่อยู่ไฟล์ (Path) บน Server หรือ Cloud',
  PRIMARY KEY (`portfolio_id`),
  KEY `student_id` (`student_id`),
  CONSTRAINT `portfolio_ibfk_1` FOREIGN KEY (`student_id`) REFERENCES `student` (`student_id`) ON DELETE RESTRICT ON UPDATE RESTRICT
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `portfolio`
--

LOCK TABLES `portfolio` WRITE;
/*!40000 ALTER TABLE `portfolio` DISABLE KEYS */;
/*!40000 ALTER TABLE `portfolio` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `position`
--

DROP TABLE IF EXISTS `position`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `position` (
  `position_id` bigint NOT NULL AUTO_INCREMENT,
  `position_name` varchar(100) NOT NULL COMMENT 'ชื่อตำแหน่ง',
  PRIMARY KEY (`position_id`)
) ENGINE=InnoDB AUTO_INCREMENT=45 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `position`
--

LOCK TABLES `position` WRITE;
/*!40000 ALTER TABLE `position` DISABLE KEYS */;
INSERT INTO `position` VALUES (1,'คณบดี'),(2,'อาจารย์ประจำ/อาจารย์ประจำหลักสูตร'),(3,'อาจารย์ที่ปรึกษา'),(4,'อาจารย์ปฏิบัติ'),(5,'อาจารย์ผู้รับผิดชอบหลักสูตร'),(6,'อาจารย์ผู้รับผิดชอบโครงการ'),(7,'เลขา'),(8,'นักศึกษา');
/*!40000 ALTER TABLE `position` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `position_permission`
--

DROP TABLE IF EXISTS `position_permission`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `position_permission` (
  `position_id` bigint NOT NULL,
  `permission_id` bigint NOT NULL,
  PRIMARY KEY (`position_id`,`permission_id`),
  KEY `permission_id` (`permission_id`),
  CONSTRAINT `position_permission_ibfk_1` FOREIGN KEY (`position_id`) REFERENCES `position` (`position_id`) ON DELETE CASCADE,
  CONSTRAINT `position_permission_ibfk_2` FOREIGN KEY (`permission_id`) REFERENCES `permissions` (`permission_id`) ON DELETE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `position_permission`
--

LOCK TABLES `position_permission` WRITE;
/*!40000 ALTER TABLE `position_permission` DISABLE KEYS */;
INSERT INTO `position_permission` VALUES (1,1),(2,1),(3,1),(4,1),(5,1),(6,1),(7,1),(8,1),(1,2),(1,3),(2,3),(3,3),(4,3),(5,3),(6,3),(7,3),(8,3),(1,4),(2,4),(3,4),(4,4),(5,4),(6,4),(7,4),(8,4),(1,5),(1,6),(1,7),(2,8),(2,9),(2,10),(2,11),(3,12),(3,13),(1,14),(6,14),(5,17),(5,18),(5,19),(5,20),(5,21),(5,22),(4,23),(4,24),(7,25),(7,26),(7,27),(7,28),(7,29),(7,30),(6,32),(6,33),(1,34),(6,34),(8,36);
/*!40000 ALTER TABLE `position_permission` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `program`
--

DROP TABLE IF EXISTS `program`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `program` (
  `program_id` bigint NOT NULL AUTO_INCREMENT,
  `program_code` varchar(50) NOT NULL COMMENT 'รหัสหลักสูตร',
  `name_th` varchar(255) DEFAULT NULL COMMENT 'ชื่อหลักสูตรภาษาไทย',
  `name_en` varchar(255) DEFAULT NULL COMMENT 'ชื่อหลักสูตรภาษาอังกฤษ',
  `academic_year` int DEFAULT NULL COMMENT 'ปีการศึกษาที่เริ่มใช้หลักสูตร',
  `total_credits` int DEFAULT NULL COMMENT 'หน่วยกิตรวมตลอดหลักสูตร',
  PRIMARY KEY (`program_id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `program`
--

LOCK TABLES `program` WRITE;
/*!40000 ALTER TABLE `program` DISABLE KEYS */;
INSERT INTO `program` VALUES (1,'25491800000000.0','หลักสูตรพยาบาลศาสตรบัณฑิต','Bachelor of Nursing Science Program',2567,NULL);
/*!40000 ALTER TABLE `program` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `project`
--

DROP TABLE IF EXISTS `project`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `project` (
  `project_id` bigint NOT NULL AUTO_INCREMENT,
  `project_name_th` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `project_name_en` varchar(255) DEFAULT NULL,
  `description` text,
  `mapping_json` json DEFAULT NULL,
  `responsible_faculty_id` bigint DEFAULT NULL COMMENT 'อาจารย์ผู้รับผิดชอบโครงการ',
  `academic_year` int DEFAULT NULL,
  PRIMARY KEY (`project_id`),
  KEY `responsible_faculty_id` (`responsible_faculty_id`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `project`
--

LOCK TABLES `project` WRITE;
/*!40000 ALTER TABLE `project` DISABLE KEYS */;
INSERT INTO `project` VALUES (1,'โครงการ A','Project A','ไม่มี ไม่รู้ ไม่อยากทำงาน','{\"meta\": {\"type\": \"บริการวิชาการ\", \"status\": \"active\", \"members\": 8, \"deadline\": \"2568-03-31\", \"progress\": 65}, \"links\": {\"clos\": [\"CLO1\"], \"plos\": [\"PLO1\", \"PLO2\"], \"ylos\": [\"YLO1\"]}}',63172133,2567),(2,'67','67 tung tung','Autistic000000',NULL,NULL,NULL),(3,'โครงการอบรมเชิงปฏิบัติการการพยาบาลชุมชน','Community Nursing Workshop','อบรมเชิงปฏิบัติการด้านการพยาบาลชุมชนสำหรับนักศึกษาชั้นปีที่ 3','{\"meta\": {\"type\": \"ทำนุบำรุงศิลปวัฒนธรรม\", \"status\": \"pending\", \"members\": 5, \"deadline\": \"2568-06-30\", \"progress\": 20}}',63172133,2567);
/*!40000 ALTER TABLE `project` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `project_approval_requests`
--

DROP TABLE IF EXISTS `project_approval_requests`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `project_approval_requests` (
  `project_approval_request_id` bigint NOT NULL AUTO_INCREMENT,
  `approval_request_id` bigint NOT NULL,
  `project_id` bigint DEFAULT NULL,
  `project_name` varchar(255) NOT NULL,
  `academic_year` int DEFAULT NULL,
  `budget_requested` decimal(15,2) DEFAULT NULL,
  `reason` text,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`project_approval_request_id`),
  UNIQUE KEY `uq_project_approval` (`approval_request_id`),
  KEY `idx_project_approval_project` (`project_id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `project_approval_requests`
--

LOCK TABLES `project_approval_requests` WRITE;
/*!40000 ALTER TABLE `project_approval_requests` DISABLE KEYS */;
INSERT INTO `project_approval_requests` VALUES (1,3,NULL,'การพัฒนาทักษะการพยาบาล',2568,50000.00,'ขอเปิดโครงการวิจัย: การพัฒนาทักษะการพยาบาล','2026-06-19 23:00:33');
/*!40000 ALTER TABLE `project_approval_requests` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `project_budget_years`
--

DROP TABLE IF EXISTS `project_budget_years`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `project_budget_years` (
  `project_budget_years_id` bigint NOT NULL AUTO_INCREMENT,
  `project_id` bigint NOT NULL COMMENT 'ของโครงการไหน',
  `fiscal_year` int DEFAULT NULL COMMENT 'ปีงบประมาณ',
  `budget_allocated` decimal(15,2) DEFAULT NULL COMMENT 'งบที่ได้รับจัดสรร',
  `budget_spent` decimal(15,2) DEFAULT NULL COMMENT 'งบที่ใช้จริง',
  `result` varchar(255) DEFAULT NULL COMMENT 'ผลการดำเนินงาน',
  PRIMARY KEY (`project_budget_years_id`),
  KEY `project_id` (`project_id`),
  CONSTRAINT `project_budget_years_ibfk_1` FOREIGN KEY (`project_id`) REFERENCES `project` (`project_id`) ON DELETE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `project_budget_years`
--

LOCK TABLES `project_budget_years` WRITE;
/*!40000 ALTER TABLE `project_budget_years` DISABLE KEYS */;
INSERT INTO `project_budget_years` VALUES (1,1,2566,150000.00,120000.00,NULL),(2,1,2567,200000.00,85000.00,NULL),(3,3,2567,80000.00,25000.00,NULL);
/*!40000 ALTER TABLE `project_budget_years` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `project_participants`
--

DROP TABLE IF EXISTS `project_participants`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `project_participants` (
  `id` bigint NOT NULL AUTO_INCREMENT,
  `project_id` bigint NOT NULL COMMENT 'รหัสโครงการ',
  `student_id` bigint NOT NULL COMMENT 'รหัสนักศึกษา',
  `status` enum('Registered','Joined','Passed','Failed') CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT 'Registered' COMMENT 'สถานะการเข้าร่วม',
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`),
  KEY `project_id` (`project_id`),
  KEY `student_id` (`student_id`),
  CONSTRAINT `fk_pp_project` FOREIGN KEY (`project_id`) REFERENCES `project` (`project_id`) ON DELETE CASCADE,
  CONSTRAINT `fk_pp_student` FOREIGN KEY (`student_id`) REFERENCES `student` (`student_id`) ON DELETE CASCADE ON UPDATE RESTRICT
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `project_participants`
--

LOCK TABLES `project_participants` WRITE;
/*!40000 ALTER TABLE `project_participants` DISABLE KEYS */;
/*!40000 ALTER TABLE `project_participants` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `role`
--

DROP TABLE IF EXISTS `role`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `role` (
  `role_id` bigint NOT NULL AUTO_INCREMENT,
  `role_name` varchar(100) NOT NULL COMMENT 'ชื่อบทบาท เช่น Admin, Student',
  PRIMARY KEY (`role_id`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `role`
--

LOCK TABLES `role` WRITE;
/*!40000 ALTER TABLE `role` DISABLE KEYS */;
INSERT INTO `role` VALUES (1,'Admin'),(2,'Teacher'),(3,'Student');
/*!40000 ALTER TABLE `role` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `schedule_tasks`
--

DROP TABLE IF EXISTS `schedule_tasks`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `schedule_tasks` (
  `task_id` bigint NOT NULL AUTO_INCREMENT,
  `student_id` bigint NOT NULL,
  `task_name` varchar(255) NOT NULL,
  `description` text,
  `due_date` date NOT NULL,
  `priority` enum('low','medium','high') DEFAULT 'medium',
  `status` enum('pending','in_progress','completed','overdue') DEFAULT 'pending',
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`task_id`),
  KEY `fk_tasks_student` (`student_id`),
  CONSTRAINT `fk_tasks_student` FOREIGN KEY (`student_id`) REFERENCES `student` (`student_id`) ON DELETE CASCADE ON UPDATE RESTRICT
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `schedule_tasks`
--

LOCK TABLES `schedule_tasks` WRITE;
/*!40000 ALTER TABLE `schedule_tasks` DISABLE KEYS */;
/*!40000 ALTER TABLE `schedule_tasks` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `student`
--

DROP TABLE IF EXISTS `student`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `student` (
  `id` bigint NOT NULL AUTO_INCREMENT,
  `student_id` bigint NOT NULL,
  `student_code` varchar(20) NOT NULL,
  `user_id` bigint DEFAULT NULL COMMENT 'เชื่อม Users',
  `program_id` bigint DEFAULT NULL,
  `title` varchar(50) DEFAULT NULL,
  `first_name_th` varchar(100) DEFAULT NULL,
  `last_name_th` varchar(100) DEFAULT NULL,
  `first_name_en` varchar(100) DEFAULT NULL,
  `last_name_en` varchar(100) DEFAULT NULL,
  `nickname` varchar(50) DEFAULT NULL COMMENT 'ชื่อเล่น',
  `gender` varchar(20) DEFAULT NULL,
  `year_level` tinyint DEFAULT NULL,
  `gpa` decimal(3,2) DEFAULT NULL,
  `birth_date` date DEFAULT NULL,
  `hometown_province` varchar(100) DEFAULT NULL COMMENT 'ภูมิลำเนา จังหวัด',
  `height` decimal(5,2) DEFAULT NULL COMMENT 'ส่วนสูง (ซม.) ตอนแรกเข้า',
  `weight` decimal(5,2) DEFAULT NULL COMMENT 'น้ำหนัก (กก.) ตอนแรกเข้า',
  `bmi` decimal(5,2) DEFAULT NULL COMMENT 'ดัชนีมวลกาย (BMI) ตอนแรกเข้า',
  `email` varchar(100) DEFAULT NULL,
  `phone` varchar(50) DEFAULT NULL,
  `home_phone` varchar(20) DEFAULT NULL COMMENT 'โทรศัพท์บ้าน',
  `home_address` text COMMENT 'ที่อยู่ตามทะเบียนบ้าน',
  `status` varchar(50) DEFAULT NULL,
  `graduation_date` date DEFAULT NULL,
  `dropout_date` date DEFAULT NULL,
  `dropout_reason` text,
  `description` text,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `id_card_number` varchar(13) DEFAULT NULL,
  `admission_year` int NOT NULL DEFAULT '2567',
  `updated_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `skill_score` decimal(3,2) DEFAULT '0.00' COMMENT 'คะแนนทักษะ',
  `attitude_score` decimal(3,2) DEFAULT '0.00' COMMENT 'คะแนนทัศนคติ',
  `knowledge_score` decimal(3,2) DEFAULT '0.00' COMMENT 'คะแนนความรู้',
  `comm_score` decimal(3,2) DEFAULT '0.00' COMMENT 'คะแนนการสื่อสาร',
  `overall_score` decimal(3,2) DEFAULT '0.00' COMMENT 'คะแนนรวม',
  `last_eval_date` timestamp NULL DEFAULT NULL COMMENT 'วันที่ประเมินล่าสุด',
  PRIMARY KEY (`student_id`),
  UNIQUE KEY `idx_student_id_auto` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=132 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `student`
--

LOCK TABLES `student` WRITE;
/*!40000 ALTER TABLE `student` DISABLE KEYS */;
INSERT INTO `student` VALUES (1,6603400001,'TEMP-1',NULL,NULL,'นางสาว','ญาณันธร','โอนอิง',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(3,6603400002,'TEMP-2',NULL,NULL,'นางสาว','จุรีพร','ผลพรต',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(5,6603400004,'TEMP-3',NULL,NULL,'นางสาว','ศิริพรรณ','ทองอ่อน',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(6,6603400005,'TEMP-4',NULL,NULL,'นางสาว','ตะวัน','รีฮุง',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(7,6603400006,'TEMP-5',NULL,NULL,'นางสาว','บัณฑิตา','ยุดา',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(8,6603400007,'TEMP-6',NULL,NULL,'นางสาว','ประภาภรณ์','จงเจริญ',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(9,6603400008,'TEMP-7',NULL,NULL,'นางสาว','ปวีณา','ม่วงชุ่ม',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(10,6603400009,'TEMP-8',NULL,NULL,'นางสาว','ศินาภรณ์','ทองเชิด',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(11,6603400010,'TEMP-9',NULL,NULL,'นางสาว','กฤตพร','รุณรังษี',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(14,6603400011,'TEMP-10',NULL,NULL,'ว่าที่ร้อยตรีหญิง','ปวีณา','เย็นขาว',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(15,6603400012,'TEMP-11',NULL,NULL,'นางสาว','ศรุตา','พันธ์ครู',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(16,6603400013,'TEMP-12',NULL,NULL,'นางสาว','ภัคธีมา','โลหิตานนท์',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(17,6603400014,'TEMP-13',NULL,NULL,'นาย','พิพัฒน์','คุโนภาต',NULL,NULL,NULL,'male',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(22,6603400015,'TEMP-14',NULL,NULL,'นางสาว','ณัฐชา','พิณราช',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(23,6603400016,'TEMP-15',NULL,NULL,'นาย','ณัฐสิทธิ์','ปัญญาอุทัย',NULL,NULL,NULL,'male',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(24,6603400017,'TEMP-16',NULL,NULL,'นางสาว','จิราวัช','พระนา',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(25,6603400018,'TEMP-17',NULL,NULL,'นางสาว','พลอยชมพู','เรืองเดช',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(27,6603400019,'TEMP-18',NULL,NULL,'นางสาว','ฐานวดี','ปุนมาปัด',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(28,6603400020,'TEMP-19',NULL,NULL,'นางสาว','สุธาสินี','สาธุชาติ',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(29,6603400021,'TEMP-20',NULL,NULL,'นางสาว','ณัฐนันท์','ศรีม่วง',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(31,6603400022,'TEMP-21',NULL,NULL,'นางสาว','โยษิตา','จิตรีชัย',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(32,6603400023,'TEMP-22',NULL,NULL,'นางสาว','กมลทิพย์','อาลัย',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(34,6603400024,'TEMP-23',NULL,NULL,'นาย','มารุต','กรุณา',NULL,NULL,NULL,'male',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(35,6603400025,'TEMP-24',NULL,NULL,'นางสาว','ณรินทร์ดา','วงค์บุญมา',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(36,6603400026,'TEMP-25',NULL,NULL,'นางสาว','วรัญญา','บุญเชิญ',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(38,6603400027,'TEMP-26',NULL,NULL,'นางสาว','กุสุมา','สมแวง',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(39,6603400028,'TEMP-27',NULL,NULL,'นางสาว','จิรฐา','พิทักษา',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(41,6603400029,'TEMP-28',NULL,NULL,'นางสาว','วิลาลักษณ์','กล่อมใจ',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(42,6603400030,'TEMP-29',NULL,NULL,'นาย','นพเกล้า','นพพันธ์ศิริ',NULL,NULL,NULL,'male',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(43,6603400031,'TEMP-30',NULL,NULL,'นาย','ทัศนา','ขันตรี',NULL,NULL,NULL,'male',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(44,6603400032,'TEMP-31',NULL,NULL,'นางสาว','สุนันญา','มะโนเเสน',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(45,6603400033,'TEMP-32',NULL,NULL,'นางสาว','ศศิวิมล','เพ็งอุดม',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(46,6603400034,'TEMP-33',NULL,NULL,'นางสาว','ณัชชา','คุ้มคงกระจ่าง',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(48,6603400035,'TEMP-34',NULL,NULL,'นางสาว','สุปรียา','ศรีละบุตร',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(49,6603400036,'TEMP-35',NULL,NULL,'นางสาว','ศุภิกา','สว่างภพ',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(55,6603400037,'TEMP-36',NULL,NULL,'นางสาว','อรอมล','คุณสมบัติ',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(66,6603400038,'TEMP-37',NULL,NULL,'นางสาว','ปรียานุช','ผ่านละคร',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(67,6603400039,'TEMP-38',NULL,NULL,'นางสาว','ปาริสชา','ดอกพุดตาน',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(70,6603400040,'TEMP-39',NULL,NULL,'นางสาว','นภัสนันท์','ดีประชีพ',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(71,6603400041,'TEMP-40',NULL,NULL,'นางสาว','ชลดา','อุคำ',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(72,6603400042,'TEMP-41',NULL,NULL,'นางสาว','อริสา','บุญแยง',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(73,6603400044,'TEMP-42',NULL,NULL,'นางสาว','เพ็ญพิชชา','รามศิริ',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(78,6603400046,'TEMP-43',NULL,NULL,'นางสาว','นริศรา','ไทยอุดม',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(85,6603400047,'TEMP-44',NULL,NULL,'นาย','รัชวัฒน์','สุรภีร์',NULL,NULL,NULL,'male',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(86,6603400048,'TEMP-45',NULL,NULL,'นางสาว','ขนิษฐา','มุธุสิทธิ์',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(87,6603400049,'TEMP-46',NULL,NULL,'นางสาว','วนิชชา','นาสานนิวัฒน์',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(88,6603400050,'TEMP-47',NULL,NULL,'นางสาว','ดวงหทัย','บัวกล้า',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(89,6603400051,'TEMP-48',NULL,NULL,'นางสาว','ปาริชาต','เชื้อตาอ่อน',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(90,6603400052,'TEMP-49',NULL,NULL,'นางสาว','จิราวรรณ','พุก',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(92,6603400053,'TEMP-50',NULL,NULL,'นางสาว','อรนุช','เลี่ยนเพชร',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(93,6603400054,'TEMP-51',NULL,NULL,'นางสาว','วราภรณ์','พุ่มแย้ม',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(94,6603400055,'TEMP-52',NULL,NULL,'นางสาว','ธิดาพร','พิกุลทอง',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(95,6603400056,'TEMP-53',NULL,NULL,'นางสาว','ณัฐพร','พุ่มไสว',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(97,6603400057,'TEMP-54',NULL,NULL,'นางสาว','ศุภัชญา','โพธิ์ทอง',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(98,6603400058,'TEMP-55',NULL,NULL,'นางสาว','สุกัญญา','ช่องงาม',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(104,6603400061,'TEMP-56',NULL,NULL,'นางสาว','วิภาดา','คิดดี',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(105,6603400062,'TEMP-57',NULL,NULL,'นาย','ธนากร','โฆษิวากาญจน์',NULL,NULL,NULL,'male',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(107,6603400063,'TEMP-58',NULL,NULL,'นางสาว','ชุติมา','หาทรัพย์',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(108,6603400064,'TEMP-59',NULL,NULL,'นางสาว','ฐิติรัตน์','เหล่าสูง',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(109,6603400065,'TEMP-60',NULL,NULL,'นางสาว','ฌานิศา','บุญพุฒ',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(110,6603400066,'TEMP-61',NULL,NULL,'นางสาว','สิริญญา','คำชั่ง',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(2,6603400067,'TEMP-62',NULL,NULL,'นางสาว','ดวงรัตน์','ครุฑธา',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(4,6603400068,'TEMP-63',NULL,NULL,'นางสาว','ณฐินี','สายจันทร์',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(12,6603400069,'TEMP-64',NULL,NULL,'นางสาว','กัญชพร','สายแปง',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(13,6603400070,'TEMP-65',NULL,NULL,'นางสาว','นฤมล','อ่อนทอง',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(18,6603400071,'TEMP-66',NULL,NULL,'นางสาว','นฤมล','ทำลา',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(19,6603400072,'TEMP-67',NULL,NULL,'นางสาว','สุชญา','ทองเนื้อแปด',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(20,6603400073,'TEMP-68',NULL,NULL,'นางสาว','ศิรประภา','เมาตะยา',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(21,6603400074,'TEMP-69',NULL,NULL,'นางสาว','พลอยชมพู','สุยังกูล',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(26,6603400075,'TEMP-70',NULL,NULL,'นาย','จตุรวิทย์','สาแก้ว',NULL,NULL,NULL,'male',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(30,6603400076,'TEMP-71',NULL,NULL,'นางสาว','พิลาสินี','จิตต์อุทัศน์',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(33,6603400077,'TEMP-72',NULL,NULL,'นางสาว','ธัญณิชา','ท่วมไธสง',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(37,6603400078,'TEMP-73',NULL,NULL,'นางสาว','พิยดา','ม่วงสุข',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(40,6603400079,'TEMP-74',NULL,NULL,'นางสาว','น้ำมนต์','พงษ์บุบผา',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(47,6603400080,'TEMP-75',NULL,NULL,'นางสาว','ณัฏฐณิชา','ภูมิกระโทก',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(50,6603400081,'TEMP-76',NULL,NULL,'นางสาว','เพ็ญนภา','ชฎาแก้ว',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(51,6603400082,'TEMP-77',NULL,NULL,'นางสาว','ณิชาพัฒน์','จำบุญ',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(52,6603400083,'TEMP-78',NULL,NULL,'นางสาว','ศุกลภัทร','สุพรรณ์คำ',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(53,6603400084,'TEMP-79',NULL,NULL,'นาย','ศตพล','เกษแก้ว',NULL,NULL,NULL,'male',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(54,6603400085,'TEMP-80',NULL,NULL,'นางสาว','ดวงพร','อาศัยนา',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(56,6603400086,'TEMP-81',NULL,NULL,'นางสาว','ญาณิน','ทินกระโทก',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(57,6603400087,'TEMP-82',NULL,NULL,'นางสาว','ปพิชญา','พัวอุดมจินดากุล',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(58,6603400088,'TEMP-83',NULL,NULL,'นางสาว','สาธิตา','ปลอดโปร่ง',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(59,6603400090,'TEMP-84',NULL,NULL,'นางสาว','ภัททิยา','บงภูเขียว',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(60,6603400091,'TEMP-85',NULL,NULL,'นางสาว','ภัทรานิษฐ์','แก้ววิชัย',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(61,6603400092,'TEMP-86',NULL,NULL,'นางสาว','ไปรยา','แสนแก้ว',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(62,6603400093,'TEMP-87',NULL,NULL,'นางสาว','อนุธิดา','คำบุตรดี',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(63,6603400094,'TEMP-88',NULL,NULL,'นางสาว','ปาลิดา','กล่อมฤกษ์',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(64,6603400095,'TEMP-89',NULL,NULL,'นางสาว','วรรณพร','อะโนมา',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(65,6603400096,'TEMP-90',NULL,NULL,'นางสาว','สุธาสินี','โคกวิไล',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(68,6603400097,'TEMP-91',NULL,NULL,'นางสาว','อรวรรณ','พาบุ',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(69,6603400098,'TEMP-92',NULL,NULL,'นางสาว','สิริพรรณ','บุญช่วย',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(74,6603400099,'TEMP-93',NULL,NULL,'นางสาว','กฤตยา','ปะสาวะเท',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(75,6603400100,'TEMP-94',NULL,NULL,'นางสาว','นฤมล','สรรพโภชน์',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(76,6603400102,'TEMP-95',NULL,NULL,'นางสาว','วรัญญา','มีประเสริฐ',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(77,6603400104,'TEMP-96',NULL,NULL,'นางสาว','นันทน์ณัฏฐ์','แซ่โซ้ง',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(79,6603400105,'TEMP-97',NULL,NULL,'นางสาว','รวิมล','ดวงคำจันทร์',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(80,6603400106,'TEMP-98',NULL,NULL,'นางสาว','กาญจนา','ทะวาแสน',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(81,6603400107,'TEMP-99',NULL,NULL,'นางสาว','จิรวรรณ','พลชู',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(82,6603400108,'TEMP-100',NULL,NULL,'นางสาว','นภสร','อินภูวา',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(83,6603400109,'TEMP-101',NULL,NULL,'นางสาว','รุ่งนภา','ถวิลเดช',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(84,6603400110,'TEMP-102',NULL,NULL,'นางสาว','วรัทยา','คำน้อย',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(91,6603400111,'TEMP-103',NULL,NULL,'นางสาว','สุกัญญา','พรประไพ',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(96,6603400112,'TEMP-104',NULL,NULL,'นางสาว','โชษิตา','แม้นอินทร์',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(99,6603400113,'TEMP-105',NULL,NULL,'นางสาว','สุภัชชา','งามเลิศ',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(100,6603400114,'TEMP-106',NULL,NULL,'นางสาว','นฤมล','ขอดทอง',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(101,6603400115,'TEMP-107',NULL,NULL,'นางสาว','พรพิมล','สังสีราช',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(102,6603400116,'TEMP-108',NULL,NULL,'นางสาว','เปรมิกา','โพธิ์ชัย',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(103,6603400117,'TEMP-109',NULL,NULL,'นางสาว','นิลุบล','นนท์ลุ่น',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(106,6603400118,'TEMP-110',NULL,NULL,'นางสาว','นภารัตน์','ปุรัมภะ',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(111,6603400119,'TEMP-111',NULL,NULL,'นางสาว','ธีมาพร','สุนทร',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(112,6603400120,'TEMP-112',NULL,NULL,'นางสาว','ณัฐชา','ภูสีดวง',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(113,6603400121,'TEMP-113',NULL,NULL,'นางสาว','ปวริศา','บุตรตะวงค์',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(114,6603400122,'TEMP-114',NULL,NULL,'นางสาว','นฤมล','ขุนภักดี',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(115,6603400123,'TEMP-115',NULL,NULL,'นางสาว','กัญญาณัฐ','อินต๊ะสาร',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(116,6603400124,'TEMP-116',NULL,NULL,'นางสาว','จิดาภา','ไชยสาร',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(117,6603400125,'TEMP-117',NULL,NULL,'นางสาว','จิดาภา','เชื้อทอง',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(118,6603400126,'TEMP-118',NULL,NULL,'นางสาว','นิภาวรรณ','สืบทายาท',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(119,6603400127,'TEMP-119',NULL,NULL,'นางสาว','นริศรา','จวงกระโทก',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(120,6603400128,'TEMP-120',NULL,NULL,'นาย','ภาธร','ธงศรี',NULL,NULL,NULL,'male',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(121,6603400129,'TEMP-121',NULL,NULL,'นาย','ประภวิษณุ์','พรหมบุตร',NULL,NULL,NULL,'male',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(122,6603400130,'TEMP-122',NULL,NULL,'นางสาว','ดวงแข','สลับแสง',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(123,6603400132,'TEMP-123',NULL,NULL,'นางสาว','ศิริญญา','สุภาพ',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(124,6603400133,'TEMP-124',NULL,NULL,'นางสาว','ภคมน','เชื้อคำเพ็ง',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(125,6603400134,'TEMP-125',NULL,NULL,'นางสาว','กรนันท์','นันทเสน',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(126,6603400135,'TEMP-126',NULL,NULL,'นางสาว','ปรีณาพรรณ','ภานุวัฒนวงศ์',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(127,6603400136,'TEMP-127',NULL,NULL,'นางสาว','หทัยรัตน์','ชุมจันทร์',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(128,6603400137,'TEMP-128',NULL,NULL,'นางสาว','ชมพูนุช','ลาพรม',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(129,6603400138,'TEMP-129',NULL,NULL,'นางสาว','ฐิติณัชชา','ลาดแก้ว',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(130,6603400139,'TEMP-130',NULL,NULL,'นางสาว','โสภิตา','แสวงกิจ',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL),(131,6603400140,'TEMP-131',NULL,NULL,'นางสาว','ศรีวิกา','โรจน์เจริญชัย',NULL,NULL,NULL,'female',1,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,2567,'2026-02-22 22:30:46',0.00,0.00,0.00,0.00,0.00,NULL);
/*!40000 ALTER TABLE `student` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `student_advisor_mapping`
--

DROP TABLE IF EXISTS `student_advisor_mapping`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `student_advisor_mapping` (
  `mapping_id` bigint NOT NULL AUTO_INCREMENT,
  `student_id` bigint NOT NULL,
  `faculty_id` bigint NOT NULL COMMENT 'อาจารย์ที่ปรึกษา',
  `advisor_type` varchar(50) DEFAULT NULL COMMENT 'ประเภท (ที่ปรึกษาหลัก/ร่วม)',
  `academic_year` int DEFAULT NULL,
  PRIMARY KEY (`mapping_id`),
  KEY `student_id` (`student_id`),
  KEY `faculty_id` (`faculty_id`),
  CONSTRAINT `student_advisor_mapping_ibfk_1` FOREIGN KEY (`student_id`) REFERENCES `student` (`student_id`) ON DELETE RESTRICT ON UPDATE RESTRICT
) ENGINE=InnoDB AUTO_INCREMENT=20 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `student_advisor_mapping`
--

LOCK TABLES `student_advisor_mapping` WRITE;
/*!40000 ALTER TABLE `student_advisor_mapping` DISABLE KEYS */;
INSERT INTO `student_advisor_mapping` VALUES (1,6603400001,46172040,'หลัก',2567),(2,6603400002,46172040,'หลัก',2567),(3,6603400004,46172040,'หลัก',2567),(4,6603400005,46172040,'หลัก',2567),(5,6603400006,46172040,'หลัก',2567),(6,6603400007,46172040,'หลัก',2567),(7,6603400008,46172040,'หลัก',2567),(8,6603400009,46172040,'หลัก',2567),(16,6603400010,41172008,'หลัก',2567),(17,6603400011,41172008,'หลัก',2567),(18,6603400012,41172008,'หลัก',2567),(19,6603400013,41172008,'หลัก',2567);
/*!40000 ALTER TABLE `student_advisor_mapping` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `student_clo_scores`
--

DROP TABLE IF EXISTS `student_clo_scores`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `student_clo_scores` (
  `id` int NOT NULL AUTO_INCREMENT,
  `subject_id` int NOT NULL,
  `student_id` bigint NOT NULL,
  `clo_key` varchar(30) NOT NULL,
  `score` int NOT NULL DEFAULT '0',
  `updated_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`),
  UNIQUE KEY `uq_clo_score` (`subject_id`,`student_id`,`clo_key`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `student_clo_scores`
--

LOCK TABLES `student_clo_scores` WRITE;
/*!40000 ALTER TABLE `student_clo_scores` DISABLE KEYS */;
/*!40000 ALTER TABLE `student_clo_scores` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `Student_License_Attempts`
--

DROP TABLE IF EXISTS `Student_License_Attempts`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `Student_License_Attempts` (
  `attempt_id` bigint NOT NULL AUTO_INCREMENT,
  `student_id` bigint NOT NULL,
  `subject_code` varchar(50) DEFAULT NULL COMMENT 'วิชาที่สอบ',
  `exam_date` date DEFAULT NULL COMMENT 'วันที่สอบ',
  `result` varchar(50) DEFAULT NULL COMMENT 'ผลสอบ (ผ่าน/ไม่ผ่าน)',
  `attempt_number` int DEFAULT NULL COMMENT 'สอบครั้งที่เท่าไหร่',
  PRIMARY KEY (`attempt_id`),
  KEY `student_id` (`student_id`),
  CONSTRAINT `student_license_attempts_ibfk_1` FOREIGN KEY (`student_id`) REFERENCES `student` (`student_id`) ON DELETE RESTRICT ON UPDATE RESTRICT
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `Student_License_Attempts`
--

LOCK TABLES `Student_License_Attempts` WRITE;
/*!40000 ALTER TABLE `Student_License_Attempts` DISABLE KEYS */;
/*!40000 ALTER TABLE `Student_License_Attempts` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `student_performance`
--

DROP TABLE IF EXISTS `student_performance`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `student_performance` (
  `eval_id` bigint NOT NULL COMMENT 'รหัสการประเมิน',
  `student_id` int NOT NULL COMMENT 'รหัสนักศึกษา (เชื่อมตาราง student)',
  `faculty_id` int NOT NULL COMMENT 'รหัสอาจารย์ผู้ประเมิน',
  `academic_year` int NOT NULL COMMENT 'ปีการศึกษา',
  `semester` tinyint NOT NULL COMMENT 'ภาคการศึกษา',
  `scores_json` json NOT NULL COMMENT 'เก็บคะแนนย่อย เช่น skill, attitude, knowledge',
  `overall_score` decimal(3,2) NOT NULL COMMENT 'คะแนนเฉลี่ยรวม (เต็ม 5)',
  `evidence_path` varchar(255) DEFAULT NULL COMMENT 'พาร์ทไฟล์รูปภาพหลักฐานการปฏิบัติงาน',
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT 'วันที่ประเมิน'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci COMMENT='ตารางเก็บประวัติการประเมินสมรรถนะนักศึกษา';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `student_performance`
--

LOCK TABLES `student_performance` WRITE;
/*!40000 ALTER TABLE `student_performance` DISABLE KEYS */;
/*!40000 ALTER TABLE `student_performance` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `student_transfer_requests`
--

DROP TABLE IF EXISTS `student_transfer_requests`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `student_transfer_requests` (
  `student_transfer_request_id` bigint NOT NULL AUTO_INCREMENT,
  `approval_request_id` bigint NOT NULL,
  `student_id` varchar(50) NOT NULL,
  `from_advisor_user_id` bigint DEFAULT NULL,
  `to_advisor_user_id` bigint DEFAULT NULL,
  `reason` text,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`student_transfer_request_id`),
  UNIQUE KEY `uq_student_transfer_approval` (`approval_request_id`),
  KEY `idx_student_transfer_student` (`student_id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `student_transfer_requests`
--

LOCK TABLES `student_transfer_requests` WRITE;
/*!40000 ALTER TABLE `student_transfer_requests` DISABLE KEYS */;
INSERT INTO `student_transfer_requests` VALUES (1,2,'65010002',2,3,'ขอรับมอบนักศึกษา 65010002 จากอาจารย์ที่ปรึกษาเดิม','2026-06-19 23:00:33');
/*!40000 ALTER TABLE `student_transfer_requests` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `sub_plo`
--

DROP TABLE IF EXISTS `sub_plo`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `sub_plo` (
  `id` int NOT NULL,
  `description` varchar(255) NOT NULL,
  `subject_id` varchar(20) NOT NULL,
  PRIMARY KEY (`id`,`subject_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `sub_plo`
--

LOCK TABLES `sub_plo` WRITE;
/*!40000 ALTER TABLE `sub_plo` DISABLE KEYS */;
INSERT INTO `sub_plo` VALUES (101,'มีความรู้ความเข้าใจศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแล บุคคลที่สุขภาพดี การดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ','170-108'),(101,'มีความรู้ความเข้าใจศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแล บุคคลที่สุขภาพดี การดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ','170-112'),(101,'มีความรู้ความเข้าใจศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแล บุคคลที่สุขภาพดี การดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ','170-113'),(101,'มีความรู้ความเข้าใจศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแล บุคคลที่สุขภาพดี การดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ','170-201'),(101,'มีความรู้ความเข้าใจศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแล บุคคลที่สุขภาพดี การดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ','170-208'),(101,'มีความรู้ความเข้าใจศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแล บุคคลที่สุขภาพดี การดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ','170-211'),(101,'มีความรู้ความเข้าใจศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแล บุคคลที่สุขภาพดี การดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ','170-212'),(101,'มีความรู้ความเข้าใจศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแล บุคคลที่สุขภาพดี การดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ','170-216'),(101,'มีความรู้ความเข้าใจศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแล บุคคลที่สุขภาพดี การดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ','170-226'),(101,'มีความรู้ความเข้าใจศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแล บุคคลที่สุขภาพดี การดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ','170-227'),(101,'มีความรู้ความเข้าใจศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแล บุคคลที่สุขภาพดี การดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ','170-229'),(101,'มีความรู้ความเข้าใจศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแล บุคคลที่สุขภาพดี การดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ','170-230'),(101,'มีความรู้ความเข้าใจศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแล บุคคลที่สุขภาพดี การดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ','170-233'),(101,'มีความรู้ความเข้าใจศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแล บุคคลที่สุขภาพดี การดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ','170-324'),(101,'มีความรู้ความเข้าใจศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแล บุคคลที่สุขภาพดี การดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ','170-327'),(101,'มีความรู้ความเข้าใจศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแล บุคคลที่สุขภาพดี การดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ','170-331'),(101,'มีความรู้ความเข้าใจศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแล บุคคลที่สุขภาพดี การดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ','170-337'),(101,'มีความรู้ความเข้าใจศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแล บุคคลที่สุขภาพดี การดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ','170-338'),(101,'มีความรู้ความเข้าใจศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแล บุคคลที่สุขภาพดี การดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ','170-339'),(101,'มีความรู้ความเข้าใจศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแล บุคคลที่สุขภาพดี การดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ','170-340'),(101,'มีความรู้ความเข้าใจศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแล บุคคลที่สุขภาพดี การดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ','170-346'),(101,'มีความรู้ความเข้าใจศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแล บุคคลที่สุขภาพดี การดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ','170-347'),(101,'มีความรู้ความเข้าใจศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแล บุคคลที่สุขภาพดี การดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ','170-348'),(101,'มีความรู้ความเข้าใจศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแล บุคคลที่สุขภาพดี การดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ','170-349'),(101,'มีความรู้ความเข้าใจศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแล บุคคลที่สุขภาพดี การดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ','170-350'),(101,'มีความรู้ความเข้าใจศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแล บุคคลที่สุขภาพดี การดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ','170-351'),(101,'มีความรู้ความเข้าใจศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแล บุคคลที่สุขภาพดี การดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ','170-352'),(101,'มีความรู้ความเข้าใจศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแล บุคคลที่สุขภาพดี การดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ','170-353'),(101,'มีความรู้ความเข้าใจศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแล บุคคลที่สุขภาพดี การดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ','170-355'),(101,'มีความรู้ความเข้าใจศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแล บุคคลที่สุขภาพดี การดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ','170-431'),(101,'มีความรู้ความเข้าใจศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแล บุคคลที่สุขภาพดี การดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ','170-448'),(101,'มีความรู้ความเข้าใจศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแล บุคคลที่สุขภาพดี การดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ','170-449'),(101,'มีความรู้ความเข้าใจศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแล บุคคลที่สุขภาพดี การดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ','170-457'),(101,'มีความรู้ความเข้าใจศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแล บุคคลที่สุขภาพดี การดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ','170-458'),(101,'มีความรู้ความเข้าใจศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแล บุคคลที่สุขภาพดี การดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ','170-459'),(102,'มีความรู้ความเข้าใจในสาระสำคัญของศาสตร์ทางการพยาบาลและการผดุงครรภ์ในการดูแลผู้สูงอายุและผู้ป่วยวิกฤต','170-108'),(102,'มีความรู้ความเข้าใจในสาระสำคัญของศาสตร์ทางการพยาบาลและการผดุงครรภ์ในการดูแลผู้สูงอายุและผู้ป่วยวิกฤต','170-201'),(102,'มีความรู้ความเข้าใจในสาระสำคัญของศาสตร์ทางการพยาบาลและการผดุงครรภ์ในการดูแลผู้สูงอายุและผู้ป่วยวิกฤต','170-229'),(102,'มีความรู้ความเข้าใจในสาระสำคัญของศาสตร์ทางการพยาบาลและการผดุงครรภ์ในการดูแลผู้สูงอายุและผู้ป่วยวิกฤต','170-340'),(102,'มีความรู้ความเข้าใจในสาระสำคัญของศาสตร์ทางการพยาบาลและการผดุงครรภ์ในการดูแลผู้สูงอายุและผู้ป่วยวิกฤต','170-349'),(102,'มีความรู้ความเข้าใจในสาระสำคัญของศาสตร์ทางการพยาบาลและการผดุงครรภ์ในการดูแลผู้สูงอายุและผู้ป่วยวิกฤต','170-458'),(102,'มีความรู้ความเข้าใจในสาระสำคัญของศาสตร์ทางการพยาบาลและการผดุงครรภ์ในการดูแลผู้สูงอายุและผู้ป่วยวิกฤต','170-459'),(103,'ประยุกต์ศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ผู้สูงอายุและผู้ป่วยวิกฤต','103-301'),(103,'ประยุกต์ศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ผู้สูงอายุและผู้ป่วยวิกฤต','103-302'),(103,'ประยุกต์ศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ผู้สูงอายุและผู้ป่วยวิกฤต','170-108'),(103,'ประยุกต์ศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ผู้สูงอายุและผู้ป่วยวิกฤต','170-112'),(103,'ประยุกต์ศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ผู้สูงอายุและผู้ป่วยวิกฤต','170-113'),(103,'ประยุกต์ศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ผู้สูงอายุและผู้ป่วยวิกฤต','170-116'),(103,'ประยุกต์ศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ผู้สูงอายุและผู้ป่วยวิกฤต','170-117'),(103,'ประยุกต์ศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ผู้สูงอายุและผู้ป่วยวิกฤต','170-201'),(103,'ประยุกต์ศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ผู้สูงอายุและผู้ป่วยวิกฤต','170-208'),(103,'ประยุกต์ศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ผู้สูงอายุและผู้ป่วยวิกฤต','170-222'),(103,'ประยุกต์ศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ผู้สูงอายุและผู้ป่วยวิกฤต','170-224'),(103,'ประยุกต์ศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ผู้สูงอายุและผู้ป่วยวิกฤต','170-226'),(103,'ประยุกต์ศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ผู้สูงอายุและผู้ป่วยวิกฤต','170-230'),(103,'ประยุกต์ศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ผู้สูงอายุและผู้ป่วยวิกฤต','170-231'),(103,'ประยุกต์ศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ผู้สูงอายุและผู้ป่วยวิกฤต','170-233'),(103,'ประยุกต์ศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ผู้สูงอายุและผู้ป่วยวิกฤต','170-234'),(103,'ประยุกต์ศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ผู้สูงอายุและผู้ป่วยวิกฤต','170-324'),(103,'ประยุกต์ศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ผู้สูงอายุและผู้ป่วยวิกฤต','170-327'),(103,'ประยุกต์ศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ผู้สูงอายุและผู้ป่วยวิกฤต','170-331'),(103,'ประยุกต์ศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ผู้สูงอายุและผู้ป่วยวิกฤต','170-337'),(103,'ประยุกต์ศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ผู้สูงอายุและผู้ป่วยวิกฤต','170-338'),(103,'ประยุกต์ศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ผู้สูงอายุและผู้ป่วยวิกฤต','170-339'),(103,'ประยุกต์ศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ผู้สูงอายุและผู้ป่วยวิกฤต','170-340'),(103,'ประยุกต์ศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ผู้สูงอายุและผู้ป่วยวิกฤต','170-346'),(103,'ประยุกต์ศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ผู้สูงอายุและผู้ป่วยวิกฤต','170-348'),(103,'ประยุกต์ศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ผู้สูงอายุและผู้ป่วยวิกฤต','170-349'),(103,'ประยุกต์ศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ผู้สูงอายุและผู้ป่วยวิกฤต','170-350'),(103,'ประยุกต์ศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ผู้สูงอายุและผู้ป่วยวิกฤต','170-351'),(103,'ประยุกต์ศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ผู้สูงอายุและผู้ป่วยวิกฤต','170-352'),(103,'ประยุกต์ศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ผู้สูงอายุและผู้ป่วยวิกฤต','170-353'),(103,'ประยุกต์ศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ผู้สูงอายุและผู้ป่วยวิกฤต','170-354'),(103,'ประยุกต์ศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ผู้สูงอายุและผู้ป่วยวิกฤต','170-355'),(103,'ประยุกต์ศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ผู้สูงอายุและผู้ป่วยวิกฤต','170-431'),(103,'ประยุกต์ศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ผู้สูงอายุและผู้ป่วยวิกฤต','170-448'),(103,'ประยุกต์ศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ผู้สูงอายุและผู้ป่วยวิกฤต','170-449'),(103,'ประยุกต์ศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ผู้สูงอายุและผู้ป่วยวิกฤต','170-457'),(103,'ประยุกต์ศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ผู้สูงอายุและผู้ป่วยวิกฤต','170-458'),(103,'ประยุกต์ศาสตร์ทางการพยาบาลและการผดุงครรภ์และศาสตร์ที่เกี่ยวข้องในการดูแลบุคคลทั้งในภาวะปกติ ภาวะเจ็บป่วยทุกช่วงวัย ผู้สูงอายุและผู้ป่วยวิกฤต','170-459'),(201,'ปฏิบัติการพยาบาลและการผดุงครรภ์อย่างเป็นองค์รวมในการดูแลบุคคลที่สุขภาพดี เจ็บป่วย และวิกฤต แบบองค์รวมทุกช่วงวัย','170-216'),(201,'ปฏิบัติการพยาบาลและการผดุงครรภ์อย่างเป็นองค์รวมในการดูแลบุคคลที่สุขภาพดี เจ็บป่วย และวิกฤต แบบองค์รวมทุกช่วงวัย','170-228'),(201,'ปฏิบัติการพยาบาลและการผดุงครรภ์อย่างเป็นองค์รวมในการดูแลบุคคลที่สุขภาพดี เจ็บป่วย และวิกฤต แบบองค์รวมทุกช่วงวัย','170-232'),(201,'ปฏิบัติการพยาบาลและการผดุงครรภ์อย่างเป็นองค์รวมในการดูแลบุคคลที่สุขภาพดี เจ็บป่วย และวิกฤต แบบองค์รวมทุกช่วงวัย','170-327'),(201,'ปฏิบัติการพยาบาลและการผดุงครรภ์อย่างเป็นองค์รวมในการดูแลบุคคลที่สุขภาพดี เจ็บป่วย และวิกฤต แบบองค์รวมทุกช่วงวัย','170-331'),(201,'ปฏิบัติการพยาบาลและการผดุงครรภ์อย่างเป็นองค์รวมในการดูแลบุคคลที่สุขภาพดี เจ็บป่วย และวิกฤต แบบองค์รวมทุกช่วงวัย','170-337'),(201,'ปฏิบัติการพยาบาลและการผดุงครรภ์อย่างเป็นองค์รวมในการดูแลบุคคลที่สุขภาพดี เจ็บป่วย และวิกฤต แบบองค์รวมทุกช่วงวัย','170-338'),(201,'ปฏิบัติการพยาบาลและการผดุงครรภ์อย่างเป็นองค์รวมในการดูแลบุคคลที่สุขภาพดี เจ็บป่วย และวิกฤต แบบองค์รวมทุกช่วงวัย','170-339'),(201,'ปฏิบัติการพยาบาลและการผดุงครรภ์อย่างเป็นองค์รวมในการดูแลบุคคลที่สุขภาพดี เจ็บป่วย และวิกฤต แบบองค์รวมทุกช่วงวัย','170-340'),(201,'ปฏิบัติการพยาบาลและการผดุงครรภ์อย่างเป็นองค์รวมในการดูแลบุคคลที่สุขภาพดี เจ็บป่วย และวิกฤต แบบองค์รวมทุกช่วงวัย','170-347'),(201,'ปฏิบัติการพยาบาลและการผดุงครรภ์อย่างเป็นองค์รวมในการดูแลบุคคลที่สุขภาพดี เจ็บป่วย และวิกฤต แบบองค์รวมทุกช่วงวัย','170-355'),(201,'ปฏิบัติการพยาบาลและการผดุงครรภ์อย่างเป็นองค์รวมในการดูแลบุคคลที่สุขภาพดี เจ็บป่วย และวิกฤต แบบองค์รวมทุกช่วงวัย','170-431'),(202,'จัดการปัญหาและข้อขัดแย้งทางการพยาบาลได้อย่างเหมาะสม','170-222'),(202,'จัดการปัญหาและข้อขัดแย้งทางการพยาบาลได้อย่างเหมาะสม','170-327'),(202,'จัดการปัญหาและข้อขัดแย้งทางการพยาบาลได้อย่างเหมาะสม','170-331'),(202,'จัดการปัญหาและข้อขัดแย้งทางการพยาบาลได้อย่างเหมาะสม','170-339'),(202,'จัดการปัญหาและข้อขัดแย้งทางการพยาบาลได้อย่างเหมาะสม','170-340'),(202,'จัดการปัญหาและข้อขัดแย้งทางการพยาบาลได้อย่างเหมาะสม','170-349'),(202,'จัดการปัญหาและข้อขัดแย้งทางการพยาบาลได้อย่างเหมาะสม','170-350'),(202,'จัดการปัญหาและข้อขัดแย้งทางการพยาบาลได้อย่างเหมาะสม','170-351'),(202,'จัดการปัญหาและข้อขัดแย้งทางการพยาบาลได้อย่างเหมาะสม','170-352'),(202,'จัดการปัญหาและข้อขัดแย้งทางการพยาบาลได้อย่างเหมาะสม','170-353'),(203,'ประสานงานกับทีมสหสาขาวิชาชีพในการดูแลบุคคลที่สุขภาพดี เจ็บป่วย และวิกฤต แบบองค์รวมทุกช่วงวัยได้','170-232'),(203,'ประสานงานกับทีมสหสาขาวิชาชีพในการดูแลบุคคลที่สุขภาพดี เจ็บป่วย และวิกฤต แบบองค์รวมทุกช่วงวัยได้','170-327'),(203,'ประสานงานกับทีมสหสาขาวิชาชีพในการดูแลบุคคลที่สุขภาพดี เจ็บป่วย และวิกฤต แบบองค์รวมทุกช่วงวัยได้','170-331'),(203,'ประสานงานกับทีมสหสาขาวิชาชีพในการดูแลบุคคลที่สุขภาพดี เจ็บป่วย และวิกฤต แบบองค์รวมทุกช่วงวัยได้','170-337'),(203,'ประสานงานกับทีมสหสาขาวิชาชีพในการดูแลบุคคลที่สุขภาพดี เจ็บป่วย และวิกฤต แบบองค์รวมทุกช่วงวัยได้','170-338'),(203,'ประสานงานกับทีมสหสาขาวิชาชีพในการดูแลบุคคลที่สุขภาพดี เจ็บป่วย และวิกฤต แบบองค์รวมทุกช่วงวัยได้','170-339'),(203,'ประสานงานกับทีมสหสาขาวิชาชีพในการดูแลบุคคลที่สุขภาพดี เจ็บป่วย และวิกฤต แบบองค์รวมทุกช่วงวัยได้','170-340'),(203,'ประสานงานกับทีมสหสาขาวิชาชีพในการดูแลบุคคลที่สุขภาพดี เจ็บป่วย และวิกฤต แบบองค์รวมทุกช่วงวัยได้','170-347'),(203,'ประสานงานกับทีมสหสาขาวิชาชีพในการดูแลบุคคลที่สุขภาพดี เจ็บป่วย และวิกฤต แบบองค์รวมทุกช่วงวัยได้','170-355'),(203,'ประสานงานกับทีมสหสาขาวิชาชีพในการดูแลบุคคลที่สุขภาพดี เจ็บป่วย และวิกฤต แบบองค์รวมทุกช่วงวัยได้','170-431'),(301,'นำกระบวนการวิจัยมาใช้ในการพัฒนานวัตกรรมทางสุขภาพได้','170-331'),(301,'นำกระบวนการวิจัยมาใช้ในการพัฒนานวัตกรรมทางสุขภาพได้','170-339'),(301,'นำกระบวนการวิจัยมาใช้ในการพัฒนานวัตกรรมทางสุขภาพได้','170-346'),(301,'นำกระบวนการวิจัยมาใช้ในการพัฒนานวัตกรรมทางสุขภาพได้','170-348'),(301,'นำกระบวนการวิจัยมาใช้ในการพัฒนานวัตกรรมทางสุขภาพได้','170-349'),(301,'นำกระบวนการวิจัยมาใช้ในการพัฒนานวัตกรรมทางสุขภาพได้','170-354'),(301,'นำกระบวนการวิจัยมาใช้ในการพัฒนานวัตกรรมทางสุขภาพได้','170-457'),(302,'ใช้เทคโนโลยีสารสนเทศทางการพยาบาลได้อย่างเหมาะสม','103-202'),(302,'ใช้เทคโนโลยีสารสนเทศทางการพยาบาลได้อย่างเหมาะสม','170-211'),(302,'ใช้เทคโนโลยีสารสนเทศทางการพยาบาลได้อย่างเหมาะสม','170-212'),(302,'ใช้เทคโนโลยีสารสนเทศทางการพยาบาลได้อย่างเหมาะสม','170-231'),(302,'ใช้เทคโนโลยีสารสนเทศทางการพยาบาลได้อย่างเหมาะสม','170-232'),(302,'ใช้เทคโนโลยีสารสนเทศทางการพยาบาลได้อย่างเหมาะสม','170-350'),(302,'ใช้เทคโนโลยีสารสนเทศทางการพยาบาลได้อย่างเหมาะสม','170-351'),(302,'ใช้เทคโนโลยีสารสนเทศทางการพยาบาลได้อย่างเหมาะสม','170-352'),(302,'ใช้เทคโนโลยีสารสนเทศทางการพยาบาลได้อย่างเหมาะสม','170-353'),(302,'ใช้เทคโนโลยีสารสนเทศทางการพยาบาลได้อย่างเหมาะสม','170-354'),(302,'ใช้เทคโนโลยีสารสนเทศทางการพยาบาลได้อย่างเหมาะสม','170-457'),(401,'สามารถใช้ระบบดิจิทัลทางการพยาบาลเพื่อการติดต่อประสานงานและการให้บริการผู้ป่วยได้อย่างถูกต้อง','103-202'),(401,'สามารถใช้ระบบดิจิทัลทางการพยาบาลเพื่อการติดต่อประสานงานและการให้บริการผู้ป่วยได้อย่างถูกต้อง','170-112'),(401,'สามารถใช้ระบบดิจิทัลทางการพยาบาลเพื่อการติดต่อประสานงานและการให้บริการผู้ป่วยได้อย่างถูกต้อง','170-113'),(401,'สามารถใช้ระบบดิจิทัลทางการพยาบาลเพื่อการติดต่อประสานงานและการให้บริการผู้ป่วยได้อย่างถูกต้อง','170-231'),(401,'สามารถใช้ระบบดิจิทัลทางการพยาบาลเพื่อการติดต่อประสานงานและการให้บริการผู้ป่วยได้อย่างถูกต้อง','170-327'),(401,'สามารถใช้ระบบดิจิทัลทางการพยาบาลเพื่อการติดต่อประสานงานและการให้บริการผู้ป่วยได้อย่างถูกต้อง','170-346'),(401,'สามารถใช้ระบบดิจิทัลทางการพยาบาลเพื่อการติดต่อประสานงานและการให้บริการผู้ป่วยได้อย่างถูกต้อง','170-431'),(401,'สามารถใช้ระบบดิจิทัลทางการพยาบาลเพื่อการติดต่อประสานงานและการให้บริการผู้ป่วยได้อย่างถูกต้อง','170-457'),(401,'สามารถใช้ระบบดิจิทัลทางการพยาบาลเพื่อการติดต่อประสานงานและการให้บริการผู้ป่วยได้อย่างถูกต้อง','170-458'),(401,'สามารถใช้ระบบดิจิทัลทางการพยาบาลเพื่อการติดต่อประสานงานและการให้บริการผู้ป่วยได้อย่างถูกต้อง','170-459'),(501,'ใช้ภาษาไทยในการสื่อสาร การบันทึกรายงานทางการพยาบาล การประสานงานกับทึมสุขภาพและผู้รับบริการได้อย่างมีประสิทธิภาพ','170-112'),(501,'ใช้ภาษาไทยในการสื่อสาร การบันทึกรายงานทางการพยาบาล การประสานงานกับทึมสุขภาพและผู้รับบริการได้อย่างมีประสิทธิภาพ','170-113'),(501,'ใช้ภาษาไทยในการสื่อสาร การบันทึกรายงานทางการพยาบาล การประสานงานกับทึมสุขภาพและผู้รับบริการได้อย่างมีประสิทธิภาพ','170-327'),(501,'ใช้ภาษาไทยในการสื่อสาร การบันทึกรายงานทางการพยาบาล การประสานงานกับทึมสุขภาพและผู้รับบริการได้อย่างมีประสิทธิภาพ','170-431'),(501,'ใช้ภาษาไทยในการสื่อสาร การบันทึกรายงานทางการพยาบาล การประสานงานกับทึมสุขภาพและผู้รับบริการได้อย่างมีประสิทธิภาพ','170-448'),(501,'ใช้ภาษาไทยในการสื่อสาร การบันทึกรายงานทางการพยาบาล การประสานงานกับทึมสุขภาพและผู้รับบริการได้อย่างมีประสิทธิภาพ','170-457'),(501,'ใช้ภาษาไทยในการสื่อสาร การบันทึกรายงานทางการพยาบาล การประสานงานกับทึมสุขภาพและผู้รับบริการได้อย่างมีประสิทธิภาพ','170-458'),(501,'ใช้ภาษาไทยในการสื่อสาร การบันทึกรายงานทางการพยาบาล การประสานงานกับทึมสุขภาพและผู้รับบริการได้อย่างมีประสิทธิภาพ','170-459'),(502,'ใช้ภาษาอังกฤษในการสื่อสารกับทึมสุขภาพและผู้รับบริการได้','170-112'),(502,'ใช้ภาษาอังกฤษในการสื่อสารกับทึมสุขภาพและผู้รับบริการได้','170-113'),(502,'ใช้ภาษาอังกฤษในการสื่อสารกับทึมสุขภาพและผู้รับบริการได้','170-457'),(502,'ใช้ภาษาอังกฤษในการสื่อสารกับทึมสุขภาพและผู้รับบริการได้','170-458'),(502,'ใช้ภาษาอังกฤษในการสื่อสารกับทึมสุขภาพและผู้รับบริการได้','170-459'),(601,'แสดงออกถึงการมีบุคลิกภาพและการวางตัวได้อย่างเหมาะสมในความเป็นวิชาชีพ','170-227'),(601,'แสดงออกถึงการมีบุคลิกภาพและการวางตัวได้อย่างเหมาะสมในความเป็นวิชาชีพ','170-228'),(601,'แสดงออกถึงการมีบุคลิกภาพและการวางตัวได้อย่างเหมาะสมในความเป็นวิชาชีพ','170-337'),(601,'แสดงออกถึงการมีบุคลิกภาพและการวางตัวได้อย่างเหมาะสมในความเป็นวิชาชีพ','170-338'),(601,'แสดงออกถึงการมีบุคลิกภาพและการวางตัวได้อย่างเหมาะสมในความเป็นวิชาชีพ','170-340'),(601,'แสดงออกถึงการมีบุคลิกภาพและการวางตัวได้อย่างเหมาะสมในความเป็นวิชาชีพ','170-355'),(601,'แสดงออกถึงการมีบุคลิกภาพและการวางตัวได้อย่างเหมาะสมในความเป็นวิชาชีพ','170-449'),(601,'แสดงออกถึงการมีบุคลิกภาพและการวางตัวได้อย่างเหมาะสมในความเป็นวิชาชีพ','170-458'),(601,'แสดงออกถึงการมีบุคลิกภาพและการวางตัวได้อย่างเหมาะสมในความเป็นวิชาชีพ','170-459'),(602,'ปฏิบัติงานด้วยความซื่อสัตย์ เสียสละ ตรงต่อเวลา มีความรับผิดชอบ มีความรัก และศรัทธาในวิชาชีพ','170-232'),(602,'ปฏิบัติงานด้วยความซื่อสัตย์ เสียสละ ตรงต่อเวลา มีความรับผิดชอบ มีความรัก และศรัทธาในวิชาชีพ','170-337'),(602,'ปฏิบัติงานด้วยความซื่อสัตย์ เสียสละ ตรงต่อเวลา มีความรับผิดชอบ มีความรัก และศรัทธาในวิชาชีพ','170-338'),(602,'ปฏิบัติงานด้วยความซื่อสัตย์ เสียสละ ตรงต่อเวลา มีความรับผิดชอบ มีความรัก และศรัทธาในวิชาชีพ','170-340'),(602,'ปฏิบัติงานด้วยความซื่อสัตย์ เสียสละ ตรงต่อเวลา มีความรับผิดชอบ มีความรัก และศรัทธาในวิชาชีพ','170-354'),(602,'ปฏิบัติงานด้วยความซื่อสัตย์ เสียสละ ตรงต่อเวลา มีความรับผิดชอบ มีความรัก และศรัทธาในวิชาชีพ','170-355'),(602,'ปฏิบัติงานด้วยความซื่อสัตย์ เสียสละ ตรงต่อเวลา มีความรับผิดชอบ มีความรัก และศรัทธาในวิชาชีพ','170-449'),(602,'ปฏิบัติงานด้วยความซื่อสัตย์ เสียสละ ตรงต่อเวลา มีความรับผิดชอบ มีความรัก และศรัทธาในวิชาชีพ','170-458'),(602,'ปฏิบัติงานด้วยความซื่อสัตย์ เสียสละ ตรงต่อเวลา มีความรับผิดชอบ มีความรัก และศรัทธาในวิชาชีพ','170-459'),(603,'สามารถปรับตัวเข้ากับสถานการณ์ที่หลากหลาย','170-117'),(603,'สามารถปรับตัวเข้ากับสถานการณ์ที่หลากหลาย','170-337'),(603,'สามารถปรับตัวเข้ากับสถานการณ์ที่หลากหลาย','170-338'),(603,'สามารถปรับตัวเข้ากับสถานการณ์ที่หลากหลาย','170-340'),(603,'สามารถปรับตัวเข้ากับสถานการณ์ที่หลากหลาย','170-355'),(603,'สามารถปรับตัวเข้ากับสถานการณ์ที่หลากหลาย','170-449'),(603,'สามารถปรับตัวเข้ากับสถานการณ์ที่หลากหลาย','170-458'),(603,'สามารถปรับตัวเข้ากับสถานการณ์ที่หลากหลาย','170-459'),(701,'แสดงออกถึงการแสวงหาความรู้เพิ่มเติมอย่างต่อเนื่อง','103-201'),(701,'แสดงออกถึงการแสวงหาความรู้เพิ่มเติมอย่างต่อเนื่อง','170-208'),(701,'แสดงออกถึงการแสวงหาความรู้เพิ่มเติมอย่างต่อเนื่อง','170-211'),(701,'แสดงออกถึงการแสวงหาความรู้เพิ่มเติมอย่างต่อเนื่อง','170-212'),(701,'แสดงออกถึงการแสวงหาความรู้เพิ่มเติมอย่างต่อเนื่อง','170-216'),(701,'แสดงออกถึงการแสวงหาความรู้เพิ่มเติมอย่างต่อเนื่อง','170-226'),(701,'แสดงออกถึงการแสวงหาความรู้เพิ่มเติมอย่างต่อเนื่อง','170-228'),(701,'แสดงออกถึงการแสวงหาความรู้เพิ่มเติมอย่างต่อเนื่อง','170-229'),(701,'แสดงออกถึงการแสวงหาความรู้เพิ่มเติมอย่างต่อเนื่อง','170-231'),(701,'แสดงออกถึงการแสวงหาความรู้เพิ่มเติมอย่างต่อเนื่อง','170-232'),(701,'แสดงออกถึงการแสวงหาความรู้เพิ่มเติมอย่างต่อเนื่อง','170-233'),(701,'แสดงออกถึงการแสวงหาความรู้เพิ่มเติมอย่างต่อเนื่อง','170-234'),(701,'แสดงออกถึงการแสวงหาความรู้เพิ่มเติมอย่างต่อเนื่อง','170-324'),(701,'แสดงออกถึงการแสวงหาความรู้เพิ่มเติมอย่างต่อเนื่อง','170-331'),(701,'แสดงออกถึงการแสวงหาความรู้เพิ่มเติมอย่างต่อเนื่อง','170-339'),(701,'แสดงออกถึงการแสวงหาความรู้เพิ่มเติมอย่างต่อเนื่อง','170-348'),(701,'แสดงออกถึงการแสวงหาความรู้เพิ่มเติมอย่างต่อเนื่อง','170-349'),(701,'แสดงออกถึงการแสวงหาความรู้เพิ่มเติมอย่างต่อเนื่อง','170-350'),(701,'แสดงออกถึงการแสวงหาความรู้เพิ่มเติมอย่างต่อเนื่อง','170-351'),(701,'แสดงออกถึงการแสวงหาความรู้เพิ่มเติมอย่างต่อเนื่อง','170-352'),(701,'แสดงออกถึงการแสวงหาความรู้เพิ่มเติมอย่างต่อเนื่อง','170-353'),(701,'แสดงออกถึงการแสวงหาความรู้เพิ่มเติมอย่างต่อเนื่อง','170-448'),(701,'แสดงออกถึงการแสวงหาความรู้เพิ่มเติมอย่างต่อเนื่อง','170-457'),(702,'สามารถสืบค้นและวิเคราะห์ความน่าเชื่อถือของข้อมูลได้อย่างเหมาะสม','103-201'),(702,'สามารถสืบค้นและวิเคราะห์ความน่าเชื่อถือของข้อมูลได้อย่างเหมาะสม','170-116'),(702,'สามารถสืบค้นและวิเคราะห์ความน่าเชื่อถือของข้อมูลได้อย่างเหมาะสม','170-201'),(702,'สามารถสืบค้นและวิเคราะห์ความน่าเชื่อถือของข้อมูลได้อย่างเหมาะสม','170-211'),(702,'สามารถสืบค้นและวิเคราะห์ความน่าเชื่อถือของข้อมูลได้อย่างเหมาะสม','170-212'),(702,'สามารถสืบค้นและวิเคราะห์ความน่าเชื่อถือของข้อมูลได้อย่างเหมาะสม','170-226'),(702,'สามารถสืบค้นและวิเคราะห์ความน่าเชื่อถือของข้อมูลได้อย่างเหมาะสม','170-234'),(702,'สามารถสืบค้นและวิเคราะห์ความน่าเชื่อถือของข้อมูลได้อย่างเหมาะสม','170-324'),(702,'สามารถสืบค้นและวิเคราะห์ความน่าเชื่อถือของข้อมูลได้อย่างเหมาะสม','170-350'),(702,'สามารถสืบค้นและวิเคราะห์ความน่าเชื่อถือของข้อมูลได้อย่างเหมาะสม','170-351'),(702,'สามารถสืบค้นและวิเคราะห์ความน่าเชื่อถือของข้อมูลได้อย่างเหมาะสม','170-352'),(702,'สามารถสืบค้นและวิเคราะห์ความน่าเชื่อถือของข้อมูลได้อย่างเหมาะสม','170-353'),(702,'สามารถสืบค้นและวิเคราะห์ความน่าเชื่อถือของข้อมูลได้อย่างเหมาะสม','170-448'),(801,'ประเมินความต้องการบริการสุขภาพสอดคล้องกับสถานการณ์ปัจจุบัน','103-302'),(801,'ประเมินความต้องการบริการสุขภาพสอดคล้องกับสถานการณ์ปัจจุบัน','170-116'),(801,'ประเมินความต้องการบริการสุขภาพสอดคล้องกับสถานการณ์ปัจจุบัน','170-117'),(801,'ประเมินความต้องการบริการสุขภาพสอดคล้องกับสถานการณ์ปัจจุบัน','170-216'),(801,'ประเมินความต้องการบริการสุขภาพสอดคล้องกับสถานการณ์ปัจจุบัน','170-227'),(801,'ประเมินความต้องการบริการสุขภาพสอดคล้องกับสถานการณ์ปัจจุบัน','170-228'),(801,'ประเมินความต้องการบริการสุขภาพสอดคล้องกับสถานการณ์ปัจจุบัน','170-229'),(801,'ประเมินความต้องการบริการสุขภาพสอดคล้องกับสถานการณ์ปัจจุบัน','170-230'),(801,'ประเมินความต้องการบริการสุขภาพสอดคล้องกับสถานการณ์ปัจจุบัน','170-233'),(801,'ประเมินความต้องการบริการสุขภาพสอดคล้องกับสถานการณ์ปัจจุบัน','170-234'),(801,'ประเมินความต้องการบริการสุขภาพสอดคล้องกับสถานการณ์ปัจจุบัน','170-324'),(801,'ประเมินความต้องการบริการสุขภาพสอดคล้องกับสถานการณ์ปัจจุบัน','170-348'),(801,'ประเมินความต้องการบริการสุขภาพสอดคล้องกับสถานการณ์ปัจจุบัน','170-350'),(801,'ประเมินความต้องการบริการสุขภาพสอดคล้องกับสถานการณ์ปัจจุบัน','170-351'),(801,'ประเมินความต้องการบริการสุขภาพสอดคล้องกับสถานการณ์ปัจจุบัน','170-352'),(801,'ประเมินความต้องการบริการสุขภาพสอดคล้องกับสถานการณ์ปัจจุบัน','170-353'),(801,'ประเมินความต้องการบริการสุขภาพสอดคล้องกับสถานการณ์ปัจจุบัน','170-448'),(801,'ประเมินความต้องการบริการสุขภาพสอดคล้องกับสถานการณ์ปัจจุบัน','170-457'),(801,'ประเมินความต้องการบริการสุขภาพสอดคล้องกับสถานการณ์ปัจจุบัน','170-458'),(801,'ประเมินความต้องการบริการสุขภาพสอดคล้องกับสถานการณ์ปัจจุบัน','170-459'),(802,'ออกแบบบริการการพยาบาลและการผดุงครรภ์ได้','103-302'),(802,'ออกแบบบริการการพยาบาลและการผดุงครรภ์ได้','170-117'),(802,'ออกแบบบริการการพยาบาลและการผดุงครรภ์ได้','170-227'),(802,'ออกแบบบริการการพยาบาลและการผดุงครรภ์ได้','170-233'),(802,'ออกแบบบริการการพยาบาลและการผดุงครรภ์ได้','170-234'),(802,'ออกแบบบริการการพยาบาลและการผดุงครรภ์ได้','170-324'),(802,'ออกแบบบริการการพยาบาลและการผดุงครรภ์ได้','170-331'),(802,'ออกแบบบริการการพยาบาลและการผดุงครรภ์ได้','170-337'),(802,'ออกแบบบริการการพยาบาลและการผดุงครรภ์ได้','170-338'),(802,'ออกแบบบริการการพยาบาลและการผดุงครรภ์ได้','170-339'),(802,'ออกแบบบริการการพยาบาลและการผดุงครรภ์ได้','170-340'),(802,'ออกแบบบริการการพยาบาลและการผดุงครรภ์ได้','170-349'),(802,'ออกแบบบริการการพยาบาลและการผดุงครรภ์ได้','170-350'),(802,'ออกแบบบริการการพยาบาลและการผดุงครรภ์ได้','170-351'),(802,'ออกแบบบริการการพยาบาลและการผดุงครรภ์ได้','170-352'),(802,'ออกแบบบริการการพยาบาลและการผดุงครรภ์ได้','170-353'),(802,'ออกแบบบริการการพยาบาลและการผดุงครรภ์ได้','170-355'),(802,'ออกแบบบริการการพยาบาลและการผดุงครรภ์ได้','170-449'),(802,'ออกแบบบริการการพยาบาลและการผดุงครรภ์ได้','170-458'),(802,'ออกแบบบริการการพยาบาลและการผดุงครรภ์ได้','170-459'),(803,'สามารถจัดการในการเป็นผู้ประกอบการด้านการดูแลสุขภาพได้','103-302'),(803,'สามารถจัดการในการเป็นผู้ประกอบการด้านการดูแลสุขภาพได้','170-117'),(803,'สามารถจัดการในการเป็นผู้ประกอบการด้านการดูแลสุขภาพได้','170-229'),(803,'สามารถจัดการในการเป็นผู้ประกอบการด้านการดูแลสุขภาพได้','170-233'),(803,'สามารถจัดการในการเป็นผู้ประกอบการด้านการดูแลสุขภาพได้','170-234'),(803,'สามารถจัดการในการเป็นผู้ประกอบการด้านการดูแลสุขภาพได้','170-324'),(803,'สามารถจัดการในการเป็นผู้ประกอบการด้านการดูแลสุขภาพได้','170-457'),(803,'สามารถจัดการในการเป็นผู้ประกอบการด้านการดูแลสุขภาพได้','170-458');
/*!40000 ALTER TABLE `sub_plo` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `subject`
--

DROP TABLE IF EXISTS `subject`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `subject` (
  `subject_id` int NOT NULL,
  `subject_code` varchar(50) DEFAULT NULL,
  `subject_name_th` varchar(255) DEFAULT NULL,
  `subject_name_en` varchar(255) DEFAULT NULL,
  `credit` int DEFAULT NULL,
  `credit_desc` varchar(50) DEFAULT NULL,
  `description` text,
  `is_active` int DEFAULT NULL,
  `program_id` int DEFAULT NULL,
  `department` varchar(255) DEFAULT NULL,
  `subject_type` varchar(100) DEFAULT NULL,
  `year_level` int DEFAULT NULL,
  `semester` int DEFAULT NULL,
  PRIMARY KEY (`subject_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `subject`
--

LOCK TABLES `subject` WRITE;
/*!40000 ALTER TABLE `subject` DISABLE KEYS */;
INSERT INTO `subject` VALUES (1,'103-111','ภาษาอังกฤษพื้นฐาน','English Fundamentals',3,'3(2-2-5)','การอ่านข้อความที่สั้นและง่าย การฝึกใช้คำศัพท์และสำนวนพื้นฐานในการสนทนา การทำตามคำแนะนำ ความเข้าใจข้อมูลในโฆษณา โปรแกรม และโบรชัวร์ การสร้างวลีและประโยคอย่างง่ายในงานเขียน การอธิบายตนเองและชีวิตประจำวัน การเขียนข้อความสั้นๆ การโพสต์ออนไลน์ การมีส่วนร่วมอย่างแข่งขันในการถามและตอบคำถาม การมีส่วนร่วมในการสนทนาในหัวข้อที่ไม่ซับซ้อน',1,1,NULL,'หมวดวิชาศึกษาทั่วไป',1,1),(2,'103-112','การสื่อสารภาษาอังกฤษในชีวิตประจำวัน','English Communication in Everyday Life',3,'3(2-2-5)','การสื่อสารอย่างมั่นใจในสถานการณ์ที่กำหนดไว้ การแลกเปลี่ยนความคิดเห็น การถามและตอบคำถามในหัวข้อที่คุ้นเคย การมีส่วนร่วมในการสนทนาที่เกี่ยวข้องกับความสนใจและสาขาวิชาชีพ การอธิบายและชี้แจง การสื่อสารกับผู้อื่น เช่น การขอความช่วยเหลือ การเสนอแนะ และการปฏิบัติตามคำแนะนำ การเขียนจดหมายโต้ตอบเพื่อการสื่อสาร การใช้แพลตฟอร์มออนไลน์เพื่อการสื่อสาร',1,1,NULL,'หมวดวิชาศึกษาทั่วไป',1,2),(3,'103-113','ภาษาอังกฤษเพื่อการศึกษาทางวิชาการ','English for Academic Study',3,'3(2-2-5)','การฝึกทักษะภาษาอังกฤษทั้ง 4 ด้านเพื่อการศึกษาทางวิชาการ การฟัง และตอบคำถามทางวิชาการ การนำเสนอด้วยปากเปล่า การพัฒนาความเข้าใจในการอ่านและทักษะการอ่านอย่างมีวิจารณญาณ คำศัพท์ และโครงสร้างประโยคที่ใช้ในการเขียนทางวิชาการ การเขียนย่อหน้าประเภทต่างๆ',1,1,NULL,'หมวดวิชาศึกษาทั่วไป',0,0),(4,'103-114','ภาษาอังกฤษเพื่อการนำเสนอแบบมืออาชีพ','English for Professional Presentation',3,'3(2-2-5)','หลักการพูด การเลือกใช้คำ ประโยค คำเชื่อมและสำนวน การพูดในสถานการณ์ต่างๆ การแสดงความคิดเห็นและการนำเสนอเชิงวิชาการ การนำเสนอทางธุรกิจ การสัมภาษณ์งาน',1,1,NULL,'หมวดวิชาศึกษาทั่วไป',0,0),(5,'103-121','ภาษาไทยเพื่อการสื่อสาร','Thai Language for Communication',3,'3(2-2-5)','ภาษาไทยเพื่อการสื่อสารในสถานการณ์ต่างๆ หลักการใช้ภาษาสื่อสารที่ถูกต้องทั้งการรับสารและส่งสาร การจับประเด็นและการวิเคราะห์สารจากเรื่องที่ฟังหรืออ่านอย่างมีวิจารณญาณและนำเสนอความคิดผ่านการพูดการเขียนในรูปแบบที่เหมาะสมได้อย่างมีประสิทธิภาพ',1,1,NULL,'หมวดวิชาศึกษาทั่วไป',0,0),(6,'103-122','ภาษาไทยเพื่อการนำเสนอ','Thai Language for Presentation',3,'3(2-2-5)','การใช้ภาษาไทยนําเสนอข้อมูลในสถานการณ์ต่างๆ อาทิ การนําเสนอข้อมูลทางวิชาการ การนําเสนอข้อมูลทางธุรกิจ การแสดงความคิดเห็น วิเคราะห์และวิจารณ์ การนําเสนอข้อมูลที่มีความน่าเชื่อถือ การเลือกใช้ช่องทางการสื่อสารอย่างเหมาะสม และมีประสิทธิภาพเป็นประโยชน์ต่อการศึกษาและการทํางาน',1,1,NULL,'หมวดวิชาศึกษาทั่วไป',0,0),(7,'103-123','ภาษาไทยเพื่อผู้ประกอบการ','Thai Language for Entrepreneurs',3,'3(2-2-5)','ภาษาไทยเพื่อการทำงานในสถานประกอบการ ทักษะการสื่อสารภาษาไทยที่มีประสิทธิภาพและจำเป็นต่อการทำงานในองค์กรทั้งการฟัง การพูด การอ่าน และการเขียน การจัดทำเอกสารการประชุมหรือเอกสารที่เกี่ยวข้องกับการทำงาน',1,1,NULL,'หมวดวิชาศึกษาทั่วไป',0,0),(8,'103-131','ภาษาจีนเพื่อการสื่อสารในชีวิตประจำวัน','Chinese for Daily Communication',3,'3(2-2-5)','การฝึกทักษะฟัง พูด อ่าน และเขียน วิธีการอ่านสัทอักษรการถอดเสียงพินอิน Pinyin ภาษาจีนกลางที่ถูกต้อง โครงสร้างไวยากรณ์ คำศัพท์ประมาณ 150-300 คำ และสำนวนพื้นฐานที่ใช้ในชีวิตประจำวัน บทสนทนาขั้นพื้นฐาน ได้แก่ การพูดสนทนาทักทาย การแนะนำตนเอง การนับ และการใช้ตัวเลขแสดงจำนวน การสอบถามสถานที่และตำแหน่งทิศทาง การบอกเวลา และการบอกชื่อสิ่งของ',1,1,NULL,'หมวดวิชาศึกษาทั่วไป',0,0),(9,'103-141','ภาษาญี่ปุ่นในชีวิตประจำวัน','Daily Life Japanese',3,'3(2-2-5)','คำศัพท์ สำนวน วัฒนธรรม และทักษะในการสื่อสาร การตั้งคำถามและการตอบอย่างสั้น บทสนทนาอย่างง่ายในระดับวลี และประโยคสั้นๆโดยเน้นหัวข้อที่สามารถประยุกต์ใช้ในชีวิตประจำวัน',1,1,NULL,'หมวดวิชาศึกษาทั่วไป',0,0),(10,'103-151','การเขียนโค้ดคอมพิวเตอร์สำหรับทุกคน','Computer Coding for Everyone',3,'3(2-2-5)','ความรู้พื้นฐานการเขียนโปรแกรมด้วยภาษาไพธอน เครื่องมือที่ใช้ในการเขียนโปรแกรมภาษาไพธอน ชนิดของข้อมูลและตัวแปร การรับข้อมูลเข้าและการแสดงผลลัพธ์ การใช้งานคำสั่งทางเลือก การใช้งานคำสั่งวนลูป การสร้างฟังก์ชัน การวิเคราะห์ข้อมูลและการนำเสนอข้อมูล',1,1,NULL,'หมวดวิชาศึกษาทั่วไป',0,0),(11,'103-201','ทักษะดิจิทัลสำหรับศตวรรษที่ 21','Digital Literacy for 21st Century',3,'3(2-2-5)','การใช้เทคโนโลยีดิจิทัลเพื่อการสืบค้นสารสนเทศ การสื่อสาร และการรู้เท่าทันการเปลี่ยนแปลงด้านเทคโนโลยีดิจิทัล หลักการการเป็นพลเมืองดิจิทัล ความปลอดภัยด้านสารสนเทศ จริยธรรมและกฎหมายที่เกี่ยวข้อง การนำเทคโนโลยีมาใช้เพื่อการจัดการสมัยใหม่ การวิเคราะห์และสังเคราะห์สารสนเทศ การเขียนรายงาน การเลือกเครื่องมือดิจิทัลที่สอดคล้องกับการทำงานเพื่อให้เกิดประสิทธิภาพ',1,1,NULL,'หมวดวิชาศึกษาทั่วไป',1,1),(12,'103-202','การวิเคราะห์ข้อมูลและการเรียนรู้ของเครื่องจักรเบื้องต้น','Introduction to Data Analytics and Machine Learning',3,'3(2-2-5)','พื้นฐานของการทำงานอัตโนมัติ การวิเคราะห์ข้อมูลและการเรียนรู้ของเครื่อง เช่น การรวบรวมข้อมูล การระบุแหล่งข้อมูล การทำความสะอาดข้อมูล การวิเคราะห์ การสื่อสารข้อมูลเชิงลึกด้วยการใช้แดชบอร์ด การแสดงภาพเพื่อเพิ่มมูลค่าให้กับการตัดสินใจ การเรียนรู้ของเครื่องจักร เครื่องมือต่างๆและการประยุกต์ใช้ การอภิปรายสถานการณ์จริงของการเรียนรู้เครื่องมือหรือตัวอย่างของการใช้ปัญญาประดิษฐ์เชิงกำเนิด',1,1,NULL,'หมวดวิชาศึกษาทั่วไป',1,2),(13,'103-203','ความเป็นพลเมืองในสังคมไทยและสังคมโลก','Civic Literacy in Thai and Global Context',3,'3(3-0-6)','สภาพการณ์ทางการเมือง เศรษฐกิจ สังคม และวัฒนธรรมของกลุ่มประเทศต่างๆ ประเด็นปัญหาร่วมสมัยในสังคมโลก ประเทศไทยในสังคมโลก ความหลากหลายทางวัฒนธรรมและกระบวนการทางความคิดที่เป็นสากล ความรับผิดชอบต่อสังคม การรู้หน้าที่ของพลเมืองและรับผิดชอบต่อสังคมในการต่อต้านการทุจริต ความสัมพันธ์ระหว่างความเป็นพลเมืองกับสถานะการพัฒนาของประเทศภายใต้กฎหมายในชีวิตประจำวันและกติกาสากลของสังคมประชาธิปไตย บทบาทและหน้าที่ของบุคคลในฐานะพลเมืองไทยและพลเมืองโลก',1,1,NULL,'หมวดวิชาศึกษาทั่วไป',0,0),(14,'103-204','มนุษยสัมพันธ์และการพัฒนาบุคลิกภาพ','Human Relations and Personality Development',3,'3(3-0-6)','การสร้างความสัมพันธ์ระหว่างบุคคล การรู้จักตนเองและผู้อื่น เสริมสร้างการเห็นคุณค่าในตนเอง กำหนดเป้าหมายในการเรียนการทำงานและการมีบุคลิกภาพที่เหมาะสม สามารถทำงานร่วมกับผู้อื่นได้',1,1,NULL,'หมวดวิชาศึกษาทั่วไป',0,0),(15,'103-205','จิตวิทยาในชีวิตประจำวัน','Psychology in Daily Life',3,'3(3-0-6)','แนวคิดทางจิตวิทยาที่สำคัญ พัฒนาการวัยต่างๆ การรับรู้ การจูงใจ บุคลิกภาพและความแตกต่างระหว่างบุคคล ความหลากหลายทางเพศ อิทธิพลทางสังคมและพฤติกรรมทางสังคม การวิเคราะห์ปฏิสัมพันธ์ระหว่างบุคคล ความสัมพันธ์ที่ดี การจัดการความเครียด ความผิดปกติทางจิตและการบำบัด',1,1,NULL,'หมวดวิชาศึกษาทั่วไป',0,0),(16,'103-206','อาหาร การดูแลสุขภาพ และการออกกำลังกาย','Diet, Health Care and Exercise',3,'3(2-2-5)','สุขภาวะด้านร่างกาย จิตใจ อารมณ์ และสังคม อาหารและโภชนาการ การป้องกันและการบำบัดโรค ด้วยอาหาร ความปลอดภัยของอาหาร ฉลากโภชนาการ ผลิตภัณฑ์เสริมอาหารและการเลือกใช้ การออกกำลังกายเพื่อเสริมสร้างสมรรถภาพของร่างกาย ผลของการออกกำลังกายที่มีต่อระบบต่างๆในร่างกาย นวัตกรรมอาหารเพื่อสุขภาพ และเทคโนโลยีดิจิทัลเพื่อการออกกำลังกาย',1,1,NULL,'หมวดวิชาศึกษาทั่วไป',0,0),(17,'103-207','สารเคมีในชีวิตประจำวัน','Chemicals in Daily Life',3,'3(3-0-6)','สารเคมีที่ใช้ในชีวิตประจำวัน องค์ประกอบของสารเคมี สารเคมีประเภทธรรมชาติและสารสังเคราะห์ ที่เกี่ยวข้องกับชีวิตประจำวัน น้ำและเครื่องดื่ม สารปรุงแต่งอาหาร ความหมาย ประเภทและสารประกอบของเครื่อง สมอาง ความหมาย ประเภทและสมบัติของสารทำความสะอาด การป้องกันและการแก้พิษจากสารเคมี',1,1,NULL,'หมวดวิชาศึกษาทั่วไป',0,0),(18,'103-208','คณิตศาสตร์และสถิติในชีวิตประจำวัน','Mathematics and Statistics in Daily Life',3,'3(3-0-6)','คณิตศาสตร์และสถิติเบื้องต้น เพื่อนำไปใช้ในชีวิตประจำวัน โดยใช้ความรู้เรื่อง เรขาคณิต อัตราส่วน ร้อยละ ฟังก์ชัน ความรู้เบื้องต้นเกี่ยวกับสถิติ การเก็บรวบรวมข้อมูล การวิเคราะห์ข้อมูลด้วยสถิติแบบบรรยาย ความน่าจะเป็นกับการตัดสินใจอย่างง่าย',1,1,NULL,'หมวดวิชาศึกษาทั่วไป',0,0),(19,'103-209','ศิลปะและดนตรีเพื่อสุนทรียภาพแห่งชีวิต','Art and Music Appreciation',3,'3(3-0-6)','ความรู้เกี่ยวกับสุนทรียศาสตร์ ศิลปะในรูปแบบของสถาปัตยกรรม จิตรกรรม ประติมากรรม นาฎศิลป์ และดุริยางคศิลป์ ยุคสมัยต่างๆของศิลปะ แรงบันดาลใจเบื้องหลังผลงานศิลปะ ความซาบซึ้งในศิลปะ การประเมินคุณค่าทางสุนทรียะ ความสัมพันธ์ระหว่างศิลปะ ดนตรี กับชีวิต ศิลปะในชีวิตประจำวัน และคุณค่าความงามในงานศิลปะแขนงต่างๆ ในฐานะเป็นเครื่องมือจรรโลงจิตใจและสร้างสุนทรียภาพต่อชีวิตของมนุษย์',1,1,NULL,'หมวดวิชาศึกษาทั่วไป',0,0),(20,'103-210','นิยมไทยและอัศจรรย์ในสยาม','Thai Appreciation and Unseen in Siam',3,'3(3-0-6)','ศิลปะและวัฒนธรรม ขนบธรรมเนียมประเพณี เอกลักษณ์ความเป็นไทย มรดกทางภูมิปัญญาที่มีคุณค่า และน่าภาคภูมิใจ คติความเชื่อ ค่านิยม วิถีชีวิต แนวทางการอนุรักษ์ สืบทอดและเผยแพร่ความเป็นไทย',1,1,NULL,'หมวดวิชาศึกษาทั่วไป',0,0),(21,'103-211','การคิดเชิงสร้างสรรค์และการแก้ปัญหา','Creative Thinking and Problem Solving',3,'3(2-2-5)','กระบวนการคิดและเทคนิคการคิดสร้างสรรค์ในรูปแบบต่างๆ การค้นหาแนวทางหรือทางเลือกใหม่ๆในการทำงาน การวิเคราะห์ปัญหาและการใช้เครื่องมือช่วยในการตัดสินใจเลือกทางเลือกที่มีประสิทธิภาพสูงสุด',1,1,NULL,'หมวดวิชาศึกษาทั่วไป',0,0),(22,'103-212','การเป็นผู้ประกอบการและการสร้างธุรกิจใหม่','Entrepreneurship and New Business Creation',3,'3(2-2-5)','คุณลักษณะและแนวคิดการเป็นผู้ประกอบการ โอกาสทางธุรกิจ การวิเคราะห์สภาพแวดล้อมทางธุรกิจ การวางแผนกลยุทธ์ การตลาด การเงิน และการจัดการสําหรับธุรกิจใหม่ การจัดทำแผนธุรกิจเบื้องต้น',1,1,NULL,'หมวดวิชาศึกษาทั่วไป',0,0),(23,'103-301','หลักปรัชญาของเศรษฐกิจพอเพียงเพื่อการพัฒนาที่ยั่งยืน','Philosophy of Sufficiency Economy for Sustainable Development',3,'3(3-0-6)','ความเป็นมาและความหมายของปรัชญาของเศรษฐกิจพอเพียงตามแนวพระราชดำริ การประยุกต์ใช้ในระดับบุคคล ครอบครัว และชุมชน การขับเคลื่อนเศรษฐกิจพอเพียงในภาคส่วนต่างๆของสังคมและการเชื่อมโยงสู่การพัฒนาที่ยั่งยืน',1,1,NULL,'หมวดวิชาศึกษาทั่วไป',0,0),(24,'103-302','การออกแบบการคิดเพื่อสร้างนวัตกรรมและธุรกิจใหม่','Design Thinking for Innovation and New Business Creation',3,'3(2-2-5)','กระบวนการคิดเชิงออกแบบและการนำมาประยุกต์ใช้ในการระบุปัญหาและสร้างสรรค์นวัตกรรมด้านผลิตภัณฑ์ บริการ หรือโมเดลธุรกิจใหม่ๆ การทดสอบแนวคิดกับกลุ่มเป้าหมายและการพัฒนาเป็นต้นแบบธุรกิจ',1,1,NULL,'หมวดวิชาศึกษาทั่วไป',0,0),(25,'170-108','ชีวเคมี','Biochemistry',2,'2(2-0-4)','โครงสร้างและหน้าที่ของสารชีวโมเลกุลในร่างกายมนุษย์ เอนไซม์และฮอร์โมนที่ควบคุมเมแทบอลิซึม การสลายสารอาหารและการเก็บสะสมพลังงานในระดับเซลล์ ความพยาธิสภาพที่เกิดจากความผิดปกติทางชีวเคมี',1,1,NULL,'หมวดวิชาเฉพาะ',1,1),(26,'170-112','กายวิภาคศาสตร์และสรีรวิทยาของมนุษย์ 1','Human Anatomy and Physiology 1',3,'3(2-2-5)','โครงสร้างและหน้าที่ของร่างกายมนุษย์ในระดับเซลล์และเนื้อเยื่อ ระบบปกคลุมร่างกาย ระบบโครงร่าง ระบบกล้ามเนื้อ ระบบประสาท และระบบรับความรู้สึก กลไกการรักษาดุลยภาพของร่างกายและการฝึกปฏิบัติการที่เกี่ยวข้อง',1,1,NULL,'หมวดวิชาเฉพาะ',1,1),(27,'170-113','กายวิภาคศาสตร์และสรีรวิทยาของมนุษย์ 2','Human Anatomy and Physiology 2',3,'3(2-2-5)','โครงสร้างและหน้าที่ของระบบอวัยวะต่างๆ ต่อเนื่องจากภาค 1 ได้แก่ ระบบไหลเวียนโลหิต ระบบภูมิคุ้มกัน ระบบหายใจ ระบบย่อยอาหาร ระบบขับถ่ายปัสสาวะ ระบบต่อมไร้ท่อ และระบบสืบพันธุ์ รวมถึงการฝึกปฏิบัติการ',1,1,NULL,'หมวดวิชาเฉพาะ',1,2),(28,'170-116','การดูแลสุขภาพแบบผสมผสาน','Alternative and Complementary Health Care',2,'2(2-0-4)','แนวคิดและขอบเขตของการแพทย์ทางเลือกและการแพทย์ผสมผสาน สมาธิบำบัด วารีบำบัด การนวดไทย และศาสตร์ทางเลือกอื่นๆ เพื่อนำมาใช้ในการส่งเสริมสุขภาพและบรรเทาอาการเจ็บป่วยร่วมกับการแพทย์แผนปัจจุบัน',1,1,NULL,'หมวดวิชาเฉพาะเลือก',1,2),(29,'170-117','การดูแลสุขภาพความงามแบบองค์รวม','Holistic Beauty and Wellness Care',2,'2(2-0-4)','แนวคิดและหลักการดูแลสุขภาพความงามจากภายในสู่ภายนอก โภชนาการเพื่อความงาม สารต้านอนุมูลอิสระ การดูแลผิวพรรณ รูปร่าง และการชะลอวัยด้วยวิธีธรรมชาติและการแพทย์สมัยใหม่อย่างปลอดภัย',1,1,NULL,'หมวดวิชาเฉพาะเลือก',1,2),(30,'170-201','พยาธิสรีรวิทยาของมนุษย์','Human Pathophysiology',2,'2(2-0-4)','กลไกการเกิดโรคและความเปลี่ยนแปลงทางสรีรวิทยาในภาวะเจ็บป่วย พยาธิสภาพของโรคที่พบบ่อยในระบบอวัยวะต่างๆ การตอบสนองของเซลล์ต่อการบาดเจ็บ การอักเสบ และกลไกการปรับตัวของร่างกาย',1,1,NULL,'หมวดวิชาเฉพาะ',2,1),(31,'170-208','จุลชีววิทยาและปรสิตวิทยาของมนุษย์','Human Microbiology and Parasitology',2,'2(1-2-3)','คุณลักษณะ กลไกการก่อโรค และการแพร่กระจายของเชื้อแบคทีเรีย ไวรัส เชื้อรา และปรสิตที่ก่อโรคในมนุษย์ ปฏิกิริยาภูมิคุ้มกันของร่างกาย หลักการควบคุมเชื้อและการทำลายเชื้อและการฝึกปฏิบัติการ',1,1,NULL,'หมวดวิชาเฉพาะ',2,1),(32,'170-211','การพยาบาลพื้นฐาน 1','Fundamentals of Nursing 1',3,'3(2-2-5)','แนวคิดพื้นฐานทางการพยาบาล กระบวนการพยาบาล หลักการตอบสนองความต้องการขั้นพื้นฐานด้านความสุขสบาย สุขอนามัย และความปลอดภัยของผู้ป่วย การควบคุมการติดเชื้อในโรงพยาบาล และการฝึกปฏิบัติในห้องปฏิบัติการ',1,1,NULL,'หมวดวิชาเฉพาะ',2,1),(33,'170-212','การพยาบาลพื้นฐาน 2','Fundamentals of Nursing 2',2,'2(1-2-3)','หลักการและเทคนิคการทำหัตถการทางการพยาบาลที่ซับซ้อนขึ้น การวัดสัญญาณชีพ การเก็บสิ่งส่งตรวจ การให้ออกซิเจน การดูดเสมหะ การแต่งแผล หลักเกณฑ์ความปลอดภัยในการบริหารยา และการฝึกปฏิบัติในห้องปฏิบัติการ',1,1,NULL,'หมวดวิชาเฉพาะ',2,2),(34,'170-216','เภสัชวิทยาทางการพยาบาล','Pharmacology in Nursing',2,'2(2-0-4)','กลไกการออกฤทธิ์ เภสัชจลนศาสตร์ ข้อบ่งใช้ ผลข้างเคียง และข้อควรระวังของยาในกลุ่มต่างๆ บทบาทหน้าที่ของพยาบาลในการบริหารยาอย่างปลอดภัย การคำนวณขนาดยา และการพยาบาลผู้ป่วยที่ได้รับยา',1,1,NULL,'หมวดวิชาเฉพาะ',2,1),(35,'170-222','จรรยาบรรณวิชาชีพการพยาบาลและกฎหมายที่เกี่ยวข้อง','Nursing Ethics and Related Laws',2,'2(2-0-4)','แนวคิดทางจริยธรรม จรรยาบรรณวิชาชีพพยาบาล สิทธิผู้ป่วย กฎหมายวิชาชีพการพยาบาลและผดุงครรภ์ และกฎหมายสาธารณสุขที่เกี่ยวข้องกับการปฏิบัติการพยาบาล การตัดสินใจเชิงจริยธรรมในสถานการณ์ปัญหาขัดแย้ง',1,1,NULL,'หมวดวิชาเฉพาะ',2,2),(36,'170-224','ชีวสถิติทางสุขภาพ','Biostatistics for Health',2,'2(2-0-4)','สถิติพรรณนาและสถิติอ้างอิงที่ประยุกต์ใช้ในงานวิทยาศาสตร์สุขภาพ การทดสอบสมมติฐาน การเลือกใช้สถิติที่เหมาะสมในการวิเคราะห์ข้อมูล และการใช้โปรแกรมคอมพิวเตอร์สำเร็จรูปเพื่อการวิเคราะห์และแปลผล',1,1,NULL,'หมวดวิชาเฉพาะ',2,1),(37,'170-228','พัฒนาการมนุษย์และการสร้างเสริมสุขภาพ','Human Development and Health Promotion',2,'2(2-0-4)','ทฤษฎีและพัฒนาการของมนุษย์ในทุกช่วงวัย ปัจจัยที่มีผลต่อการเจริญเติบโต แนวคิดและแนวทางการสร้างเสริมสุขภาพ การป้องกันโรค และการประเมินภาวะสุขภาพตามกลุ่มวัย พฤติกรรมสุขภาพและแบบแผนการดำเนินชีวิต',1,1,NULL,'หมวดวิชาเฉพาะ',2,1),(38,'170-229','โภชนบำบัด','Diet Therapy',2,'2(2-0-4)','หลักโภชนาการปกติและความต้องการสารอาหารในแต่ละวัย หลักการจัดอาหารบำบัดโรคสำหรับผู้ป่วยที่มีพยาธิสภาพต่างๆ เช่น เบาหวาน ความดันโลหิตสูง โรคไต โรคหัวใจ บทบาทพยาบาลในการดูแลและให้คำแนะนำด้านอาหาร',1,1,NULL,'หมวดวิชาเฉพาะ',2,1),(39,'170-226','การพยาบาลผู้ใหญ่','Adult Nursing',3,'3(3-0-6)','การพยาบาลแบบองค์รวมสำหรับผู้ป่วยวัยผู้ใหญ่ที่มีปัญหาสุขภาพในระยะเฉียบพลัน กึ่งเฉียบพลัน และเรื้อรัง ของระบบทางเดินหายใจ ไหลเวียนโลหิต ทางเดินอาหาร ทางเดินปัสสาวะ ต่อมไร้ท่อ และระบบประสาท โดยใช้กระบวนการพยาบาล',1,1,NULL,'หมวดวิชาเฉพาะ',2,2),(40,'170-227','มโนมติ ทฤษฎีการพยาบาล และบริการด้วยหัวใจความเป็นมนุษย์','Concepts, Nursing Theories, and Humanized Care Service',2,'2(2-0-4)','มโนมติหลักทางการพยาบาล วิวัฒนาการของวิชาชีพ ทฤษฎีการพยาบาลที่สำคัญและการนำไปประยุกต์ใช้ในการปฏิบัติ แนวคิดและค่านิยมการบริการด้วยหัวใจความเป็นมนุษย์ ความเอื้ออาทร และการเคารพศักดิ์ศรีความเป็นมนุษย์',1,1,NULL,'หมวดวิชาเฉพาะ',2,2),(41,'170-230','กระบวนการพยาบาลและการประเมินภาวะสุขภาพ','Nursing Process and Health Assessment',2,'2(1-2-3)','ขั้นตอนและองค์ประกอบของกระบวนการพยาบาล หลักการและเทคนิคการประเมินภาวะสุขภาพทางกาย จิต สังคม จิตวิญญาณ การซักประวัติ การตรวจร่างกายทุกระบบ การบันทึกข้อมูลสุขภาพ และการฝึกทักษะการตรวจร่างกาย',1,1,NULL,'หมวดวิชาเฉพาะ',2,2),(42,'170-231','การประยุกต์ใช้ AI และเทคโนโลยีดิจิทัลทางการพยาบาล','Application of AI and Digital Technology in Nursing',2,'2(1-2-3)','แนวคิดและการประยุกต์ใช้ปัญญาประดิษฐ์ (AI) เทคโนโลยีดิจิทัล และสารสนเทศในการจัดการข้อมูลสุขภาพ ระบบบันทึกทางการพยาบาลอิเล็กทรอนิกส์ การพยาบาลทางไกล (Telenursing) และจริยธรรมความปลอดภัยของข้อมูล',1,1,NULL,'หมวดวิชาเฉพาะ',2,2),(43,'170-324','การพยาบาลผู้สูงอายุ','Gerontological Nursing',2,'2(2-0-4)','กระบวนการชราภาพและการเปลี่ยนแปลงในผู้สูงอายุ กลุ่มอาการที่พบบ่อยในผู้สูงอายุ การประเมินภาวะสุขภาพผู้สูงอายุแบบองค์รวม การพยาบาลผู้สูงอายุที่มีปัญหาสุขภาพเฉียบพลันและเรื้อรัง และการดูแลในระยะท้าย',1,1,NULL,'หมวดวิชาเฉพาะ',3,1),(44,'170-348','การพยาบาลเด็กและวัยรุ่น','Pediatric and Adolescent Nursing',3,'3(3-0-6)','การเจริญเติบโต พัฒนาการ และพยาธิสภาพของโรคที่พบบ่อยในทารก เด็ก และวัยรุ่น การประยุกต์ใช้กระบวนการพยาบาลในการดูแลเด็กที่มีภาวะเจ็บป่วยเฉียบพลัน เรื้อรัง และวิกฤต โดยเน้นครอบครัวเป็นศูนย์กลาง',1,1,NULL,'หมวดวิชาเฉพาะ',3,1),(45,'170-349','การพยาบาลวิกฤตและฉุกเฉิน','Critical Care and Emergency Nursing',2,'2(2-0-4)','หลักการพยาบาลในภาวะฉุกเฉินและวิกฤตคุกคามต่อชีวิต การคัดแยกผู้ป่วย การประเมินและเฝ้าระวังอาการอย่างรวดเร็วต่อเนื่อง พยาธิสภาพของผู้ป่วยภาวะช็อก บาดเจ็บรุนแรงหลายระบบ และหลักการช่วยฟื้นคืนชีพขั้นสูง',1,1,NULL,'หมวดวิชาเฉพาะ',3,1),(46,'170-350','การพยาบาลสุขภาพจิตและจิตเวชศาสตร์','Psychiatric and Mental Health Nursing',3,'3(3-0-6)','แนวคิด ทฤษฎี และลักษณะทางคลินิกของโรคทางจิตเวชที่พบบ่อย ปัจจัยที่มีผลต่อสุขภาพจิต การประยุกต์ใช้กระบวนการพยาบาลในการดูแลแบบองค์รวมแก่ผู้รับบริการที่มีปัญหาสุขภาพจิต การบำบัดทางการพยาบาลจิตเวช',1,1,NULL,'หมวดวิชาเฉพาะ',3,1),(47,'170-351','การพยาบาลมารดาและทารก','Maternal and Newborn Nursing',3,'3(3-0-6)','แนวคิดและทฤษฎีการพยาบาลในการดูแลสตรีในระยะตั้งครรภ์ ระยะคลอด และระยะหลังคลอดปกติ พยาธิสรีรวิทยาและการเปลี่ยนแปลงตามธรรมชาติ การประเมินสุขภาพมารดาและทารกในครรภ์ กลไกการคลอด และการบริบาลทารกแรกเกิด',1,1,NULL,'หมวดวิชาเฉพาะ',3,1),(48,'170-352','การผดุงครรภ์','Midwifery',3,'3(3-0-6)','กฎหมายและขอบเขตวิชาชีพผดุงครรภ์ การพยาบาลและการผดุงครรภ์ในสตรีที่มีภาวะแทรกซ้อนในระยะตั้งครรภ์ ระยะคลอด และระยะหลังคลอด ทารกแรกเกิดที่มีภาวะเสี่ยงหรือพยาธิสภาพ การเฝ้าระวังและการพยาบาลในภาวะฉุกเฉิน',1,1,NULL,'หมวดวิชาเฉพาะ',3,2),(49,'170-353','การพยาบาลอนามัยชุมชน','Community Health Nursing',3,'3(3-0-6)','หลักการสาธารณสุขและการพยาบาลอนามัยชุมชน ระบบบริการสุขภาพปฐมภูมิ เครื่องมือศึกษาชุมชน การประเมินและการวางแผนแก้ปัญหาอนามัยชุมชน การประยุกต์ใช้กระบวนการพยาบาลในการดูแลครอบครัวและกลุ่มเฉพาะ',1,1,NULL,'หมวดวิชาเฉพาะ',3,1),(50,'170-354','กระบวนการวิจัยทางวิชาชีพ','Professional Research Process',2,'2(2-0-4)','ความสำคัญของการวิจัยทางการพยาบาล จริยธรรมการวิจัยในมนุษย์ ขั้นตอนกระบวนการวิจัย ตั้งแต่การกำหนดปัญหาวิจัย การทบทวนวรรณกรรม รูปแบบการวิจัย เครื่องมือ การเก็บรวบรวมข้อมูล และการวิเคราะห์แปลผลข้อมูล',1,1,NULL,'หมวดวิชาเฉพาะ',3,1),(51,'170-448','การรักษาพยาบาลเบื้องต้น','Primary Medical Care',2,'2(2-0-4)','หลักการและขอบเขตการรักษาพยาบาลเบื้องต้นโดยพยาบาลตามกฎหมาย การซักประวัติ ตรวจร่างกาย และใช้เหตุผลทางคลินิกเพื่อวินิจฉัยแยกโรค อาการเจ็บป่วยและโรคที่พบบ่อย การสั่งใช้ยาตามขอบเขตวิชาชีพ และการส่งต่อ',1,1,NULL,'หมวดวิชาเฉพาะ',4,1),(52,'170-457','ภาวะผู้นำและการบริหารทางการพยาบาล','Leadership and Nursing Management',2,'2(2-0-4)','แนวคิดทฤษฎีภาวะผู้นำ การจัดการองค์กรพยาบาล กระบวนการบริหารจัดการทางการพยาบาล (วางแผน จัดองค์กร บริหารงานบุคคล อำนวยการ ควบคุม) การประกันคุณภาพการพยาบาล การบริหารความเสี่ยงและความขัดแย้ง',1,1,NULL,'หมวดวิชาเฉพาะ',4,1),(53,'170-232','ปฏิบัติการพยาบาลพื้นฐาน','Practicum in Fundamentals of Nursing',2,'2(0-8-0)','การฝึกปฏิบัติการพยาบาลบนหอผู้ป่วยในการดูแลผู้ป่วยที่มีความต้องการขั้นพื้นฐาน โดยใช้กระบวนการพยาบาลและทักษะหัตถการพื้นฐาน การสื่อสารเพื่อการบำบัด ความปลอดภัย การบริหารยา และการบันทึกรายงาน',1,1,NULL,'หมวดวิชาเฉพาะ',2,2),(54,'170-327','ปฏิบัติการสุขภาพจิตและจิตเวชศาสตร์','Practicum in Psychiatric and Mental Health Nursing',2,'2(0-8-0)','การฝึกปฏิบัติการพยาบาลในการดูแลผู้รับบริการที่มีปัญหาสุขภาพจิตและโรคทางจิตเวช การสร้างสัมพันธภาพและการสื่อสารเพื่อการบำบัดรายบุคคลและกลุ่ม กิจกรรมบำบัด การบริหารยาจิตเวช และการคุ้มครองสิทธิผู้ป่วย',1,1,NULL,'หมวดวิชาเฉพาะ',3,1),(55,'170-331','ปฏิบัติการพยาบาลเด็กและวัยรุ่น','Practicum in Pediatric Nursing',2,'2(0-8-0)','การฝึกปฏิบัติการพยาบาลในการดูแลทารก เด็ก และวัยรุ่น ที่มีภาวะเจ็บป่วยเฉียบพลัน เรื้อรัง และวิกฤต ในหอผู้ป่วยเด็ก โดยใช้กระบวนการพยาบาล การประเมินภาวะสุขภาพและพัฒนาการ และการบริหารยาอย่างปลอดภัย',1,1,NULL,'หมวดวิชาเฉพาะ',3,2),(56,'170-337','ปฏิบัติการพยาบาลมารดาและทารก','Practicum in Maternal and Newborn Nursing',2,'2(0-8-0)','การฝึกปฏิบัติการพยาบาลในการดูแลสตรีในระยะตั้งครรภ์ ระยะคลอด ระยะหลังคลอดปกติและมีความเสี่ยง และการดูแลทารกแรกเกิดในแผนกฝากครรภ์ ห้องคลอด และหอผู้ป่วยหลังคลอด โดยใช้กระบวนการพยาบาลและการทำคลอดปกติ',1,1,NULL,'หมวดวิชาเฉพาะ',3,2),(57,'170-338','ปฏิบัติการผดุงครรภ์ 1','Practicum in Midwifery 1',2,'2(0-8-0)','การฝึกปฏิบัติการผดุงครรภ์ในการตรวจครรภ์ การทำคลอดปกติ การดูแลทารกแรกเกิดทันทีหลังคลอด การเย็บแผลฝีเย็บ และการดูแลมารดาและทารกในระยะหลังคลอดปกติ ตามขอบเขตมาตรฐานวิชาชีพ',1,1,NULL,'หมวดวิชาเฉพาะ',3,2),(58,'170-339','ปฏิบัติการพยาบาลผู้ใหญ่และผู้สูงอายุ','Practicum in Adult and Gerontological Nursing',4,'4(0-16-0)','การฝึกปฏิบัติการพยาบาลในการดูแลผู้ป่วยวัยผู้ใหญ่และผู้สูงอายุที่มีปัญหาสุขภาพเฉียบพลันและเรื้อรัง โดยประยุกต์ใช้กระบวนการพยาบาลแบบองค์รวม ทักษะหัตถการที่ซับซ้อนอย่างปลอดภัย และการเฝ้าระวังอาการ',1,1,NULL,'หมวดวิชาเฉพาะ',3,1),(59,'170-340','ปฏิบัติการพยาบาลผู้ป่วยวิกฤตและฉุกเฉิน','Practicum in Critical Care and Emergency Nursing',2,'2(0-8-0)','การฝึกปฏิบัติการพยาบาลใน ICU หรือ ER ในการดูแลผู้ป่วยภาวะวิกฤตหรือฉุกเฉินคุกคามต่อชีวิต การประเมินและเฝ้าระวังอาการอย่างรวดเร็วต่อเนื่อง การกู้ชีพขั้นสูง และการใช้เทคโนโลยีขั้นสูงในการดูแลผู้ป่วย',1,1,NULL,'หมวดวิชาเฉพาะ',3,1),(60,'170-355','ปฏิบัติการพยาบาลอนามัยชุมชน','Practicum in Community Health Nursing',2,'2(0-8-0)','การฝึกปฏิบัติการพยาบาลอนามัยชุมชน การใช้เครื่องมือและกระบวนการศึกษาชุมชน การจัดทำโครงการพัฒนาสุขภาพร่วมกับชุมชน การจัดกิจกรรมสร้างเสริมสุขภาพ การป้องกันโรค และการฝึกปฏิบัติการพยาบาลที่บ้าน',1,1,NULL,'หมวดวิชาเฉพาะ',3,2),(61,'170-431','ปฏิบัติการผดุงครรภ์ 2','Practicum in Midwifery 2',2,'2(0-8-0)','การฝึกปฏิบัติการผดุงครรภ์ในการดูแลมารดาและทารกในระยะตั้งครรภ์ ระยะคลอด และระยะหลังคลอดที่มีภาวะแทรกซ้อนหรือความเสี่ยงสูง การช่วยเหลือเบื้องต้นในภาวะฉุกเฉินทางสูติศาสตร์อย่างถูกต้องปลอดภัย',1,1,NULL,'หมวดวิชาเฉพาะ',4,1),(62,'170-449','ปฏิบัติการรักษาพยาบาลเบื้องต้น','Practicum in Primary Medical Care',2,'2(0-8-0)','การฝึกปฏิบัติการรักษาพยาบาลเบื้องต้นในหน่วยบริการปฐมภูมิหรือ ER/OPD ทักษะการซักประวัติ ตรวจร่างกาย วินิจฉัยแยกโรคเบื้องต้น สั่งใช้ยาตามขอบเขต การทำหัตถการเย็บแผล ล้างแผล ถอดเล็บ และการส่งต่อผู้ป่วย',1,1,NULL,'หมวดวิชาเฉพาะ',4,1),(63,'170-458','ปฏิบัติการจัดการพยาบาล','Practicum in Nursing Management',2,'2(0-8-0)','การฝึกปฏิบัติการบริหารจัดการทางการพยาบาลบนหอผู้ป่วยในฐานะหัวหน้าเวร ทักษะภาวะผู้นำ การมอบหมายงาน การนิเทศการพยาบาล การบริหารความเสี่ยง คุมคุณภาพการพยาบาล และการทำงานร่วมกับสหสาขาวิชาชีพ',1,1,NULL,'หมวดวิชาเฉพาะ',4,2),(64,'170-459','ปฏิบัติการพยาบาลรวบยอดวิกฤตและฉุกเฉิน','Comprehensive Practicum in Critical Care and Emergency Nursing',3,'3(0-12-0)','การฝึกปฏิบัติการพยาบาลรวบยอดในสภาวะวิกฤตและฉุกเฉิน บูรณาการองค์ความรู้ ทฤษฎี และงานวิจัยเชิงประจักษ์ในการดูแลผู้ป่วยวิกฤตและฉุกเฉินที่มีความซับซ้อนสูง เพื่อเตรียมความพร้อมสู่การเป็นพยาบาลวิชาชีพ',1,1,NULL,'หมวดวิชาเฉพาะ',4,2),(65,'170-114','เคมีอินทรีย์พื้นฐาน','Basic Organic Chemistry',2,'2(2-0-4)','โครงสร้าง การเรียกชื่อ ไอโซเมอริซึม และปฏิกิริยาเคมีของสารประกอบอินทรีย์กลุ่มต่างๆ ที่มีความสำคัญทางชีวภาพและทางการแพทย์',1,1,NULL,'หมวดวิชาเฉพาะ',1,1),(66,'170-115','ฟิสิกส์การแพทย์เบื้องต้น','Introduction to Medical Physics',2,'2(2-0-4)','หลักการทางฟิสิกส์ที่ประยุกต์ใช้ในทางการแพทย์ เช่น กลศาสตร์ของของไหลในระบบหมุนเวียน คลื่นเสียงและอัลตราซาวด์ รังสีและการป้องกันรังสี',1,1,NULL,'หมวดวิชาเฉพาะ',1,2),(67,'170-235','พันธุศาสตร์ทางการแพทย์และจีโนมิกส์','Medical Genetics and Genomics',2,'2(2-0-4)','การถ่ายทอดลักษณะทางพันธุกรรม โครงสร้างดีเอ็นเอ ความผิดปกติของโครโมโซม โรคทางพันธุกรรมที่พบบ่อย และแนวคิดจีโนมิกส์ในการรักษาแบบแม่นยำ',1,1,NULL,'หมวดวิชาเฉพาะ',2,1),(68,'170-236','วิทยาภูมิคุ้มกันพื้นฐาน','Basic Immunology',2,'2(2-0-4)','กลไกการตอบสนองทางภูมิคุ้มกันของร่างกาย ทั้งแบบจำเพาะและไม่จำเพาะ อวัยวะและเซลล์ในระบบภูมิคุ้มกัน ความผิดปกติของระบบภูมิคุ้มกันและการแพ้ยา',1,1,NULL,'หมวดวิชาเฉพาะ',2,2),(69,'170-356','การพยาบาลบรรเทาอาการและดูแลระยะท้าย','Palliative and End-of-Life Care',2,'2(2-0-4)','หลักการดูแลแบบประคับประคอง การจัดการความปวดและอาการทุกข์ทรมาน การสนับสนุนทางจิตสังคมและจิตวิญญาณแก่ผู้ป่วยระยะท้ายและครอบครัว',1,1,NULL,'หมวดวิชาเฉพาะ',3,2),(70,'170-357','สารสนเทศศาสตร์สุขภาพ','Health Informatics',2,'2(1-2-3)','ระบบข้อมูลสารสนเทศในโรงพยาบาล มาตรฐานรหัสทางการแพทย์ การจัดการฐานข้อมูลสุขภาพ และแนวโน้มเทคโนโลยีสารสนเทศสุขภาพในอนาคต',1,1,NULL,'หมวดวิชาเฉพาะ',3,1),(71,'170-460','การเตรียมความพร้อมเพื่อการทำงานในอนาคต','Preparation for Future Career',1,'1(0-2-1)','การพัฒนาบุคลิกภาพ เทคนิคการสมัครงานและการสัมภาษณ์ ภาษาอังกฤษเพื่อการทำงาน จริยธรรมในการทำงาน และการวางแผนเส้นทางอาชีพในอนาคต',1,1,NULL,'หมวดวิชาเฉพาะ',4,1),(72,'170-461','การประมวลความรู้ทางวิชาชีพการพยาบาล','Comprehensive Review of Professional Nursing',2,'2(2-0-4)','การทบทวนและประมวลความรู้รวบยอดในศาสตร์ทางการพยาบาลทุกสาขาวิชา เพื่อเตรียมความพร้อมในการสอบขึ้นทะเบียนรับใบอนุญาตประกอบวิชาชีพ',1,1,NULL,'หมวดวิชาเฉพาะ',4,2),(73,'170-462','การฝึกปฏิบัติการพยาบาลเลือกสรร','Elective Practicum in Nursing',2,'2(0-8-0)','การเลือกฝึกปฏิบัติงานในหอผู้ป่วยหรือสาขาวิชาที่นักศึกษาสนใจเป็นพิเศษ เพื่อเพิ่มพูนทักษะและความมั่นใจก่อนจบการศึกษาเป็นพยาบาลวิชาชีพ',1,1,NULL,'หมวดวิชาเฉพาะเลือก',4,2);
/*!40000 ALTER TABLE `subject` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `system_sidebar_menus`
--

DROP TABLE IF EXISTS `system_sidebar_menus`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `system_sidebar_menus` (
  `menu_id` bigint NOT NULL AUTO_INCREMENT,
  `title` varchar(100) NOT NULL COMMENT 'ชื่อเมนูที่แสดงผล',
  `url` varchar(100) NOT NULL COMMENT 'Key หรือ URL สำหรับ Frontend (เช่น course-students)',
  `icon` varchar(50) DEFAULT 'BookOpen' COMMENT 'ชื่อ Icon จาก Lucide React (เช่น Bell, Users)',
  `permission_required` varchar(100) DEFAULT NULL COMMENT 'ชื่อสิทธิ์ที่ต้องมีถึงจะเห็นเมนูนี้ (ตรงกับ permissions.name)',
  `section_title` varchar(100) DEFAULT NULL COMMENT 'กลุ่มของเมนู (เช่น การจัดการเรียนการสอน, งานหลักสูตร)',
  `is_active` tinyint(1) DEFAULT '1' COMMENT 'สถานะเปิด/ปิดเมนู',
  PRIMARY KEY (`menu_id`),
  KEY `idx_permission` (`permission_required`)
) ENGINE=InnoDB AUTO_INCREMENT=29 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `system_sidebar_menus`
--

LOCK TABLES `system_sidebar_menus` WRITE;
/*!40000 ALTER TABLE `system_sidebar_menus` DISABLE KEYS */;
INSERT INTO `system_sidebar_menus` VALUES (1,'จัดการข้อมูลผู้ใช้','users-management','Users','USER_ROLE_MANAGE','จัดการระบบ',1),(2,'จัดการสิทธิ์/ตำแหน่ง','roles-management','Shield','USER_ROLE_MANAGE','จัดการระบบ',1),(3,'นำเข้าข้อมูลระบบ','import-data','Upload','DATA_IMPORT_EXPORT','จัดการระบบ',1),(4,'ส่งออกข้อมูลระบบ','export-data','Download','DATA_IMPORT_EXPORT','จัดการระบบ',1),(5,'Audit Log','audit-log','ClipboardList','AUDIT_LOG_VIEW','จัดการระบบ',1),(6,'อนุมัติคำร้องขอ','approvals','CheckSquare','ADMIN_APPROVALS','จัดการระบบ',1),(7,'รายงานระบบ','reports','FileText','ADMIN_REPORTS','จัดการระบบ',1),(8,'แดชบอร์ด KPI คณะ','dean-dashboard','LayoutDashboard','VIEW_DEAN_DASHBOARD','การบริหารคณะ',1),(9,'อัตราคงอยู่ของ นศ.','retention','UserCheck','VIEW_RETENTION','การบริหารคณะ',1),(10,'กำหนด CLO รายวิชา','clos','Target','CLO_MANAGE','งานหลักสูตร',1),(11,'ตาราง CLO Map','clo-map','Grid','CLO_MAP_EDIT','งานหลักสูตร',1),(12,'จัดอาจารย์ผู้สอน','assign-instructors','UserPlus','ASSIGN_INSTRUCTORS','งานหลักสูตร',1),(13,'รายงานรายวิชา (มคอ.)','course-report','FileBarChart','COURSE_REPORT_MANAGE','งานหลักสูตร',1),(14,'รายงานวิเคราะห์ PLO/YLO','plo-ylo-report','TrendingUp','CURRICULUM_REPORT_VIEW','งานหลักสูตร',1),(15,'สรุปข้อมูลสะสม 5 ปี','five-year-summary','CalendarDays','COURSE_REPORT_EXPORT','งานหลักสูตร',1),(16,'วิชาที่รับผิดชอบ','my-courses','BookOpen','STUDENT_VIEW_COURSE','การจัดการเรียนการสอน',1),(17,'จัดส่งคลังเอกสาร','documents','FolderPlus','RESEARCH_UPLOAD','การจัดการเรียนการสอน',1),(18,'ประเมินผลปฏิบัติการ','practical-students','FileCheck','CLINICAL_EVIDENCE_UPLOAD','การจัดการเรียนการสอน',1),(19,'นักศึกษาในความดูแล','advises','HeartHandshake','ADVISOR_STUDENT_VIEW','งานที่ปรึกษา',1),(20,'โครงการและวิจัย','projectspage','Award','PROJECT_VIEW','โครงการ คณะ',1),(21,'ข้อมูลส่วนตัว','profile','User','PROFILE_VIEW_SELF','ระบบทั่วไป',1),(22,'การตั้งค่าระบบ','settings','Settings','SYSTEM_SETTINGS','ระบบทั่วไป',1),(23,'การแจ้งเตือน','notifications','Bell','NOTIFICATION_VIEW','ระบบทั่วไป',1),(24,'โครงการของฉัน','my-projects','Folder','PROJECT_MY_VIEW','โครงการ คณะ',1),(25,'เอกสารโครงการ','project-docs','FileText','PROJECT_DOCS_MANAGE','โครงการ คณะ',1),(26,'เชื่อมโยงระดับ LO','project-links','Link2','PROJECT_LINKS_MANAGE','โครงการ คณะ',1),(27,'รายงานโครงการ','project-reports','BarChart3','PROJECT_REPORTS_VIEW','โครงการ คณะ',1),(28,'ข้อมูลนักศึกษา','transcript','User','STUDENT_VIEW_TRANSCRIPT',NULL,1);
/*!40000 ALTER TABLE `system_sidebar_menus` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `user_notification_settings`
--

DROP TABLE IF EXISTS `user_notification_settings`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `user_notification_settings` (
  `user_id` bigint NOT NULL,
  `email_notifications` tinyint(1) NOT NULL DEFAULT '1',
  `push_notifications` tinyint(1) NOT NULL DEFAULT '1',
  `grade_notifications` tinyint(1) NOT NULL DEFAULT '1',
  `project_notifications` tinyint(1) NOT NULL DEFAULT '1',
  `student_notifications` tinyint(1) NOT NULL DEFAULT '1',
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`user_id`),
  CONSTRAINT `user_notification_settings_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`user_id`) ON DELETE CASCADE ON UPDATE RESTRICT
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `user_notification_settings`
--

LOCK TABLES `user_notification_settings` WRITE;
/*!40000 ALTER TABLE `user_notification_settings` DISABLE KEYS */;
/*!40000 ALTER TABLE `user_notification_settings` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `user_position`
--

DROP TABLE IF EXISTS `user_position`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `user_position` (
  `user_position_id` bigint NOT NULL AUTO_INCREMENT,
  `user_id` bigint NOT NULL,
  `position_id` bigint NOT NULL,
  `is_primary` tinyint(1) DEFAULT '0',
  `effective_from` date DEFAULT NULL,
  `effective_to` date DEFAULT NULL,
  PRIMARY KEY (`user_position_id`),
  KEY `user_id` (`user_id`),
  KEY `position_id` (`position_id`),
  CONSTRAINT `user_position_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`user_id`) ON DELETE CASCADE ON UPDATE RESTRICT,
  CONSTRAINT `user_position_ibfk_2` FOREIGN KEY (`position_id`) REFERENCES `position` (`position_id`) ON DELETE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=24 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `user_position`
--

LOCK TABLES `user_position` WRITE;
/*!40000 ALTER TABLE `user_position` DISABLE KEYS */;
INSERT INTO `user_position` VALUES (1,4,5,1,NULL,NULL),(2,5,7,1,NULL,NULL),(3,6,1,1,NULL,NULL),(5,7,6,1,NULL,NULL),(16,9,3,1,NULL,NULL),(17,10,4,1,NULL,NULL),(18,1,8,1,NULL,NULL),(23,8,2,1,NULL,NULL);
/*!40000 ALTER TABLE `user_position` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `users`
--

DROP TABLE IF EXISTS `users`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `users` (
  `user_id` bigint NOT NULL AUTO_INCREMENT,
  `username` varchar(100) NOT NULL COMMENT 'ชื่อผู้ใช้ (ห้ามซ้ำ)',
  `password_hash` varchar(255) NOT NULL COMMENT 'รหัสผ่านที่เข้ารหัสแล้ว (ห้ามเก็บ Plain text)',
  `role_id` bigint NOT NULL COMMENT 'เชื่อมกับตาราง Role เพื่อบอกว่าเป็นใคร',
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`user_id`)
) ENGINE=InnoDB AUTO_INCREMENT=12 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `users`
--

LOCK TABLES `users` WRITE;
/*!40000 ALTER TABLE `users` DISABLE KEYS */;
INSERT INTO `users` VALUES (1,'6603400001','$2y$10$W68TSe8x0O9Jf/1A35UBQOKJqkoiSrngXhd3Ol.ewbocGr9m5LYpu',3,'2026-02-02 09:35:39'),(2,'41172008','$2b$10$j1SVNQaVRzBnqslL5uRJHutWtaiR9swr4FurLe4W9gWoPxmogIGN2',2,'2026-02-02 10:13:06'),(3,'42172021','$2y$10$bJy3Lgxp.IuluGEUSMSUkeugFjAPf2f2nWW/CNFBYplLFxM59IRUm',2,'2026-02-12 22:02:38'),(4,'41172011','$2y$10$3K1ZE8cjAfEJKOeV1CrjJ.XzEObB75V3KBpWjDk/X6DaCg1ihyaiC',2,'2026-02-14 03:47:25'),(5,'46172040','$2b$10$nrmbPOGrudK0kL3.4hvx5eQWbee5WC914plP9ievbFpdoal9WN1ti',1,'2026-02-14 16:13:36'),(6,'41172017','$2b$10$9pV04j8XCCeBmWDBTzPhcugwvEfWS27ffvwyiRs5tr3YHZfH64WDK',2,'2026-02-14 18:02:44'),(7,'63172133','$2b$10$oT3JXZOS.n5r4dsFQK3dHeQYleS32HDjnKuyV3UlAWFOOV0v6985G',2,'2026-03-01 18:20:12'),(8,'6604800008','$2y$10$NqeqUCzI4OhQi8J0ddkbqOwLuaEBOae042PzbJ0iwhjYSEb0bR64i',2,'2026-05-21 17:17:08'),(9,'42172025','$2y$10$TfkZ3lzpWOxZTlGxK.8r3erci6NQGe1QZXS.27asX9j1BMqGCgoqa',2,'2026-05-25 17:50:02'),(10,'44172033','$2y$10$uVuIEmzZHNvFVk8av2MtHea193S.sfwnnHprWF4B44zY6eN4uS88W',2,'2026-05-25 17:51:02'),(11,'45172037','$2y$10$rATIrVpcMCe/MerkOSxMJuCoCIWDbYWZkDQ5LBDAiX0SFeMYDspKy',2,'2026-06-17 14:49:28');
/*!40000 ALTER TABLE `users` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `ylo`
--

DROP TABLE IF EXISTS `ylo`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `ylo` (
  `ylo_id` bigint NOT NULL AUTO_INCREMENT,
  `plo_id` bigint DEFAULT NULL COMMENT 'เชื่อมกลับไปหา PLO แม่',
  `year` varchar(20) DEFAULT NULL COMMENT 'ชั้นปีที่เป้าหมายนี้บังคับใช้',
  `target_percent` int DEFAULT NULL COMMENT 'ค่าเป้าหมาย (%)',
  `description` text,
  PRIMARY KEY (`ylo_id`),
  KEY `plo_id` (`plo_id`),
  CONSTRAINT `ylo_ibfk_1` FOREIGN KEY (`plo_id`) REFERENCES `plo` (`plo_id`) ON DELETE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `ylo`
--

LOCK TABLES `ylo` WRITE;
/*!40000 ALTER TABLE `ylo` DISABLE KEYS */;
INSERT INTO `ylo` VALUES (1,NULL,'ปี 1',NULL,NULL),(2,NULL,'ปี 2',NULL,NULL),(3,NULL,'ปี 3',NULL,NULL),(4,NULL,'ปี 4',NULL,NULL);
/*!40000 ALTER TABLE `ylo` ENABLE KEYS */;
UNLOCK TABLES;
SET @@SESSION.SQL_LOG_BIN = @MYSQLDUMP_TEMP_LOG_BIN;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2026-07-11 11:43:14
